<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[애매한중년개발자 blog]]></title><description><![CDATA[개발 관련 메모장]]></description><link>https://blog.midagedev.com/</link><image><url>https://blog.midagedev.com/favicon.png</url><title>애매한중년개발자 blog</title><link>https://blog.midagedev.com/</link></image><generator>Ghost 5.54</generator><lastBuildDate>Sun, 13 Aug 2023 13:36:13 GMT</lastBuildDate><atom:link href="https://blog.midagedev.com/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[python 클래스의 classmethod와 staticmethod]]></title><description><![CDATA[<!--kg-card-begin: markdown--><p>&#xC774; &#xB370;&#xCF54;&#xB808;&#xC774;&#xD130;&#xB4E4;&#xC740; &#xBA54;&#xC11C;&#xB4DC;&#xC758; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC744; &#xBCC0;&#xACBD;&#xD558;&#xC5EC;, &#xC778;&#xC2A4;&#xD134;&#xC2A4; &#xBA54;&#xC11C;&#xB4DC;&#xAC00; &#xC544;&#xB2CC; &#xD074;&#xB798;&#xC2A4; &#xB808;&#xBCA8;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC815;&#xC758;&#xD560; &#xC218;</p>]]></description><link>https://blog.midagedev.com/python-classmethod-staticmethod/</link><guid isPermaLink="false">64d8dc1d4026ab09018420d1</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Sun, 13 Aug 2023 13:36:06 GMT</pubDate><content:encoded><![CDATA[<!--kg-card-begin: markdown--><p>&#xC774; &#xB370;&#xCF54;&#xB808;&#xC774;&#xD130;&#xB4E4;&#xC740; &#xBA54;&#xC11C;&#xB4DC;&#xC758; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC744; &#xBCC0;&#xACBD;&#xD558;&#xC5EC;, &#xC778;&#xC2A4;&#xD134;&#xC2A4; &#xBA54;&#xC11C;&#xB4DC;&#xAC00; &#xC544;&#xB2CC; &#xD074;&#xB798;&#xC2A4; &#xB808;&#xBCA8;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC815;&#xC758;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><strong>@classmethod</strong> :</li>
</ol>
<ul>
<li>&#xCCAB; &#xBC88;&#xC9F8; &#xC778;&#xC790;&#xB85C; &#xD074;&#xB798;&#xC2A4; &#xC790;&#xCCB4;(<code>cls</code>)&#xB97C; &#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xD074;&#xB798;&#xC2A4; &#xBCC0;&#xC218;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xAC70;&#xB098; &#xD074;&#xB798;&#xC2A4; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xD638;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xC9C0; &#xC54A;&#xACE0;&#xB3C4; &#xD074;&#xB798;&#xC2A4; &#xB808;&#xBCA8;&#xC5D0;&#xC11C; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xD638;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>Django &#xBAA8;&#xB378;&#xC5D0;&#xC11C;&#xB294;, &#xD2B9;&#xC815; &#xC870;&#xAC74;&#xC5D0; &#xB530;&#xB978; &#xCFFC;&#xB9AC;&#xC14B;&#xC744; &#xBC18;&#xD658;&#xD558;&#xB294; &#xBA54;&#xC11C;&#xB4DC;&#xB098;, &#xD329;&#xD1A0;&#xB9AC; &#xBA54;&#xC11C;&#xB4DC; &#xB4F1;&#xC744; &#xC815;&#xC758;&#xD560; &#xB54C; &#xC720;&#xC6A9;&#xD558;&#xAC8C; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<pre><code class="language-python">
from django.db import models

class Book(models.Model):
    title = models.CharField(max_length=100)
    published_date = models.DateField()

    @classmethod
    def get_recent_books(cls, days=30):
        recent_date = timezone.now() - timedelta(days=days)
        return cls.objects.filter(published_date__gte=recent_date)
</code></pre>
<ol start="2">
<li><strong>@staticmethod</strong> :</li>
</ol>
<ul>
<li>&#xD074;&#xB798;&#xC2A4;&#xB098; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xCC38;&#xC870;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC815;&#xC758;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li>&#xC774; &#xBA54;&#xC11C;&#xB4DC;&#xB294; &#xD074;&#xB798;&#xC2A4;&#xC758; &#xC0C1;&#xD0DC;&#xB098; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xC758; &#xC0C1;&#xD0DC;&#xB97C; &#xBCC0;&#xACBD;&#xD558;&#xC9C0; &#xC54A;&#xB294;, &#xC21C;&#xC218;&#xD55C; &#xD568;&#xC218;&#xCC98;&#xB7FC; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>Django &#xBAA8;&#xB378;&#xC5D0;&#xC11C;&#xB294;, &#xBAA8;&#xB378;&#xACFC; &#xC9C1;&#xC811;&#xC801;&#xC778; &#xAD00;&#xB828;&#xC774; &#xC5C6;&#xB294; &#xBCF4;&#xC870; &#xD568;&#xC218;&#xB098; &#xC720;&#xD2F8;&#xB9AC;&#xD2F0; &#xD568;&#xC218;&#xB97C; &#xC815;&#xC758;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<pre><code class="language-python">
class Book(models.Model):
    title = models.CharField(max_length=100)
    published_date = models.DateField()

    @staticmethod
    def is_valid_title(title):
        return len(title) &gt; 0 and len(title) &lt;= 100
</code></pre>
<!--kg-card-end: markdown-->]]></content:encoded></item><item><title><![CDATA[python의 dataclass]]></title><description><![CDATA[<!--kg-card-begin: markdown--><h1 id="%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%81%B4%EB%9E%98%EC%8A%A4%EC%97%90-%EB%8C%80%ED%95%B4-%EC%95%8C%EB%A0%A4%EC%A4%98">&#xB370;&#xC774;&#xD130;&#xD074;&#xB798;&#xC2A4;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xB824;&#xC918;</h1>
<p><code>dataclass</code>&#xB294; Python 3.7&#xBD80;&#xD130; &#xD45C;&#xC900; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC778; <code>dataclasses</code> &#xBAA8;&#xB4C8;&#xC5D0; &#xCD94;&#xAC00;&#xB41C; &#xB370;&#xCF54;&#xB808;&#xC774;&#xD130;&#xC785;&#xB2C8;&#xB2E4;. &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; <code>dataclass</code>&#xB294; &#xD074;</p>]]></description><link>https://blog.midagedev.com/python-dataclass/</link><guid isPermaLink="false">64d8d7af4026ab090184209c</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Sun, 13 Aug 2023 13:22:48 GMT</pubDate><content:encoded><![CDATA[<!--kg-card-begin: markdown--><h1 id="%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%81%B4%EB%9E%98%EC%8A%A4%EC%97%90-%EB%8C%80%ED%95%B4-%EC%95%8C%EB%A0%A4%EC%A4%98">&#xB370;&#xC774;&#xD130;&#xD074;&#xB798;&#xC2A4;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xB824;&#xC918;</h1>
<p><code>dataclass</code>&#xB294; Python 3.7&#xBD80;&#xD130; &#xD45C;&#xC900; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC778; <code>dataclasses</code> &#xBAA8;&#xB4C8;&#xC5D0; &#xCD94;&#xAC00;&#xB41C; &#xB370;&#xCF54;&#xB808;&#xC774;&#xD130;&#xC785;&#xB2C8;&#xB2E4;. &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; <code>dataclass</code>&#xB294; &#xD074;&#xB798;&#xC2A4; &#xB0B4;&#xC758; &#xD544;&#xB4DC;&#xB4E4;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xCD08;&#xAE30;&#xD654;, &#xBE44;&#xAD50;, &#xCD9C;&#xB825; &#xBA54;&#xC11C;&#xB4DC; &#xB4F1;&#xC744; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC0DD;&#xC131;&#xD574; &#xC90D;&#xB2C8;&#xB2E4;. <code>dataclass</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xBC18;&#xBCF5;&#xC801;&#xC778; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD558;&#xC9C0; &#xC54A;&#xACE0;&#xB3C4; &#xAE54;&#xB054;&#xD558;&#xAC8C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD074;&#xB798;&#xC2A4;&#xB97C; &#xC791;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xC81C;&#xB97C; &#xD1B5;&#xD574; &#xC774;&#xD574;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;:</p>
<pre><code class="language-python">
from dataclasses import dataclass

@dataclass
class Point:
    x: float
    y: float
    z: float = 0.0  # &#xAE30;&#xBCF8;&#xAC12; &#xC124;&#xC815;&#xB3C4; &#xAC00;&#xB2A5;
</code></pre>
<p>&#xC704;&#xC758; &#xC608;&#xC81C;&#xC5D0;&#xC11C; <code>Point</code> &#xD074;&#xB798;&#xC2A4;&#xB294; x, y, z &#xC138; &#xAC1C;&#xC758; &#xD544;&#xB4DC;&#xB97C; &#xAC00;&#xC9D1;&#xB2C8;&#xB2E4;. <code>dataclass</code> &#xB355;&#xBD84;&#xC5D0; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xAE30;&#xB2A5;&#xB4E4;&#xC774; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC81C;&#xACF5;&#xB429;&#xB2C8;&#xB2E4;:</p>
<ul>
<li>&#xCD08;&#xAE30;&#xD654; &#xBA54;&#xC11C;&#xB4DC; <code>__init__</code></li>
<li>&#xD45C;&#xD604; &#xBA54;&#xC11C;&#xB4DC; <code>__repr__</code></li>
<li>&#xBE44;&#xAD50; &#xBA54;&#xC11C;&#xB4DC; <code>__eq__</code></li>
</ul>
<p>&#xC0AC;&#xC6A9; &#xC608;:</p>
<pre><code class="language-python">
p1 = Point(1.0, 2.0)
print(p1)  # Point(x=1.0, y=2.0, z=0.0)

p2 = Point(1.0, 2.0, 3.0)
print(p2)  # Point(x=1.0, y=2.0, z=3.0)

print(p1 == p2)  # False
</code></pre>
<p><code>dataclass</code>&#xC758; &#xC8FC;&#xC694; &#xAE30;&#xB2A5; &#xBC0F; &#xC635;&#xC158;:</p>
<ol>
<li><strong>Field Defaults</strong> : &#xD544;&#xB4DC;&#xC758; &#xAE30;&#xBCF8;&#xAC12;&#xC744; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>Type Annotations</strong> : &#xD544;&#xB4DC;&#xC5D0; &#xD0C0;&#xC785; &#xD78C;&#xD2B8;&#xB97C; &#xC81C;&#xACF5;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; <code>dataclass</code>&#xB294; &#xD574;&#xB2F9; &#xD544;&#xB4DC;&#xB97C; &#xBB34;&#xC2DC;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><strong>Ordering</strong> : <code>order=True</code> &#xC635;&#xC158;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74;, &#xAC1D;&#xCCB4; &#xAC04;&#xC758; &#xC21C;&#xC11C; &#xBE44;&#xAD50;&#xB97C; &#xC704;&#xD55C; &#xBA54;&#xC11C;&#xB4DC;&#xB4E4;(<code>__lt__</code>, <code>__le__</code>, &#xB4F1;)&#xC774; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC0DD;&#xC131;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li><strong>Immutability</strong> : <code>frozen=True</code> &#xC635;&#xC158;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74;, &#xBD88;&#xBCC0; &#xAC1D;&#xCCB4;&#xB97C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xD558;&#xBA74; &#xD544;&#xB4DC; &#xAC12;&#xC744; &#xBCC0;&#xACBD;&#xD558;&#xB824;&#xACE0; &#xD560; &#xB54C; &#xC608;&#xC678;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
<p><code>dataclass</code>&#xB294; &#xBCF4;&#xC77C;&#xB7EC;&#xD50C;&#xB808;&#xC774;&#xD2B8; &#xCF54;&#xB4DC; &#xC791;&#xC131;&#xC744; &#xC904;&#xC5EC;&#xC8FC;&#xBBC0;&#xB85C;, &#xB370;&#xC774;&#xD130;&#xB97C; &#xB2E4;&#xB8E8;&#xB294; &#xD074;&#xB798;&#xC2A4;&#xB97C; &#xC791;&#xC131;&#xD560; &#xB54C; &#xB9E4;&#xC6B0; &#xC720;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="python-37-%EC%9D%B4%EC%A0%84%EC%97%90%EB%8A%94-%EA%B7%B8%EB%9F%BC-%EC%96%B4%EB%96%BB%EA%B2%8C-%EB%8C%80%EC%9D%91%ED%96%88%EC%9D%84%EA%B9%8C">python 3.7 &#xC774;&#xC804;&#xC5D0;&#xB294; &#xADF8;&#xB7FC; &#xC5B4;&#xB5BB;&#xAC8C; &#xB300;&#xC751;&#xD588;&#xC744;&#xAE4C;</h1>
<p>dataclass`&#xAC00; &#xB3C4;&#xC785;&#xB418;&#xAE30; &#xC804;&#xC5D0;, &#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C;&#xB294; &#xC5EC;&#xB7EC; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB2F4;&#xB294; &#xD074;&#xB798;&#xC2A4;&#xB97C; &#xC815;&#xC758;&#xD558;&#xACE0; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xB798;&#xB294; &#xC8FC;&#xC694;&#xD55C; &#xC811;&#xADFC; &#xBC29;&#xBC95;&#xB4E4;&#xC785;&#xB2C8;&#xB2E4;:</p>
<ol>
<li><strong>&#xC77C;&#xBC18;&#xC801;&#xC778; &#xD074;&#xB798;&#xC2A4; &#xC815;&#xC758;</strong> : &#xC9C1;&#xC811; <code>__init__</code>, <code>__repr__</code>, <code>__eq__</code> &#xB4F1;&#xC758; &#xB9E4;&#xC9C1; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xAD6C;&#xD604;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ol>
<pre><code class="language-python">
class Point:
    def __init__(self, x, y):
        self.x = x
        self.y = y

    def __repr__(self):
        return f&quot;Point({self.x}, {self.y})&quot;
    
    def __eq__(self, other):
        return self.x == other.x and self.y == other.y
</code></pre>
<ol start="2">
<li><strong>namedtuple</strong> : <code>collections</code> &#xBAA8;&#xB4C8;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; <code>namedtuple</code>&#xC740; &#xAC04;&#xB2E8;&#xD55C; &#xBD88;&#xBCC0; &#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870;&#xB97C; &#xC815;&#xC758;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E8;, <code>namedtuple</code> &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB294; &#xC218;&#xC815;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ol>
<pre><code class="language-python">
from collections import namedtuple

Point = namedtuple(&quot;Point&quot;, [&quot;x&quot;, &quot;y&quot;])
</code></pre>
<ol start="3">
<li><strong>attrs</strong> : <code>dataclass</code>&#xAC00; &#xB3C4;&#xC785;&#xB418;&#xAE30; &#xC804;&#xC5D0; <code>attrs</code> &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB294; &#xB370;&#xC774;&#xD130; &#xD074;&#xB798;&#xC2A4; &#xC0DD;&#xC131;&#xC5D0; &#xB300;&#xD55C; &#xAC15;&#xB825;&#xD55C; &#xB3C4;&#xAD6C;&#xB85C; &#xC778;&#xAE30;&#xB97C; &#xC5BB;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. <code>attrs</code>&#xB294; <code>dataclass</code>&#xC640; &#xC720;&#xC0AC;&#xD55C; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC9C0;&#xB9CC;, &#xB354; &#xB9CE;&#xC740; &#xCEE4;&#xC2A4;&#xD130;&#xB9C8;&#xC774;&#xC9D5;&#xACFC; &#xC720;&#xD2F8;&#xB9AC;&#xD2F0;&#xB97C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ol>
<pre><code class="language-python">
import attr

@attr.s
class Point:
    x = attr.ib()
    y = attr.ib()
</code></pre>
<p>&#xC774;&#xB7EC;&#xD55C; &#xC811;&#xADFC; &#xBC29;&#xBC95;&#xB4E4;&#xC740; &#xC5EC;&#xC804;&#xD788; &#xC720;&#xD6A8;&#xD558;&#xBA70;, &#xD2B9;&#xC815; &#xC0C1;&#xD669;&#xC5D0; &#xB530;&#xB77C; <code>dataclass</code>&#xBCF4;&#xB2E4; &#xB354; &#xC801;&#xD569;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; <code>dataclass</code>&#xAC00; &#xB3C4;&#xC785;&#xB418;&#xBA74;&#xC11C; &#xD45C;&#xC900; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xAC04;&#xACB0;&#xD558;&#xACE0; &#xAC15;&#xB825;&#xD55C; &#xB3C4;&#xAD6C;&#xB85C; &#xC778;&#xAE30;&#xB97C; &#xC5BB;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="django%EC%97%90%EC%84%9C-dataclass%EC%9D%98-%ED%99%9C%EC%9A%A9">django&#xC5D0;&#xC11C; dataclass&#xC758; &#xD65C;&#xC6A9;</h1>
<p>Django&#xB294; ORM &#xAE30;&#xBC18;&#xC758; &#xC6F9; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, <code>dataclass</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xD56D;&#xC0C1; &#xC9C1;&#xAD00;&#xC801;&#xC774;&#xC9C0;&#xB294; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xD2B9;&#xC815; &#xACBD;&#xC6B0;&#xC5D0; <code>dataclass</code>&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xCF54;&#xB4DC;&#xC758; &#xAC00;&#xB3C5;&#xC131;&#xACFC; &#xC720;&#xC9C0;&#xBCF4;&#xC218;&#xC131;&#xC744; &#xB192;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="1-django-form-%EB%8C%80%EC%B2%B4%ED%95%98%EA%B8%B0">1. Django Form &#xB300;&#xCCB4;&#xD558;&#xAE30;</h3>
<p>&#xC804;&#xD1B5;&#xC801;&#xC73C;&#xB85C; Django&#xC5D0;&#xC11C;&#xB294; <code>forms.ModelForm</code> &#xB610;&#xB294; <code>forms.Form</code>&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD3FC; &#xB370;&#xC774;&#xD130;&#xB97C; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xACBD;&#xC6B0;&#xC5D0; &#xB530;&#xB77C; <code>dataclass</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; form &#xB370;&#xC774;&#xD130;&#xC758; &#xAD6C;&#xC870;&#xC640; &#xC720;&#xD6A8;&#xC131; &#xAC80;&#xC0AC; &#xB85C;&#xC9C1;&#xC744; &#xBD84;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="language-python">
from dataclasses import dataclass
from django import forms

@dataclass
class UserRegistrationData:
    username: str
    password: str
    email: str

class UserRegistrationForm(forms.Form):
    username = forms.CharField(max_length=100)
    password = forms.CharField(widget=forms.PasswordInput)
    email = forms.EmailField()

    def clean(self):
        cleaned_data = super().clean()
        return UserRegistrationData(
            username=cleaned_data.get(&quot;username&quot;),
            password=cleaned_data.get(&quot;password&quot;),
            email=cleaned_data.get(&quot;email&quot;)
        )
</code></pre>
<h3 id="2-queryset-%EB%8D%B0%EC%9D%B4%ED%84%B0-%EB%B3%80%ED%99%98%ED%95%98%EA%B8%B0">2. QuerySet &#xB370;&#xC774;&#xD130; &#xBCC0;&#xD658;&#xD558;&#xAE30;</h3>
<p>Django&#xC758; QuerySet&#xC5D0;&#xC11C; &#xBC18;&#xD658;&#xB418;&#xB294; &#xBAA8;&#xB378; &#xC778;&#xC2A4;&#xD134;&#xC2A4; &#xB300;&#xC2E0;&#xC5D0;, &#xB370;&#xC774;&#xD130; &#xC804;&#xC1A1; &#xAC1D;&#xCCB4;&#xB098; &#xD2B9;&#xC815; &#xC6A9;&#xB3C4;&#xB85C; &#xAD6C;&#xC870;&#xD654;&#xB41C; &#xAC1D;&#xCCB4;&#xB97C; &#xBC18;&#xD658;&#xD558;&#xACE0; &#xC2F6;&#xC744; &#xB54C; <code>dataclass</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="language-python">
from dataclasses import dataclass
from myapp.models import Blog

@dataclass
class BlogSummary:
    title: str
    author_name: str

def get_blog_summaries():
    blogs = Blog.objects.all()
    return [BlogSummary(title=blog.title, author_name=blog.author.name) for blog in blogs]
</code></pre>
<h3 id="3-api-%EC%9D%91%EB%8B%B5-%EA%B5%AC%EC%A1%B0%ED%99%94%ED%95%98%EA%B8%B0">3. API &#xC751;&#xB2F5; &#xAD6C;&#xC870;&#xD654;&#xD558;&#xAE30;</h3>
<p>API &#xC751;&#xB2F5;&#xC758; &#xD615;&#xD0DC;&#xB97C; <code>dataclass</code>&#xB85C; &#xC815;&#xC758;&#xD558;&#xC5EC;, &#xC751;&#xB2F5;&#xC758; &#xAD6C;&#xC870;&#xC640; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xD45C;&#xD604;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="language-python">
from dataclasses import dataclass
from rest_framework.response import Response

@dataclass
class UserResponse:
    id: int
    name: str
    email: str

def user_detail_view(request, user_id):
    user = get_user_from_database(user_id)  # &#xC5EC;&#xAE30;&#xC11C;&#xB294; &#xC608;&#xC2DC;&#xB85C;, &#xC2E4;&#xC81C;&#xB85C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAC00;&#xC838;&#xC624;&#xB294; &#xB85C;&#xC9C1;&#xC774; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.
    response_data = UserResponse(id=user.id, name=user.name, email=user.email)
    return Response(response_data)
</code></pre>
<h3 id="4-%EB%B9%84%EC%A6%88%EB%8B%88%EC%8A%A4-%EB%A1%9C%EC%A7%81-%EB%82%B4%EB%B6%80%EC%9D%98-%EB%8D%B0%EC%9D%B4%ED%84%B0-%EC%A0%84%EB%8B%AC">4. &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xB85C;&#xC9C1; &#xB0B4;&#xBD80;&#xC758; &#xB370;&#xC774;&#xD130; &#xC804;&#xB2EC;</h3>
<p>&#xBCF5;&#xC7A1;&#xD55C; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xB85C;&#xC9C1;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xB3D9;&#xC548; &#xB2E4;&#xC591;&#xD55C; &#xD568;&#xC218;&#xB098; &#xBA54;&#xC11C;&#xB4DC;&#xC5D0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC804;&#xB2EC;&#xD560; &#xB54C; <code>dataclass</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xB370;&#xC774;&#xD130;&#xC758; &#xAD6C;&#xC870;&#xB97C; &#xBA85;&#xD655;&#xD788; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="language-python">
from dataclasses import dataclass

@dataclass
class OrderCalculationContext:
    base_price: float
    discount: float
    tax: float

def calculate_total_price(context: OrderCalculationContext) -&gt; float:
    return context.base_price - context.discount + context.tax
</code></pre>
<p>&#xC774;&#xB7EC;&#xD55C; &#xBC29;&#xBC95;&#xB4E4;&#xC740; <code>dataclass</code>&#xB97C; Django &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xD1B5;&#xD569;&#xD558;&#xB294; &#xC5EC;&#xB7EC; &#xBC29;&#xBC95; &#xC911; &#xC77C;&#xBD80;&#xC785;&#xB2C8;&#xB2E4;. &#xC0AC;&#xC6A9;&#xD560; &#xB54C;&#xC758; &#xD658;&#xACBD;&#xACFC; &#xC694;&#xAD6C; &#xC0AC;&#xD56D;&#xC5D0; &#xB530;&#xB77C; &#xC801;&#xC808;&#xD55C; &#xBC29;&#xBC95;&#xC744; &#xC120;&#xD0DD;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
<h1 id="%EB%B3%84%EB%A1%9C-%EC%9E%A5%EC%A0%90%EC%9D%B4-%EC%97%86%EB%8A%94%EA%B2%83-%EA%B0%99%EC%95%84">&#xBCC4;&#xB85C; &#xC7A5;&#xC810;&#xC774; &#xC5C6;&#xB294;&#xAC83; &#xAC19;&#xC544;</h1>
<p><code>dataclass</code>&#xC758; &#xC8FC;&#xC694; &#xC7A5;&#xC810;&#xC740; &#xBC18;&#xBCF5;&#xC801;&#xC778; &#xCF54;&#xB4DC;&#xC758; &#xC81C;&#xAC70;&#xC640; &#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870;&#xC758; &#xBA85;&#xD655;&#xC131;&#xC785;&#xB2C8;&#xB2E4;. Django&#xC5D0;&#xC11C; <code>dataclass</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC774;&#xC810;&#xC774; &#xC788;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ol>
<li><strong>&#xD0C0;&#xC785; &#xC548;&#xC815;&#xC131;</strong> : <code>dataclass</code>&#xC640; &#xD568;&#xAED8; &#xD0C0;&#xC785; &#xD78C;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74;, &#xCF54;&#xB4DC;&#xC5D0; &#xD0C0;&#xC785;&#xC5D0; &#xAD00;&#xD55C; &#xBA85;&#xC2DC;&#xC801;&#xC778; &#xC815;&#xBCF4;&#xB97C; &#xCD94;&#xAC00;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB85C;&#xC368; &#xCF54;&#xB4DC;&#xC758; &#xAC00;&#xB3C5;&#xC131;&#xC744; &#xB192;&#xC774;&#xACE0;, &#xC7A0;&#xC7AC;&#xC801;&#xC778; &#xC624;&#xB958;&#xB97C; &#xC904;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xB370;&#xC774;&#xD130;&#xC758; &#xBD88;&#xBCC0;&#xC131;</strong> : <code>dataclass</code>&#xC5D0;&#xC11C; <code>frozen=True</code> &#xC635;&#xC158;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xBD88;&#xBCC0; &#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870;&#xB97C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBD88;&#xBCC0;&#xC131;&#xC740; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC5D0;&#xC11C; &#xAD8C;&#xC7A5;&#xB418;&#xB294; &#xD2B9;&#xC131;&#xC73C;&#xB85C;, &#xC608;&#xCE21; &#xAC00;&#xB2A5;&#xC131;&#xACFC; &#xB514;&#xBC84;&#xAE45; &#xC6A9;&#xC774;&#xC131;&#xC744; &#xB192;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xBA85;&#xD655;&#xD55C; API&#xC640; &#xACC4;&#xC57D;</strong> : <code>dataclass</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74;, &#xD2B9;&#xC815; &#xAE30;&#xB2A5;&#xC774;&#xB098; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0;&#xC11C; &#xC694;&#xAD6C;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130;&#xC758; &#xAD6C;&#xC870;&#xC640; &#xD615;&#xC2DD;&#xC744; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xC815;&#xC758;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xC774;&#xB7EC;&#xD55C; &#xC774;&#xC810;&#xC744; &#xACE0;&#xB824;&#xD558;&#xC5EC; Django&#xC640; <code>dataclass</code>&#xC758; &#xD1B5;&#xD569; &#xC608;&#xC81C;&#xB97C; &#xB2E4;&#xC2DC; &#xAC80;&#xD1A0;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="api-%EC%9D%91%EB%8B%B5-%EA%B5%AC%EC%A1%B0%ED%99%94%ED%95%98%EA%B8%B0-%EC%9E%AC%EA%B2%80%ED%86%A0">API &#xC751;&#xB2F5; &#xAD6C;&#xC870;&#xD654;&#xD558;&#xAE30; (&#xC7AC;&#xAC80;&#xD1A0;)</h3>
<p>Django REST framework&#xC640; &#xAC19;&#xC740; API &#xAD6C;&#xCD95; &#xC2DC;, <code>dataclass</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC751;&#xB2F5;&#xC758; &#xAD6C;&#xC870;&#xB97C; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xC815;&#xC758;&#xD558;&#xACE0; &#xD574;&#xB2F9; &#xAD6C;&#xC870;&#xC5D0; &#xB530;&#xB77C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC9C1;&#xB82C;&#xD654;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="language-python">
from dataclasses import asdict
from rest_framework.decorators import api_view
from rest_framework.response import Response

@dataclass
class UserResponse:
    id: int
    name: str
    email: str

@api_view([&apos;GET&apos;])
def user_detail_view(request, user_id):
    user = get_user_from_database(user_id)
    response_data = UserResponse(id=user.id, name=user.name, email=user.email)
    return Response(asdict(response_data))
</code></pre>
<p>&#xC774; &#xC608;&#xC81C;&#xC5D0;&#xC11C;&#xB294; <code>dataclass</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; API &#xC751;&#xB2F5;&#xC758; &#xAD6C;&#xC870;&#xB97C; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xC815;&#xC758;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB85C; &#xC778;&#xD574; API&#xC758; &#xBC18;&#xD658;&#xAC12;&#xC758; &#xD615;&#xD0DC;&#xC640; &#xB0B4;&#xC6A9;&#xC5D0; &#xB300;&#xD55C; &#xBA85;&#xD655;&#xD55C; &#xACC4;&#xC57D;(contract)&#xC774; &#xC0DD;&#xC131;&#xB418;&#xC5C8;&#xACE0;, &#xC774;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC9C1;&#xB82C;&#xD654; &#xACFC;&#xC815;&#xB3C4; &#xAC04;&#xACB0;&#xD558;&#xAC8C; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBB3C;&#xB860;, &#xBAA8;&#xB4E0; &#xC0C1;&#xD669;&#xC5D0;&#xC11C; <code>dataclass</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC774;&#xC810;&#xB9CC; &#xC788;&#xC9C0;&#xB294; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC801;&#xC808;&#xD55C; &#xC0C1;&#xD669;&#xACFC; &#xD544;&#xC694;&#xC131;&#xC5D0; &#xB530;&#xB77C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="%EC%9D%91%EB%8B%B5%EC%9D%98-%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%81%B4%EB%9E%98%EC%8A%A4%EC%99%80-%EC%8B%9C%EB%A6%AC%EC%96%BC%EB%9D%BC%EC%9D%B4%EC%A0%80%EC%9D%98-%EC%97%AD%ED%95%A0-%EC%A4%91%EB%B3%B5">&#xC751;&#xB2F5;&#xC758; &#xB370;&#xC774;&#xD130;&#xD074;&#xB798;&#xC2A4;&#xC640; &#xC2DC;&#xB9AC;&#xC5BC;&#xB77C;&#xC774;&#xC800;&#xC758; &#xC5ED;&#xD560; &#xC911;&#xBCF5;</h1>
<p>Django REST framework(DRF)&#xC5D0;&#xC11C;&#xB294; <code>Serializer</code>&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xC5EC; &#xBCF5;&#xC7A1;&#xD55C; &#xCFFC;&#xB9AC;&#xC14B;, &#xBAA8;&#xB378; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; JSON&#xACFC; &#xAC19;&#xC740; &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xC27D;&#xAC8C; &#xC9C1;&#xB82C;&#xD654;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xAE30;&#xB2A5;&#xC774; &#xC774;&#xBBF8; &#xC874;&#xC7AC;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; <code>dataclass</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC911;&#xBCF5;&#xC801;&#xC774;&#xAC70;&#xB098; &#xACFC;&#xB3C4;&#xD55C; &#xBD80;&#xBD84;&#xC774; &#xC788;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xB098; <code>dataclass</code>&#xB97C; API&#xC758; &#xC751;&#xB2F5; &#xAD6C;&#xC870;&#xC640; &#xAC19;&#xC740; &#xBD80;&#xBD84;&#xC5D0; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xBA87; &#xAC00;&#xC9C0; &#xC7A5;&#xC810;&#xC774; &#xC788;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ol>
<li><strong>&#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C; &#xB3C5;&#xB9BD;&#xC131;</strong> : &#xCF54;&#xB4DC; &#xBCA0;&#xC774;&#xC2A4;&#xAC00; DRF&#xC5D0; &#xB108;&#xBB34; &#xC758;&#xC874;&#xC801;&#xC774;&#xC9C0; &#xC54A;&#xAC8C; &#xD558;&#xB824;&#xBA74;, &#xD45C;&#xC900; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC778; <code>dataclass</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xB370;&#xC774;&#xD130;&#xC758; &#xAD6C;&#xC870;&#xB97C; &#xC815;&#xC758;&#xD558;&#xACE0; &#xB2E4;&#xB978; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB098; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB85C; &#xC804;&#xD658;&#xD560; &#xB54C;&#xC758; &#xC720;&#xC5F0;&#xC131;&#xC744; &#xB192;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xD0C0;&#xC785; &#xCCB4;&#xD0B9;</strong> : <code>dataclass</code>&#xC640; &#xD568;&#xAED8; &#xD0C0;&#xC785; &#xD78C;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74;, &#xB3C4;&#xAD6C;&#xB098; linters (&#xC608;: <code>mypy</code>)&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xCF54;&#xB4DC;&#xBCA0;&#xC774;&#xC2A4;&#xC758; &#xD0C0;&#xC785; &#xC548;&#xC815;&#xC131;&#xC744; &#xCCB4;&#xD06C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xAC04;&#xACB0;&#xD55C; &#xB370;&#xC774;&#xD130; &#xBCC0;&#xD658;</strong> : &#xBCF5;&#xC7A1;&#xD55C; &#xC2DC;&#xB9AC;&#xC5BC;&#xB77C;&#xC774;&#xC800; &#xB85C;&#xC9C1; &#xC5C6;&#xC774;&#xB3C4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBE60;&#xB974;&#xAC8C; &#xBCC0;&#xD658;&#xD558;&#xACE0;, &#xB2E4;&#xB978; &#xD568;&#xC218;&#xB098; &#xBA54;&#xC11C;&#xB4DC;&#xB85C; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xB370; &#xC720;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4;, DRF&#xC758; &#xC2DC;&#xB9AC;&#xC5BC;&#xB77C;&#xC774;&#xC800;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xACE0;, <code>dataclass</code>&#xC640; &#xD568;&#xAED8; &#xB2E4;&#xB978; &#xC9C1;&#xB82C;&#xD654; &#xBC29;&#xBC95; (&#xC608;: <code>dataclasses.asdict()</code>, <code>json.dumps()</code>)&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<pre><code class="language-python">
from dataclasses import asdict
from rest_framework.decorators import api_view
from rest_framework.response import Response

@dataclass
class UserResponse:
    id: int
    name: str
    email: str

@api_view([&apos;GET&apos;])
def user_detail_view(request, user_id):
    user = get_user_from_database(user_id)  # &#xAC00;&#xC815;
    response_data = UserResponse(id=user.id, name=user.name, email=user.email)
    return Response(asdict(response_data))
</code></pre>
<p>&#xADF8;&#xB807;&#xC9C0;&#xB9CC;, &#xB9CE;&#xC740; &#xACBD;&#xC6B0;&#xC5D0; DRF&#xC758; &#xC2DC;&#xB9AC;&#xC5BC;&#xB77C;&#xC774;&#xC800;&#xB294; &#xAC15;&#xB825;&#xD558;&#xACE0; &#xD6A8;&#xC728;&#xC801;&#xC785;&#xB2C8;&#xB2E4;. &#xB370;&#xC774;&#xD130; &#xC720;&#xD6A8;&#xC131; &#xAC80;&#xC0AC;, &#xBCF5;&#xC7A1;&#xD55C; &#xAD00;&#xACC4; &#xBC0F; &#xC911;&#xCCA9;&#xB41C; &#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xACE0;, &#xCFFC;&#xB9AC; &#xCD5C;&#xC801;&#xD654;&#xC640; &#xAC19;&#xC740; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB9CE;&#xC740; Django &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; DRF&#xC758; &#xC2DC;&#xB9AC;&#xC5BC;&#xB77C;&#xC774;&#xC800;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><code>dataclass</code>&#xC758; &#xC0AC;&#xC6A9; &#xC5EC;&#xBD80;&#xB294; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xACFC; &#xAC1C;&#xBC1C;&#xD300;&#xC758; &#xC120;&#xD638;&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<!--kg-card-end: markdown-->]]></content:encoded></item><item><title><![CDATA[Domain-Driven Design 도메인 주도 개발]]></title><description><![CDATA[<!--kg-card-begin: markdown--><p>DDD&#xC5D0; &#xB300;&#xD574; ChatGPT&#xB300;&#xD654;&#xD55C; &#xB0B4;&#xC6A9;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h1 id="%EB%A0%88%EC%9D%B4%EC%96%B4%EC%97%90-%EB%8C%80%ED%95%B4">&#xB808;&#xC774;&#xC5B4;&#xC5D0; &#xB300;&#xD574;</h1>
<p>&#xB3C4;&#xBA54;&#xC778; &#xC8FC;&#xB3C4; &#xAC1C;&#xBC1C;(Domain-Driven Design, DDD)&#xC740; &#xBCF5;&#xC7A1;&#xD55C; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xAD6C;&#xCD95;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC544;&#xD0A4;</p>]]></description><link>https://blog.midagedev.com/domain-driven-design/</link><guid isPermaLink="false">64d8d0694026ab0901842064</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Sun, 13 Aug 2023 13:01:58 GMT</pubDate><content:encoded><![CDATA[<!--kg-card-begin: markdown--><p>DDD&#xC5D0; &#xB300;&#xD574; ChatGPT&#xB300;&#xD654;&#xD55C; &#xB0B4;&#xC6A9;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h1 id="%EB%A0%88%EC%9D%B4%EC%96%B4%EC%97%90-%EB%8C%80%ED%95%B4">&#xB808;&#xC774;&#xC5B4;&#xC5D0; &#xB300;&#xD574;</h1>
<p>&#xB3C4;&#xBA54;&#xC778; &#xC8FC;&#xB3C4; &#xAC1C;&#xBC1C;(Domain-Driven Design, DDD)&#xC740; &#xBCF5;&#xC7A1;&#xD55C; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xAD6C;&#xCD95;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC640; &#xC124;&#xACC4; &#xC811;&#xADFC; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;. DDD&#xB294; &#xC8FC;&#xB85C; &#xB124; &#xAC00;&#xC9C0; &#xC8FC;&#xC694; &#xB808;&#xC774;&#xC5B4;&#xB85C; &#xAD6C;&#xC131;&#xB429;&#xB2C8;&#xB2E4;: Presentation, Application, Domain, Infrastructure.</p>
<ol>
<li><strong>Presentation Layer</strong>  (&#xD504;&#xB808;&#xC820;&#xD14C;&#xC774;&#xC158; &#xB808;&#xC774;&#xC5B4;):</li>
</ol>
<ul>
<li>&#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC694;&#xCCAD;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xACE0; &#xC751;&#xB2F5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xB808;&#xC774;&#xC5B4;.</li>
<li>&#xC0AC;&#xC6A9;&#xC790; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;(UI)&#xC640; &#xAD00;&#xB828;&#xB41C; &#xCF54;&#xB4DC; &#xD3EC;&#xD568;.</li>
</ul>
<p><strong>&#xD638;&#xD154; &#xC608;&#xC57D; &#xC11C;&#xBE44;&#xC2A4; &#xC608;&#xC81C;</strong> :</p>
<pre><code class="language-python">
# views.py
def show_available_rooms(request, date):
    # ... &#xB85C;&#xC9C1; &#xCC98;&#xB9AC; ...
    return render(request, &apos;available_rooms.html&apos;, context)
</code></pre>
<ol start="2">
<li><strong>Application Layer</strong>  (&#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xB808;&#xC774;&#xC5B4;):</li>
</ol>
<ul>
<li>&#xC0AC;&#xC6A9; &#xC0AC;&#xB840;&#xB97C; &#xC815;&#xC758;&#xD558;&#xACE0;, &#xC8FC;&#xC694; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xB85C;&#xC9C1;&#xC744; &#xC870;&#xC815;&#xD558;&#xB294; &#xB808;&#xC774;&#xC5B4;.</li>
<li>&#xC678;&#xBD80; &#xC694;&#xCCAD;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xACE0; &#xB3C4;&#xBA54;&#xC778; &#xB808;&#xC774;&#xC5B4;&#xC640; &#xC0C1;&#xD638; &#xC791;&#xC6A9;.</li>
<li>&#xD2B8;&#xB79C;&#xC7AD;&#xC158; &#xAD00;&#xB9AC;&#xC640; &#xAC19;&#xC740; &#xD06C;&#xB85C;&#xC2A4; &#xCEE4;&#xD305; &#xAD00;&#xC2EC;&#xC0AC;(cross-cutting concerns)&#xC758; &#xCC98;&#xB9AC;&#xB3C4; &#xC5EC;&#xAE30;&#xC11C; &#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
<p><strong>&#xD638;&#xD154; &#xC608;&#xC57D; &#xC11C;&#xBE44;&#xC2A4; &#xC608;&#xC81C;</strong> :</p>
<pre><code class="language-python">
# services.py
class ReservationService:
    def get_available_rooms(self, date):
        # &#xB3C4;&#xBA54;&#xC778; &#xB808;&#xC774;&#xC5B4;&#xC758; &#xB9AC;&#xD3EC;&#xC9C0;&#xD1A0;&#xB9AC;&#xC640; &#xC0C1;&#xD638; &#xC791;&#xC6A9;
        return room_repository.find_available_rooms(date)
</code></pre>
<ol start="3">
<li><strong>Domain Layer</strong>  (&#xB3C4;&#xBA54;&#xC778; &#xB808;&#xC774;&#xC5B4;):</li>
</ol>
<ul>
<li>&#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xD575;&#xC2EC; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xB85C;&#xC9C1;&#xACFC; &#xC5D4;&#xD130;&#xD2F0;, &#xBC38;&#xB958; &#xAC1D;&#xCCB4;, &#xB3C4;&#xBA54;&#xC778; &#xC11C;&#xBE44;&#xC2A4;, &#xB9AC;&#xD3EC;&#xC9C0;&#xD1A0;&#xB9AC; &#xB4F1;&#xC774; &#xD3EC;&#xD568;.</li>
<li>&#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xB098; &#xC678;&#xBD80; &#xC11C;&#xBE44;&#xC2A4;&#xC640;&#xC758; &#xC0C1;&#xD638; &#xC791;&#xC6A9;&#xC744; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xB2E4;&#xB8E8;&#xC9C0; &#xC54A;&#xC74C;.</li>
</ul>
<p><strong>&#xD638;&#xD154; &#xC608;&#xC57D; &#xC11C;&#xBE44;&#xC2A4; &#xC608;&#xC81C;</strong> :</p>
<pre><code class="language-python">
# domain.py
class Room:
    def __init__(self, number, capacity):
        self.number = number
        self.capacity = capacity
        self.reservations = []

    def is_available(self, date):
        for reservation in self.reservations:
            if reservation.date == date:
                return False
        return True

class Reservation:
    def __init__(self, room, date):
        self.room = room
        self.date = date

# repository.py
class RoomRepository:
    def find_available_rooms(self, date):
        # &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0;&#xC11C; &#xB0A0;&#xC9DC;&#xBCC4; &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xBC29;&#xC744; &#xC870;&#xD68C;
        pass
</code></pre>
<ol start="4">
<li><strong>Infrastructure Layer</strong>  (&#xC778;&#xD504;&#xB77C;&#xC2A4;&#xD2B8;&#xB7ED;&#xCC98; &#xB808;&#xC774;&#xC5B4;):</li>
</ol>
<ul>
<li>&#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xC5F0;&#xACB0;, &#xB124;&#xD2B8;&#xC6CC;&#xD0B9;, &#xD30C;&#xC77C; I/O &#xB4F1; &#xC678;&#xBD80; &#xC2DC;&#xC2A4;&#xD15C;&#xACFC;&#xC758; &#xD1B5;&#xC2E0;&#xC744; &#xCC98;&#xB9AC;.</li>
<li>&#xB3C4;&#xBA54;&#xC778; &#xB808;&#xC774;&#xC5B4;&#xC758; &#xB9AC;&#xD3EC;&#xC9C0;&#xD1A0;&#xB9AC; &#xAD6C;&#xD604;&#xC744; &#xD3EC;&#xD568;&#xD560; &#xC218; &#xC788;&#xC74C;.</li>
</ul>
<p><strong>&#xD638;&#xD154; &#xC608;&#xC57D; &#xC11C;&#xBE44;&#xC2A4; &#xC608;&#xC81C;</strong> :</p>
<pre><code class="language-python">
# database.py
import sqlite3

class SQLiteRoomRepository(RoomRepository):
    def __init__(self, db_path):
        self.conn = sqlite3.connect(db_path)

    def find_available_rooms(self, date):
        cursor = self.conn.cursor()
        cursor.execute(&apos;SELECT * FROM rooms WHERE date=?&apos;, (date,))
        rooms = cursor.fetchall()
        return [Room(row[0], row[1]) for row in rooms]
</code></pre>
<p>&#xC774;&#xB807;&#xAC8C; &#xAC01; &#xB808;&#xC774;&#xC5B4;&#xB294; &#xC790;&#xCCB4; &#xCC45;&#xC784;&#xC744; &#xAC00;&#xC9C0;&#xBA70;, &#xBD84;&#xB9AC;&#xB418;&#xC5B4; &#xAD00;&#xB9AC;&#xB429;&#xB2C8;&#xB2E4;. DDD&#xB294; &#xBCF5;&#xC7A1;&#xD55C; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xB85C;&#xC9C1;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xBA74;&#xC11C;&#xB3C4; &#xC720;&#xC9C0;&#xBCF4;&#xC218;&#xC131;&#xACFC; &#xD655;&#xC7A5;&#xC131;&#xC744; &#xC720;&#xC9C0;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB3C4;&#xC640;&#xC8FC;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h1 id="cqrscommand-query-responsibility-segregation">CQRS(Command Query Responsibility Segregation)</h1>
<p>CQRS (Command Query Responsibility Segregation)&#xB294; &#xBA85;&#xB839;&#xACFC; &#xC870;&#xD68C;&#xC758; &#xCC45;&#xC784;&#xC744; &#xBD84;&#xB9AC;&#xD558;&#xB294; &#xD328;&#xD134;&#xC785;&#xB2C8;&#xB2E4;. DDD(Domain-Driven Design)&#xC5D0;&#xC11C; &#xBCF5;&#xC7A1;&#xD55C; &#xB3C4;&#xBA54;&#xC778;&#xC744; &#xB2E4;&#xB8F0; &#xB54C;, CQRS&#xB294; &#xBAA8;&#xB378;&#xC758; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xC904;&#xC774;&#xACE0; &#xD655;&#xC7A5;&#xC131;&#xC744; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0A4;&#xB294; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>CQRS&#xB97C; DDD&#xC640; &#xD568;&#xAED8; &#xC0AC;&#xC6A9;&#xD560; &#xB54C;&#xC758; &#xC8FC;&#xC694; &#xC774;&#xC810; &#xBC0F; &#xC5ED;&#xD560;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ol>
<li><strong>&#xBCF5;&#xC7A1;&#xC131; &#xAD00;&#xB9AC;</strong> : &#xC804;&#xD1B5;&#xC801;&#xC778; CRUD &#xBC29;&#xC2DD;&#xC5D0;&#xC11C;&#xB294; &#xB3D9;&#xC77C;&#xD55C; &#xBAA8;&#xB378;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xB370;&#xC774;&#xD130;&#xC758; &#xC77D;&#xAE30; &#xBC0F; &#xC4F0;&#xAE30;&#xB97C; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xBCF5;&#xC7A1;&#xD55C; &#xB3C4;&#xBA54;&#xC778;&#xC5D0;&#xC11C; &#xC774;&#xB7EC;&#xD55C; &#xC811;&#xADFC; &#xBC29;&#xC2DD;&#xC740; &#xBAA8;&#xB378;&#xC758; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xB192;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. CQRS&#xB294; &#xBA85;&#xB839;(&#xC4F0;&#xAE30;) &#xBAA8;&#xB378;&#xACFC; &#xC870;&#xD68C;(&#xC77D;&#xAE30;) &#xBAA8;&#xB378;&#xC744; &#xBD84;&#xB9AC;&#xD558;&#xC5EC; &#xAC01; &#xBAA8;&#xB378;&#xC758; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xCD5C;&#xC18C;&#xD654;&#xD558;&#xB294;&#xB370; &#xB3C4;&#xC6C0;&#xC744; &#xC90D;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xD655;&#xC7A5;&#xC131; &#xD5A5;&#xC0C1;</strong> : &#xC77D;&#xAE30;&#xC640; &#xC4F0;&#xAE30; &#xC791;&#xC5C5;&#xC744; &#xB2E4;&#xB978; &#xC11C;&#xBE44;&#xC2A4;&#xB098; &#xB370;&#xC774;&#xD130; &#xC2A4;&#xD1A0;&#xC5B4;&#xC5D0; &#xBD84;&#xB9AC;&#xD568;&#xC73C;&#xB85C;&#xC368;, &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xC77D;&#xAE30; &#xBD80;&#xBD84;&#xACFC; &#xC4F0;&#xAE30; &#xBD80;&#xBD84;&#xC744; &#xB3C5;&#xB9BD;&#xC801;&#xC73C;&#xB85C; &#xD655;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xD2B9;&#xD654;&#xB41C; &#xBAA8;&#xB378;</strong> : &#xC77D;&#xAE30; &#xC804;&#xC6A9; &#xBAA8;&#xB378;&#xC740; &#xCD5C;&#xC801;&#xD654;&#xB41C; &#xC870;&#xD68C;&#xB97C; &#xC704;&#xD574; &#xD2B9;&#xBCC4;&#xD788; &#xC124;&#xACC4;&#xB420; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xC4F0;&#xAE30; &#xC804;&#xC6A9; &#xBAA8;&#xB378;&#xC740; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xADDC;&#xCE59;&#xACFC; &#xC720;&#xD6A8;&#xC131; &#xAC80;&#xC0AC;&#xC5D0; &#xC9D1;&#xC911;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xC774;&#xBCA4;&#xD2B8; &#xC18C;&#xC2F1;&#xACFC;&#xC758; &#xD1B5;&#xD569;</strong> : CQRS&#xB294; &#xC790;&#xC5F0;&#xC2A4;&#xB7FD;&#xAC8C; &#xC774;&#xBCA4;&#xD2B8; &#xC18C;&#xC2F1;(Event Sourcing)&#xACFC; &#xD1B5;&#xD569;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBCA4;&#xD2B8; &#xC18C;&#xC2F1;&#xC740; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xC0C1;&#xD0DC; &#xBCC0;&#xACBD;&#xC744; &#xC774;&#xBCA4;&#xD2B8;&#xC758; &#xC2DC;&#xD000;&#xC2A4;&#xB85C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xD328;&#xD134;&#xC785;&#xB2C8;&#xB2E4;. &#xBA85;&#xB839; &#xBAA8;&#xB378;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD55C; &#xC774;&#xBCA4;&#xD2B8;&#xB294; &#xC870;&#xD68C; &#xBAA8;&#xB378;&#xC744; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xC2DC;&#xC2A4;&#xD15C; &#xC77C;&#xAD00;&#xC131; &#xC720;&#xC9C0;</strong> : &#xBE44;&#xB3D9;&#xAE30; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC5D0;&#xC11C; CQRS&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74;, &#xC77D;&#xAE30; &#xBAA8;&#xB378;&#xACFC; &#xC4F0;&#xAE30; &#xBAA8;&#xB378; &#xAC04;&#xC758; &#xB370;&#xC774;&#xD130; &#xBD88;&#xC77C;&#xCE58;&#xB97C; &#xCD5C;&#xC18C;&#xD654;&#xD558;&#xACE0; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xC804;&#xBC18;&#xC801;&#xC778; &#xC77C;&#xAD00;&#xC131;&#xC744; &#xC720;&#xC9C0;&#xD558;&#xB294; &#xB370; &#xB3C4;&#xC6C0;&#xC744; &#xC90D;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xACB0;&#xB860;&#xC801;&#xC73C;&#xB85C;, DDD&#xC5D0;&#xC11C; CQRS&#xB294; &#xBCF5;&#xC7A1;&#xD55C; &#xB3C4;&#xBA54;&#xC778; &#xBB38;&#xC81C;&#xB97C; &#xB354;&#xC6B1; &#xBA85;&#xD655;&#xD558;&#xACE0; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xB2E4;&#xB8F0; &#xC218; &#xC788;&#xAC8C; &#xB3C4;&#xC640;&#xC8FC;&#xBA70;, &#xD655;&#xC7A5;&#xC131;, &#xC131;&#xB2A5;, &#xC720;&#xC9C0; &#xBCF4;&#xC218;&#xC131;&#xC744; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0A4;&#xB294; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC04;&#xB2E8;&#xD55C; CQRS &#xC608;&#xC81C;&#xB97C; &#xD30C;&#xC774;&#xC36C; &#xCF54;&#xB4DC;&#xB85C; &#xAD6C;&#xD604;&#xD574; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h3 id="1-%EB%8F%84%EB%A9%94%EC%9D%B8-%EB%AA%A8%EB%8D%B8">1. &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;</h3>
<p>&#xC6B0;&#xC120;, &#xAC04;&#xB2E8;&#xD55C; <code>User</code> &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xBD80;&#xD130; &#xC2DC;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</p>
<pre><code class="language-python">
class User:
    def __init__(self, user_id, name):
        self.user_id = user_id
        self.name = name
</code></pre>
<h3 id="2-%EB%AA%85%EB%A0%B9-%EB%AA%A8%EB%8D%B8">2. &#xBA85;&#xB839; &#xBAA8;&#xB378;</h3>
<pre><code class="language-python">
class Command:
    pass

class CreateUserCommand(Command):
    def __init__(self, user_id, name):
        self.user_id = user_id
        self.name = name

class CommandHandler:
    def handle(self, command):
        raise NotImplementedError

class CreateUserCommandHandler(CommandHandler):
    def __init__(self, repository):
        self.repository = repository

    def handle(self, command):
        user = User(command.user_id, command.name)
        self.repository.add(user)
</code></pre>
<h3 id="3-%EC%A1%B0%ED%9A%8C-%EB%AA%A8%EB%8D%B8">3. &#xC870;&#xD68C; &#xBAA8;&#xB378;</h3>
<pre><code class="language-python">
class Query:
    pass

class GetUserQuery(Query):
    def __init__(self, user_id):
        self.user_id = user_id

class QueryHandler:
    def handle(self, query):
        raise NotImplementedError

class GetUserQueryHandler(QueryHandler):
    def __init__(self, repository):
        self.repository = repository

    def handle(self, query):
        return self.repository.get(query.user_id)
</code></pre>
<h3 id="4-%EC%A0%80%EC%9E%A5%EC%86%8C">4. &#xC800;&#xC7A5;&#xC18C;</h3>
<pre><code class="language-python">
class UserRepository:
    def __init__(self):
        self.users = {}

    def add(self, user):
        self.users[user.user_id] = user

    def get(self, user_id):
        return self.users.get(user_id)
</code></pre>
<h3 id="%EC%82%AC%EC%9A%A9-%EC%98%88%EC%A0%9C">&#xC0AC;&#xC6A9; &#xC608;&#xC81C;</h3>
<pre><code class="language-python">
# &#xC800;&#xC7A5;&#xC18C; &#xBC0F; &#xD578;&#xB4E4;&#xB7EC; &#xCD08;&#xAE30;&#xD654;
repository = UserRepository()
create_user_handler = CreateUserCommandHandler(repository)
get_user_handler = GetUserQueryHandler(repository)

# &#xC0AC;&#xC6A9;&#xC790; &#xC0DD;&#xC131;
cmd = CreateUserCommand(1, &apos;Alice&apos;)
create_user_handler.handle(cmd)

# &#xC0AC;&#xC6A9;&#xC790; &#xC870;&#xD68C;
query = GetUserQuery(1)
user = get_user_handler.handle(query)
print(user.name)  # Output: Alice
</code></pre>
<p>&#xC774; &#xC608;&#xC81C;&#xB294; &#xB9E4;&#xC6B0; &#xAE30;&#xBCF8;&#xC801;&#xC778; &#xD615;&#xD0DC;&#xC758; CQRS&#xB97C; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. &#xC2E4;&#xC81C; &#xC0AC;&#xC6A9; &#xC2DC;&#xC5D0;&#xB294; &#xC774;&#xBCA4;&#xD2B8; &#xC18C;&#xC2F1;, &#xBE44;&#xB3D9;&#xAE30; &#xBA54;&#xC2DC;&#xC9D5;, &#xB3C5;&#xB9BD;&#xB41C; &#xB370;&#xC774;&#xD130; &#xC800;&#xC7A5;&#xC18C; &#xBC0F; &#xB2E4;&#xC591;&#xD55C; &#xCD5C;&#xC801;&#xD654; &#xAE30;&#xBC95; &#xB4F1;&#xACFC; &#xACB0;&#xD569;&#xD558;&#xC5EC; &#xB354;&#xC6B1; &#xBCF5;&#xC7A1;&#xD558;&#xAC8C; &#xAD6C;&#xD604;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h1 id="%EB%8F%84%EB%A9%94%EC%9D%B8-%EC%A3%BC%EB%8F%84%EA%B0%9C%EB%B0%9C%EC%9D%98-%EC%BD%94%EB%93%9C%EC%9D%98-%EC%96%91-%EC%A6%9D%EA%B0%80%EC%99%80-%EC%9C%A0%EC%A7%80%EB%B3%B4%EC%88%98">&#xB3C4;&#xBA54;&#xC778; &#xC8FC;&#xB3C4;&#xAC1C;&#xBC1C;&#xC758; &#xCF54;&#xB4DC;&#xC758; &#xC591; &#xC99D;&#xAC00;&#xC640; &#xC720;&#xC9C0;&#xBCF4;&#xC218;</h1>
<p>DDD (Domain-Driven Design)&#xB97C; &#xC801;&#xC6A9;&#xD558;&#xBA74; &#xCD08;&#xAE30;&#xC5D0;&#xB294; &#xCF54;&#xB4DC;&#xC758; &#xC591;&#xC774; &#xB298;&#xC5B4;&#xB0A0; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; &#xBCF5;&#xC7A1;&#xD55C; &#xB3C4;&#xBA54;&#xC778;&#xC744; &#xB2E4;&#xB8E8;&#xAC8C; &#xB418;&#xBA74;, &#xC5D4;&#xD130;&#xD2F0;, &#xAC12; &#xAC1D;&#xCCB4;, &#xB3C4;&#xBA54;&#xC778; &#xC11C;&#xBE44;&#xC2A4;, &#xC560;&#xADF8;&#xB9AC;&#xAC8C;&#xC774;&#xD2B8;, &#xB9AC;&#xD3EC;&#xC9C0;&#xD1A0;&#xB9AC; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xAC1C;&#xB150;&#xACFC; &#xAD6C;&#xD604;&#xCCB4;&#xB97C; &#xCD94;&#xAC00;&#xD574;&#xC57C; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB85C; &#xC778;&#xD574; &#xCF54;&#xB4DC;&#xC758; &#xC591;&#xC774; &#xC99D;&#xAC00;&#xD558;&#xACE0;, &#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xC720;&#xC9C0;&#xBCF4;&#xC218;&#xD574;&#xC57C; &#xD560; &#xB0B4;&#xC6A9;&#xB3C4; &#xB9CE;&#xC544; &#xBCF4;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xB098; DDD&#xC758; &#xC8FC;&#xC694; &#xBAA9;&#xD45C; &#xC911; &#xD558;&#xB098;&#xB294; &#xBCF5;&#xC7A1;&#xD55C; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xB85C;&#xC9C1;&#xACFC; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xC744; &#xCF54;&#xB4DC;&#xC5D0; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xBC18;&#xC601;&#xD558;&#xC5EC;, &#xC720;&#xC9C0;&#xBCF4;&#xC218;&#xC640; &#xD655;&#xC7A5;&#xC131;&#xC744; &#xAC1C;&#xC120;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8; &#xACB0;&#xACFC;&#xB85C; DDD&#xB97C; &#xC81C;&#xB300;&#xB85C; &#xC801;&#xC6A9;&#xD558;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xC7A5;&#xC810;&#xB4E4;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ol>
<li><strong>&#xBA85;&#xD655;&#xD55C; &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;</strong> : DDD&#xB294; &#xB3C4;&#xBA54;&#xC778;&#xC758; &#xD575;&#xC2EC; &#xAC1C;&#xB150;&#xACFC; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xADDC;&#xCE59;&#xC744; &#xCF54;&#xB4DC;&#xC5D0; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xD45C;&#xD604;&#xD558; encourages&#xB97C; &#xC7A5;&#xB824;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB85C; &#xC778;&#xD574; &#xCF54;&#xB4DC;&#xB294; &#xC790;&#xC5F0;&#xC2A4;&#xB7FD;&#xAC8C; &#xBB38;&#xC11C;&#xD654;&#xB418;&#xBA70;, &#xAC1C;&#xBC1C;&#xC790;&#xB294; &#xB3C4;&#xBA54;&#xC778; &#xB85C;&#xC9C1;&#xC744; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC26C;&#xC6CC;&#xC9D1;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xBD84;&#xB9AC;&#xB41C; &#xCC45;&#xC784;</strong> : DDD&#xC5D0;&#xC11C;&#xB294; &#xB3C4;&#xBA54;&#xC778; &#xB85C;&#xC9C1;&#xC744; &#xBD84;&#xB9AC;&#xD558;&#xC5EC; &#xAD00;&#xB828; &#xB85C;&#xC9C1;&#xC774; &#xD55C;&#xACF3;&#xC5D0; &#xBAA8;&#xC5EC;&#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xCF54;&#xB4DC; &#xBCC0;&#xACBD; &#xC2DC; &#xC5B4;&#xB514;&#xB97C; &#xC218;&#xC815;&#xD574;&#xC57C; &#xD558;&#xB294;&#xC9C0; &#xD30C;&#xC545;&#xD558;&#xAE30; &#xC27D;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4; &#xC90D;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xD5A5;&#xC0C1;&#xB41C; &#xD14C;&#xC2A4;&#xD2B8; &#xC6A9;&#xC774;&#xC131;</strong> : &#xBA85;&#xD655;&#xD55C; &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xACFC; &#xCC45;&#xC784;&#xC758; &#xBD84;&#xB9AC;&#xB294; &#xD14C;&#xC2A4;&#xD2B8;&#xD558;&#xAE30; &#xC26C;&#xC6B4; &#xCF54;&#xB4DC; &#xAD6C;&#xC870;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xB3C4;&#xBA54;&#xC778; &#xB85C;&#xC9C1;&#xC758; &#xC720;&#xB2DB; &#xD14C;&#xC2A4;&#xD2B8;&#xB294; &#xB3C5;&#xB9BD;&#xC801;&#xC774;&#xBA70; &#xC608;&#xCE21; &#xAC00;&#xB2A5;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xC7AC;&#xC0AC;&#xC6A9;&#xC131;</strong> : &#xC798; &#xC815;&#xC758;&#xB41C; &#xB3C4;&#xBA54;&#xC778; &#xB85C;&#xC9C1;&#xC740; &#xB2E4;&#xB978; &#xBD80;&#xBD84;&#xC5D0;&#xC11C;&#xC758; &#xC7AC;&#xC0AC;&#xC6A9;&#xC774; &#xC6A9;&#xC774;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xBE44;&#xC988;&#xB2C8;&#xC2A4;&#xC640; &#xAC1C;&#xBC1C;&#xC790;&#xAC04;&#xC758; &#xD1B5;&#xC2E0; &#xAC1C;&#xC120;</strong> : DDD&#xB294; &#xB3C4;&#xBA54;&#xC778; &#xC804;&#xBB38;&#xAC00;&#xC640; &#xAC1C;&#xBC1C;&#xC790; &#xC0AC;&#xC774;&#xC758; &#xC5B8;&#xC5B4; &#xACA9;&#xCC28;&#xB97C; &#xC904;&#xC774;&#xB294;&#xB370; &#xB3C4;&#xC6C0;&#xC744; &#xC90D;&#xB2C8;&#xB2E4;. &#xC774;&#xB85C; &#xC778;&#xD574; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xC758; &#xBCC0;&#xACBD;&#xC774;&#xB098; &#xCD94;&#xAC00;&#xAC00; &#xC788;&#xC744; &#xB54C; &#xB354;&#xC6B1; &#xD6A8;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xB300;&#xC751;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xACB0;&#xB860;&#xC801;&#xC73C;&#xB85C;, DDD&#xB294; &#xCD08;&#xAE30; &#xAD6C;&#xD604; &#xBE44;&#xC6A9;&#xC774; &#xC788;&#xC744; &#xC218; &#xC788;&#xC9C0;&#xB9CC;, &#xC911;&#xC7A5;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xBCFC; &#xB54C; &#xC720;&#xC9C0;&#xBCF4;&#xC218;&#xC758; &#xD6A8;&#xC728;&#xC131;&#xACFC; &#xCF54;&#xB4DC;&#xC758; &#xC9C8;&#xC744; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0A4;&#xB294; &#xBC29;&#xBC95;&#xB860;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h1 id="%EB%8F%84%EB%A9%94%EC%9D%B8%EC%A3%BC%EB%8F%84%EA%B0%9C%EB%B0%9C%EA%B3%BC-%EC%9D%98%EC%A1%B4%EC%84%B1">&#xB3C4;&#xBA54;&#xC778;&#xC8FC;&#xB3C4;&#xAC1C;&#xBC1C;&#xACFC; &#xC758;&#xC874;&#xC131;</h1>
<p>DDD (Domain-Driven Design)&#xC640; &#xC758;&#xC874;&#xC131; &#xAD00;&#xB9AC;&#xB294; &#xC11C;&#xB85C; &#xBC00;&#xC811;&#xD55C; &#xAD00;&#xB828;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. DDD&#xC5D0;&#xC11C; &#xD575;&#xC2EC;&#xC801;&#xC778; &#xC6D0;&#xCE59; &#xC911; &#xD558;&#xB098;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xAD00;&#xB9AC;&#xD558;&#xACE0;, &#xB3C4;&#xBA54;&#xC778;&#xC758; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xCF54;&#xB4DC;&#xB85C; &#xC798; &#xD45C;&#xD604;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xD6A8;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xAD00;&#xB9AC;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xCF54;&#xB4DC;&#xC640; &#xAD6C;&#xC131; &#xC694;&#xC18C; &#xAC04;&#xC758; &#xC758;&#xC874;&#xC131;&#xC744; &#xC798; &#xC870;&#xC9C1;&#xD558;&#xACE0; &#xAD00;&#xB9AC;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><strong>&#xACC4;&#xCE35;&#xD654;&#xB41C; &#xC544;&#xD0A4;&#xD14D;&#xCC98;</strong> : DDD&#xB294; &#xC804;&#xD1B5;&#xC801;&#xC73C;&#xB85C; 4&#xAC1C;&#xC758; &#xACC4;&#xCE35;&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB41C; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;: &#xD45C;&#xD604;, &#xC751;&#xC6A9;, &#xB3C4;&#xBA54;&#xC778;, &#xC778;&#xD504;&#xB77C;. &#xAC01; &#xACC4;&#xCE35; &#xAC04;&#xC758; &#xC758;&#xC874;&#xC131;&#xC740; &#xD2B9;&#xC815; &#xBC29;&#xD5A5;&#xC73C;&#xB85C;&#xB9CC; &#xD5C8;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xB3C4;&#xBA54;&#xC778; &#xACC4;&#xCE35;&#xC740; &#xB2E4;&#xB978; &#xACC4;&#xCE35;&#xC5D0; &#xC758;&#xC874;&#xD558;&#xC9C0; &#xC54A;&#xC544;&#xC57C; &#xD558;&#xBA70;, &#xC751;&#xC6A9; &#xACC4;&#xCE35;&#xC740; &#xB3C4;&#xBA54;&#xC778; &#xACC4;&#xCE35;&#xC5D0;&#xB9CC; &#xC758;&#xC874;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xC758;&#xC874;&#xC131; &#xC5ED;&#xC804; &#xC6D0;&#xCE59;</strong> : DDD&#xC5D0;&#xC11C;&#xB294; &#xC758;&#xC874;&#xC131; &#xC5ED;&#xC804; &#xC6D0;&#xCE59;&#xC744; &#xC801;&#xADF9; &#xD65C;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xB3C4;&#xBA54;&#xC778; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xC678;&#xBD80; &#xC11C;&#xBE44;&#xC2A4; (&#xC608;: &#xC774;&#xBA54;&#xC77C; &#xBC1C;&#xC1A1; &#xC11C;&#xBE44;&#xC2A4;)&#xC5D0; &#xC758;&#xC874;&#xD574;&#xC57C; &#xD560; &#xB54C;, &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB97C; &#xB3C4;&#xBA54;&#xC778; &#xB0B4;&#xC5D0; &#xC815;&#xC758;&#xD558;&#xACE0;, &#xAD6C;&#xD604;&#xC740; &#xC778;&#xD504;&#xB77C; &#xACC4;&#xCE35;&#xC5D0;&#xC11C; &#xC218;&#xD589;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xD558;&#xBA74; &#xB3C4;&#xBA54;&#xC778; &#xB85C;&#xC9C1;&#xC740; &#xC678;&#xBD80; &#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xAD6C;&#xCCB4;&#xC801;&#xC778; &#xAD6C;&#xD604;&#xBD80;&#xB85C;&#xBD80;&#xD130; &#xB3C5;&#xB9BD;&#xC801;&#xC774;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xC560;&#xADF8;&#xB9AC;&#xAC8C;&#xC774;&#xD2B8;&#xC640; &#xB77C;&#xC774;&#xD504;&#xC0AC;&#xC774;&#xD074;</strong> : &#xC560;&#xADF8;&#xB9AC;&#xAC8C;&#xC774;&#xD2B8;&#xB294; DDD&#xC5D0;&#xC11C; &#xC77C;&#xAD00;&#xC131; &#xACBD;&#xACC4;&#xB97C; &#xC815;&#xC758;&#xD558;&#xB294; &#xC911;&#xC694;&#xD55C; &#xAC1C;&#xB150;&#xC785;&#xB2C8;&#xB2E4;. &#xC560;&#xADF8;&#xB9AC;&#xAC8C;&#xC774;&#xD2B8; &#xB0B4;&#xC758; &#xAC1D;&#xCCB4;&#xB4E4;&#xC740; &#xD568;&#xAED8; &#xBB36;&#xC5EC; &#xC788;&#xC73C;&#xBBC0;&#xB85C;, &#xC758;&#xC874;&#xC131;&#xACFC; &#xB77C;&#xC774;&#xD504;&#xC0AC;&#xC774;&#xD074; &#xAD00;&#xB9AC;&#xAC00; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xBC14;&#xC6B4;&#xB514;&#xB4DC; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;</strong> : DDD&#xC5D0;&#xC11C; &#xBC14;&#xC6B4;&#xB514;&#xB4DC; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xB294; &#xD2B9;&#xC815; &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xC758; &#xACBD;&#xACC4;&#xB97C; &#xC815;&#xC758;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xACBD;&#xACC4;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; &#xB3D9;&#xC77C;&#xD55C; &#xC6A9;&#xC5B4;&#xB098; &#xAC1C;&#xB150;&#xC774; &#xB2E4;&#xB978; &#xC758;&#xBBF8;&#xB97C; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xCF54;&#xB4DC; &#xBCA0;&#xC774;&#xC2A4; &#xB0B4;&#xC5D0;&#xC11C; &#xBAA8;&#xB378;&#xC758; &#xC758;&#xC874;&#xC131;&#xACFC; &#xC5F0;&#xAD00;&#xC131;&#xC744; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xAD00;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xBAA8;&#xB4C8;&#xD654;</strong> : DDD&#xB294; &#xB3C4;&#xBA54;&#xC778;&#xC744; &#xC791;&#xC740; &#xBAA8;&#xB4C8; &#xB610;&#xB294; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB85C; &#xBD84;&#xB9AC;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC7A5;&#xB824;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xBD84;&#xB9AC;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xAC01; &#xBAA8;&#xB4C8;&#xC774;&#xB098; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xC758; &#xB0B4;&#xBD80; &#xC758;&#xC874;&#xC131;&#xC740; &#xAC15;&#xD654;&#xB418;&#xACE0;, &#xC678;&#xBD80;&#xC640;&#xC758; &#xC758;&#xC874;&#xC131;&#xC740; &#xCD5C;&#xC18C;&#xD654;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xACB0;&#xB860;&#xC801;&#xC73C;&#xB85C;, DDD&#xB294; &#xC758;&#xC874;&#xC131; &#xAD00;&#xB9AC; &#xC6D0;&#xCE59;&#xB4E4;&#xC744; &#xD1B5;&#xD574; &#xCF54;&#xB4DC;&#xC758; &#xC720;&#xC9C0; &#xBCF4;&#xC218;&#xC131;, &#xD655;&#xC7A5;&#xC131;, &#xD14C;&#xC2A4;&#xD2B8; &#xC6A9;&#xC774;&#xC131;&#xC744; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0A4;&#xB294; &#xC124;&#xACC4; &#xBC29;&#xC2DD;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h1 id="%EB%8F%84%EB%A9%94%EC%9D%B8%EC%A3%BC%EB%8F%84%EA%B0%9C%EB%B0%9C%EA%B3%BC-%EB%A7%88%EC%9D%B4%ED%81%AC%EB%A1%9C%EC%84%9C%EB%B9%84%EC%8A%A4">&#xB3C4;&#xBA54;&#xC778;&#xC8FC;&#xB3C4;&#xAC1C;&#xBC1C;&#xACFC; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC11C;&#xBE44;&#xC2A4;</h1>
<p>DDD&#xC640; &#xC758;&#xC874;&#xC131; &#xAD00;&#xB9AC; &#xC6D0;&#xCE59;&#xC744; &#xC801;&#xC6A9;&#xD558;&#xBA74; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC11C;&#xBE44;&#xC2A4; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xC124;&#xACC4;&#xD558;&#xACE0; &#xAD6C;&#xD604;&#xD558;&#xB294; &#xB370; &#xC5EC;&#xB7EC; &#xAC00;&#xC9C0; &#xC7A5;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><strong>&#xBC14;&#xC6B4;&#xB514;&#xB4DC; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;</strong> : DDD&#xC758; &#xBC14;&#xC6B4;&#xB514;&#xB4DC; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xB294; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC815;&#xC758;&#xD558;&#xACE0; &#xACBD;&#xACC4;&#xB97C; &#xC124;&#xC815;&#xD558;&#xB294; &#xB370; &#xB3C4;&#xC6C0;&#xC744; &#xC90D;&#xB2C8;&#xB2E4;. &#xAC01; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC11C;&#xBE44;&#xC2A4;&#xB294; &#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xBC14;&#xC6B4;&#xB514;&#xB4DC; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xB0B4;&#xC5D0;&#xC11C; &#xB3C4;&#xBA54;&#xC778; &#xBAA8;&#xB378;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xC11C;&#xBE44;&#xC2A4; &#xAC04;&#xC758; &#xBA85;&#xD655;&#xD55C; &#xACBD;&#xACC4;&#xC640; &#xCC45;&#xC784;&#xC744; &#xC815;&#xC758;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xC774;&#xB85C; &#xC778;&#xD574; &#xC11C;&#xBE44;&#xC2A4; &#xAC04;&#xC758; &#xACB0;&#xD569;&#xB3C4;&#xB97C; &#xB0AE;&#xCD9C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xD300; &#xC791;&#xC5C5;</strong> : &#xAC01; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xBC14;&#xC6B4;&#xB514;&#xB4DC; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xB97C; &#xAC00;&#xC9C0;&#xBA74;, &#xB2E4;&#xC591;&#xD55C; &#xD300;&#xC774; &#xB3D9;&#xC2DC;&#xC5D0; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xC11C;&#xBE44;&#xC2A4; &#xC704;&#xC5D0; &#xC791;&#xC5C5;&#xC744; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD611;&#xC5C5;&#xACFC; &#xBC30;&#xD3EC;&#xC758; &#xC720;&#xC5F0;&#xC131;&#xC744; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xC758;&#xC874;&#xC131; &#xAD00;&#xB9AC;</strong> : DDD&#xC758; &#xC758;&#xC874;&#xC131; &#xAD00;&#xB9AC; &#xC6D0;&#xCE59;&#xC740; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC11C;&#xBE44;&#xC2A4; &#xB0B4;&#xBD80;&#xC758; &#xCF54;&#xB4DC; &#xAD6C;&#xC870;&#xB97C; &#xCCB4;&#xACC4;&#xC801;&#xC73C;&#xB85C; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xB370; &#xB3C4;&#xC6C0;&#xC744; &#xC90D;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xAC01; &#xC11C;&#xBE44;&#xC2A4;&#xB294; &#xC790;&#xCCB4;&#xC801;&#xC778; &#xC758;&#xC874;&#xC131;&#xC744; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xAD00;&#xB9AC;&#xD558;&#xBA70;, &#xC678;&#xBD80; &#xC11C;&#xBE44;&#xC2A4;&#xC640;&#xC758; &#xD1B5;&#xC2E0;&#xC740; API &#xACC4;&#xC57D;&#xC744; &#xD1B5;&#xD574; &#xAD00;&#xB9AC;&#xB429;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xB3C4;&#xBA54;&#xC778; &#xC774;&#xBCA4;&#xD2B8;</strong> : DDD&#xC5D0;&#xC11C;&#xB294; &#xB3C4;&#xBA54;&#xC778; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xB2E4;&#xC591;&#xD55C; &#xB3C4;&#xBA54;&#xC778; &#xAC04;&#xC758; &#xC0C1;&#xD638; &#xC791;&#xC6A9;&#xC744; &#xBAA8;&#xB378;&#xB9C1;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBCA4;&#xD2B8; &#xAE30;&#xBC18; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB294; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC11C;&#xBE44;&#xC2A4; &#xAC04;&#xC758; &#xBE44;&#xB3D9;&#xAE30; &#xD1B5;&#xC2E0; &#xD328;&#xD134;&#xACFC; &#xC798; &#xB9DE;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xC720;&#xC5F0;&#xD55C; &#xB370;&#xC774;&#xD130; &#xAD00;&#xB9AC;</strong> : DDD&#xB294; &#xAC01; &#xB3C4;&#xBA54;&#xC778; &#xB0B4;&#xC5D0;&#xC11C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xAD00;&#xB9AC;&#xD558;&#xACE0; &#xC800;&#xC7A5;&#xD560; &#xAC83;&#xC778;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xC720;&#xC5F0;&#xC131;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC11C;&#xBE44;&#xC2A4;&#xC5D0;&#xC11C; &#xAC01; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xC790;&#xC2E0;&#xC758; &#xB370;&#xC774;&#xD130; &#xC800;&#xC7A5;&#xC18C;&#xB97C; &#xB3C5;&#xB9BD;&#xC801;&#xC73C;&#xB85C; &#xC18C;&#xC720;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xB9AC;&#xD329;&#xD1A0;&#xB9C1;&#xACFC; &#xD655;&#xC7A5;</strong> : DDD&#xC640; &#xC758;&#xC874;&#xC131; &#xAD00;&#xB9AC; &#xC6D0;&#xCE59;&#xC744; &#xD1B5;&#xD574;, &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC11C;&#xBE44;&#xC2A4;&#xB294; &#xB354; &#xC27D;&#xAC8C; &#xB9AC;&#xD329;&#xD1A0;&#xB9C1;&#xD558;&#xAC70;&#xB098; &#xD655;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC11C;&#xBE44;&#xC2A4; &#xACBD;&#xACC4;&#xC640; &#xB0B4;&#xBD80; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xAC00; &#xC798; &#xC815;&#xC758;&#xB418;&#xC5B4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBCC0;&#xACBD;&#xC774; &#xD544;&#xC694;&#xD55C; &#xACBD;&#xC6B0; &#xD574;&#xB2F9; &#xC11C;&#xBE44;&#xC2A4;&#xB9CC; &#xC218;&#xC815;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC11C;&#xBE44;&#xC2A4; &#xAC04;&#xC758; &#xD1B5;&#xC2E0;</strong> : DDD&#xB294; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC11C;&#xBE44;&#xC2A4; &#xAC04;&#xC758; &#xD1B5;&#xC2E0; &#xD328;&#xD134;&#xACFC; &#xACC4;&#xC57D;&#xC744; &#xC798; &#xC815;&#xC758;&#xD558;&#xB294; &#xB370; &#xB3C4;&#xC6C0;&#xC744; &#xC90D;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC11C;&#xBE44;&#xC2A4; &#xAC04;&#xC758; &#xD1B5;&#xC2E0;&#xC744; &#xB354; &#xC548;&#xC815;&#xC801;&#xC774;&#xACE0; &#xC608;&#xCE21; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC11C;&#xBE44;&#xC2A4; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB294; DDD&#xC758; &#xC5EC;&#xB7EC; &#xC6D0;&#xCE59;&#xACFC; &#xD328;&#xD134;&#xACFC; &#xC798; &#xB9DE;&#xB294;&#xB370;, &#xADF8; &#xC774;&#xC720;&#xB294; &#xB9C8;&#xC774;&#xD06C;&#xB85C;&#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xD575;&#xC2EC; &#xC6D0;&#xCE59; &#xC911; &#xD558;&#xB098;&#xC778; &quot;&#xC11C;&#xBE44;&#xC2A4;&#xC758; &#xB3C5;&#xB9BD;&#xC131;&quot;&#xC774; DDD&#xC758; &#xBC14;&#xC6B4;&#xB514;&#xB4DC; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xC640; &#xC798; &#xC5F0;&#xACB0;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
<!--kg-card-end: markdown-->]]></content:encoded></item><item><title><![CDATA[Stop Being a Junior 주니어 개발자]]></title><description><![CDATA[<figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://kentcdodds.com/blog/stop-being-a-junior?ref=localhost"><div class="kg-bookmark-content"><div class="kg-bookmark-title">Stop Being a Junior</div><div class="kg-bookmark-description">Some advise for people who still consider themselves junior developers</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://kentcdodds.com/favicons/apple-touch-icon.png" alt></div></div><div class="kg-bookmark-thumbnail"><img src="https://res.cloudinary.com/kentcdodds-com/image/upload/$th_1256,$tw_2400,$gw_$tw_div_24,$gh_$th_div_12/co_rgb:a9adc1,c_fit,g_north_west,w_$gw_mul_14,h_$gh,x_$gw_mul_1.5,y_$gh_mul_1.3,l_text:kentcdodds.com:Matter-Regular.woff2_50:Check%20out%20this%20article/co_white,c_fit,g_north_west,w_$gw_mul_13.5,h_$gh_mul_7,x_$gw_mul_1.5,y_$gh_mul_2.3,l_text:kentcdodds.com:Matter-Regular.woff2_110:Stop%20Being%20a%20Junior/c_fit,g_north_west,r_max,w_$gw_mul_4,h_$gh_mul_3,x_$gw,y_$gh_mul_8,l_kent:profile-transparent/co_rgb:a9adc1,c_fit,g_north_west,w_$gw_mul_5.5,h_$gh_mul_4,x_$gw_mul_4.5,y_$gh_mul_9,l_text:kentcdodds.com:Matter-Regular.woff2_70:Kent%20C.%20Dodds/co_rgb:a9adc1,c_fit,g_north_west,w_$gw_mul_9,x_$gw_mul_4.5,y_$gh_mul_9.8,l_text:kentcdodds.com:Matter-Regular.woff2_40:kentcdodds.com%2Fblog%2Fstop-being-a-junior/c_fill,ar_3:4,r_12,g_east,h_$gh_mul_10,x_$gw,l_unsplash:photo-1503023345310-bd7c1de61c7d/c_fill,w_$tw,h_$th/kentcdodds.com/social-background.png" alt></div></a></figure><p>&#xC704; &#xBE14;&#xB85C;&#xADF8;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xC694;&#xC57D;&#xD569;&#xB2C8;&#xB2E4;.</p><!--kg-card-begin: markdown--><p>&quot;&#xC8FC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;&#xC785;&#xB2C8;&#xAE4C;?&quot;&#xB77C;&#xB294; &#xC9C8;&#xBB38;&#xC5D0; &#xB300;&#xD55C; &#xB2F5;&#xBCC0;&#xC744; &#xC2DC;&#xC791;</p>]]></description><link>https://blog.midagedev.com/stop-being-a-junior/</link><guid isPermaLink="false">64d41deb4026ab0901842050</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Wed, 09 Aug 2023 23:16:41 GMT</pubDate><content:encoded><![CDATA[<figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://kentcdodds.com/blog/stop-being-a-junior?ref=localhost"><div class="kg-bookmark-content"><div class="kg-bookmark-title">Stop Being a Junior</div><div class="kg-bookmark-description">Some advise for people who still consider themselves junior developers</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://kentcdodds.com/favicons/apple-touch-icon.png" alt></div></div><div class="kg-bookmark-thumbnail"><img src="https://res.cloudinary.com/kentcdodds-com/image/upload/$th_1256,$tw_2400,$gw_$tw_div_24,$gh_$th_div_12/co_rgb:a9adc1,c_fit,g_north_west,w_$gw_mul_14,h_$gh,x_$gw_mul_1.5,y_$gh_mul_1.3,l_text:kentcdodds.com:Matter-Regular.woff2_50:Check%20out%20this%20article/co_white,c_fit,g_north_west,w_$gw_mul_13.5,h_$gh_mul_7,x_$gw_mul_1.5,y_$gh_mul_2.3,l_text:kentcdodds.com:Matter-Regular.woff2_110:Stop%20Being%20a%20Junior/c_fit,g_north_west,r_max,w_$gw_mul_4,h_$gh_mul_3,x_$gw,y_$gh_mul_8,l_kent:profile-transparent/co_rgb:a9adc1,c_fit,g_north_west,w_$gw_mul_5.5,h_$gh_mul_4,x_$gw_mul_4.5,y_$gh_mul_9,l_text:kentcdodds.com:Matter-Regular.woff2_70:Kent%20C.%20Dodds/co_rgb:a9adc1,c_fit,g_north_west,w_$gw_mul_9,x_$gw_mul_4.5,y_$gh_mul_9.8,l_text:kentcdodds.com:Matter-Regular.woff2_40:kentcdodds.com%2Fblog%2Fstop-being-a-junior/c_fill,ar_3:4,r_12,g_east,h_$gh_mul_10,x_$gw,l_unsplash:photo-1503023345310-bd7c1de61c7d/c_fill,w_$tw,h_$th/kentcdodds.com/social-background.png" alt></div></a></figure><p>&#xC704; &#xBE14;&#xB85C;&#xADF8;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xC694;&#xC57D;&#xD569;&#xB2C8;&#xB2E4;.</p><!--kg-card-begin: markdown--><p>&quot;&#xC8FC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;&#xC785;&#xB2C8;&#xAE4C;?&quot;&#xB77C;&#xB294; &#xC9C8;&#xBB38;&#xC5D0; &#xB300;&#xD55C; &#xB2F5;&#xBCC0;&#xC744; &#xC2DC;&#xC791;&#xC73C;&#xB85C;, Kent C. Dodds&#xB294; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xC790;&#xC2E0;&#xC744; &quot;&#xC8FC;&#xB2C8;&#xC5B4;&quot;&#xB85C; &#xB290;&#xB07C;&#xB294; &#xC774;&#xC720;&#xC640; &#xC774;&#xB97C; &#xBC97;&#xC5B4;&#xB098;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xB300;&#xD574; &#xB17C;&#xC758;&#xD569;&#xB2C8;&#xB2E4;.</p>
<ol>
<li><strong>&#xC8FC;&#xB2C8;&#xC5B4;&#xC758; &#xC815;&#xC758;</strong> : &#xB9CE;&#xC740; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xC790;&#xC2E0;&#xC744; &quot;&#xC8FC;&#xB2C8;&#xC5B4;&quot;&#xB77C;&#xACE0; &#xBD80;&#xB974;&#xBA70;, &#xC774;&#xB294; &#xC9C1;&#xD568;, &#xC791;&#xC5C5;&#xC758; &#xC131;&#xACA9;, &#xB610;&#xB294; &#xACBD;&#xB825;&#xC758; &#xC9E7;&#xC74C;&#xC5D0; &#xAE30;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; Dodds&#xB294; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xC5BC;&#xB9C8;&#xB098; &#xC624;&#xB798; &#xC77C;&#xD574;&#xC57C; &quot;&#xC8FC;&#xB2C8;&#xC5B4;&quot;&#xAC00; &#xC544;&#xB2C8;&#xAC8C; &#xB418;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xAD6C;&#xCCB4;&#xC801;&#xC778; &#xC2DC;&#xAC04; &#xC81C;&#xD55C;&#xC740; &#xC5C6;&#xB2E4;&#xACE0; &#xC8FC;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xACBD;&#xD5D8;&#xACFC; &#xC9C0;&#xC2DD;</strong> : &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xAC1C;&#xBC1C; &#xBD84;&#xC57C;&#xB294; &#xBE60;&#xB974;&#xAC8C; &#xBCC0;&#xD654;&#xD558;&#xBA70;, &#xC774;&#xC5D0; &#xB530;&#xB77C; &#xC0C8;&#xB85C;&#xC6B4; &#xAE30;&#xC220;&#xACFC; &#xB3C4;&#xAD6C;&#xC5D0; &#xBE60;&#xB974;&#xAC8C; &#xC801;&#xC751;&#xD558;&#xB294; &#xAC1C;&#xBC1C;&#xC790;&#xB294; &#xC624;&#xB79C; &#xACBD;&#xB825;&#xC744; &#xAC00;&#xC9C4; &#xAC1C;&#xBC1C;&#xC790;&#xC640; &#xB3D9;&#xB4F1;&#xD55C; &#xC218;&#xC900;&#xC758; &#xC9C0;&#xC2DD;&#xC744; &#xAC16;&#xCD9C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xACBD;&#xD5D8;&#xC774; &#xB9CE;&#xC740; &#xAC1C;&#xBC1C;&#xC790;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xB3C4;&#xAD6C;&#xB098; &#xAE30;&#xC220;&#xC5D0; &#xB300;&#xD55C; &#xC800;&#xD56D;&#xAC10;&#xC744; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xC774;&#xB294; &#xADF8;&#xB4E4;&#xC774; &#xC0C8;&#xB85C;&#xC6B4; &#xAE30;&#xB2A5;&#xC774;&#xB098; &#xB3C4;&#xAD6C;&#xB97C; &#xB193;&#xCE60; &#xC218; &#xC788;&#xC74C;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xC8FC;&#xB2C8;&#xC5B4;&#xC5D0;&#xC11C; &#xBC97;&#xC5B4;&#xB098;&#xAE30;</strong> : Dodds&#xB294; &#xC790;&#xC2E0;&#xC758; &#xACBD;&#xD5D8;&#xC744; &#xD1B5;&#xD574; &quot;&#xC8FC;&#xB2C8;&#xC5B4;&quot;&#xB77C;&#xB294; &#xD0C0;&#xC774;&#xD2C0;&#xC744; &#xBC97;&#xC5B4;&#xB098;&#xAE30; &#xC704;&#xD574; &#xB2E4;&#xB978; &#xD68C;&#xC0AC;&#xB85C; &#xC774;&#xC9C1;&#xD55C; &#xC0AC;&#xB840;&#xB97C; &#xACF5;&#xC720;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xD68C;&#xC0AC;&#xC5D0;&#xC11C; &#xB354; &#xD070; &#xCC45;&#xC784;&#xACFC; &#xC5ED;&#xD560;&#xC744; &#xB9E1;&#xAC8C; &#xB418;&#xC5C8;&#xC73C;&#xBA70;, &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xADF8;&#xC758; &#xB2A5;&#xB825;&#xC774; &#xC778;&#xC815;&#xBC1B;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li><strong>&#xC2DC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xB418;&#xB294; &#xBC29;&#xBC95;</strong> :</li>
</ol>
<ul>
<li>&#xC2DC;&#xB2C8;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xD558;&#xB294; &#xC77C;&#xC744; &#xAD00;&#xCC30;&#xD558;&#xACE0; &#xB530;&#xB77C;&#xD558;&#xC138;&#xC694;.</li>
<li>&#xBCF5;&#xC7A1;&#xD55C; &#xC791;&#xC5C5;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xB824;&#xACE0; &#xB178;&#xB825;&#xD558;&#xACE0;, &#xD68C;&#xC758;&#xC5D0; &#xCC38;&#xC11D;&#xD558;&#xC5EC; &#xC9C0;&#xC2DD;&#xC744; &#xCD95;&#xC801;&#xD558;&#xC138;&#xC694;.</li>
<li>&#xAE30;&#xC220;&#xC758; &#xBC1C;&#xC804;&#xC744; &#xB530;&#xB77C;&#xAC00;&#xACE0;, &#xD68C;&#xC0AC;&#xC758; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC5D0;&#xAC8C; &#xC0C8;&#xB85C;&#xC6B4; &#xAE30;&#xC220;&#xC744; &#xAC00;&#xB974;&#xCE58;&#xC138;&#xC694;.</li>
<li>&#xC9C0;&#xC5ED; &#xBAA8;&#xC784;&#xC774;&#xB098; &#xCEE8;&#xD37C;&#xB7F0;&#xC2A4;&#xC5D0;&#xC11C; &#xBC1C;&#xD45C;&#xD558;&#xBA70; &#xACBD;&#xD5D8;&#xC744; &#xC313;&#xC73C;&#xC138;&#xC694;.</li>
<li>&#xB2F9;&#xC2E0;&#xC758; &#xC131;&#xCDE8;&#xB97C; &#xACF5;&#xC720;&#xD558;&#xACE0;, &#xAD00;&#xB9AC;&#xC790;&#xC5D0;&#xAC8C; &#xB2F9;&#xC2E0;&#xC758; &#xBAA9;&#xD45C;&#xC640; &#xC758;&#xB3C4;&#xB97C; &#xBA85;&#xD655;&#xD788; &#xC54C;&#xB824;&#xC8FC;&#xC138;&#xC694;.</li>
</ul>
<ol start="5">
<li><strong>&quot;&#xC8FC;&#xB2C8;&#xC5B4;&quot; &#xD0C0;&#xC774;&#xD2C0;&#xC5D0;&#xC11C; &#xBC97;&#xC5B4;&#xB098;&#xAE30;</strong> : &#xB54C;&#xB85C;&#xB294; &quot;&#xC8FC;&#xB2C8;&#xC5B4;&quot; &#xD0C0;&#xC774;&#xD2C0;&#xC744; &#xBC97;&#xC5B4;&#xB098;&#xAE30; &#xC704;&#xD574; &#xB2E4;&#xB978; &#xAE30;&#xD68C;&#xB97C; &#xCC3E;&#xC544;&#xBCF4;&#xB294; &#xAC83;&#xC774; &#xD544;&#xC694;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ol>
<p>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C;, Dodds&#xB294; &#xC774; &#xAE00;&#xC744; &#xD1B5;&#xD574; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC5D0;&#xAC8C; &#xB354; &#xB192;&#xC740; &#xBAA9;&#xD45C;&#xB97C; &#xD5A5;&#xD574; &#xB3C4;&#xC804;&#xD558;&#xB3C4;&#xB85D; &#xB3C5;&#xB824;&#xD558;&#xBA70;, &quot;&#xC8FC;&#xB2C8;&#xC5B4;&quot;&#xB77C;&#xB294; &#xD0C0;&#xC774;&#xD2C0;&#xC5D0; &#xC5BD;&#xB9E4;&#xC774;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xAD8C;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<!--kg-card-end: markdown-->]]></content:encoded></item><item><title><![CDATA[Why Functional Programming Matters 함수형 프로그래밍]]></title><description><![CDATA[<p><a href="https://www.cs.kent.ac.uk/people/staff/dat/miranda/whyfp90.pdf?ref=localhost">https://www.cs.kent.ac.uk/people/staff/dat/miranda/whyfp90.pdf</a></p><p>&#xC704; &#xAE00;&#xC5D0; &#xB300;&#xD55C; &#xC694;&#xC57D;</p><h3 id="1-%EC%84%9C%EB%A1%A0-introduction-page-1">1. &#xC11C;&#xB860; (Introduction) [Page 1]</h3><p>&#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC740; &#xD568;&#xC218;&#xC758; &#xC801;&#xC6A9;&#xC744; &#xAE30;&#xBCF8; &#xC5F0;&#xC0B0;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xBA70;</p>]]></description><link>https://blog.midagedev.com/why-functional-programming-matters/</link><guid isPermaLink="false">64cce46f4026ab090184203c</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Fri, 04 Aug 2023 11:45:15 GMT</pubDate><content:encoded><![CDATA[<p><a href="https://www.cs.kent.ac.uk/people/staff/dat/miranda/whyfp90.pdf?ref=localhost">https://www.cs.kent.ac.uk/people/staff/dat/miranda/whyfp90.pdf</a></p><p>&#xC704; &#xAE00;&#xC5D0; &#xB300;&#xD55C; &#xC694;&#xC57D;</p><h3 id="1-%EC%84%9C%EB%A1%A0-introduction-page-1">1. &#xC11C;&#xB860; (Introduction) [Page 1]</h3><p>&#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC740; &#xD568;&#xC218;&#xC758; &#xC801;&#xC6A9;&#xC744; &#xAE30;&#xBCF8; &#xC5F0;&#xC0B0;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xBA70;, &#xC8FC;&#xC694; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB3C4; &#xC785;&#xB825;&#xC744; &#xC778;&#xC218;&#xB85C; &#xBC1B;&#xACE0; &#xCD9C;&#xB825;&#xC744; &#xACB0;&#xACFC;&#xB85C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xD568;&#xC218;&#xB85C; &#xC791;&#xC131;&#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xC811;&#xADFC; &#xBC29;&#xC2DD;&#xC740; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC758; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xC904;&#xC774;&#xACE0; &#xBAA8;&#xB4C8;&#xD654;&#xB97C; &#xCD09;&#xC9C4;&#xD558;&#xBA70;, &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC27D;&#xAC8C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC740; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xC218;&#xD559; &#xD568;&#xC218;&#xC640; &#xC720;&#xC0AC;&#xD558;&#xAC8C; &#xC791;&#xB3D9;&#xD558;&#xBBC0;&#xB85C;, &#xC218;&#xD559;&#xC801; &#xCD94;&#xB860;&#xC774; &#xB354; &#xC27D;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h4 id="%EC%98%88%EC%A0%9C-%EC%BD%94%EB%93%9C">&#xC608;&#xC81C; &#xCF54;&#xB4DC;:</h4><pre><code class="language-javascript">
// &#xC785;&#xB825;&#xC744; &#xBC1B;&#xC544; &#xCD9C;&#xB825;&#xC744; &#xBC18;&#xD658;&#xD558;&#xB294; &#xD568;&#xC218;
const greet = (name) =&gt; `Hello, ${name}!`;
console.log(greet(&quot;John&quot;)); // &#xCD9C;&#xB825;: Hello, John!
</code></pre><pre><code class="language-javascript">
// &#xD568;&#xC218;&#xB97C; &#xC778;&#xC218;&#xB85C; &#xBC1B;&#xC544; &#xB2E4;&#xB978; &#xD568;&#xC218;&#xB97C; &#xBC18;&#xD658;&#xD558;&#xB294; &#xACE0;&#xCC28; &#xD568;&#xC218;
const multiplyBy = (factor) =&gt; (number) =&gt; number * factor;
const multiplyByTwo = multiplyBy(2);
console.log(multiplyByTwo(3)); // &#xCD9C;&#xB825;: 6
</code></pre><h3 id="2-%EA%B5%AC%EC%A1%B0%ED%99%94-%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%98%EB%B0%8D%EA%B3%BC%EC%9D%98-%EC%9C%A0%EC%82%AC%EC%84%B1-an-analogy-with-structured-programming-page-3">2. &#xAD6C;&#xC870;&#xD654; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xACFC;&#xC758; &#xC720;&#xC0AC;&#xC131; (An Analogy with Structured Programming) [Page 3]</h3><p>&#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC740; &#xAD6C;&#xC870;&#xD654; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xACFC; &#xC720;&#xC0AC;&#xD55C; &#xC774;&#xC810;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xBAA8;&#xB4C8;&#xD654;&#xB41C; &#xC124;&#xACC4;&#xB294; &#xCF54;&#xB4DC; &#xC7AC;&#xC0AC;&#xC6A9;&#xC744; &#xCD09;&#xC9C4;&#xD558;&#xACE0; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xC27D;&#xAC8C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;. &#xD568;&#xC218;&#xD615; &#xC5B8;&#xC5B4;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xC11C;&#xBE0C; &#xBB38;&#xC81C;&#xB85C; &#xB098;&#xB204;&#xACE0; &#xD574;&#xACB0;&#xCC45;&#xC744; &#xACB0;&#xD569;&#xD558;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xBC29;&#xBC95;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xBA70;, &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xCF54;&#xB4DC;&#xC758; &#xBAA8;&#xB4C8;&#xD654;&#xB97C; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;.</p><h4 id="%EC%98%88%EC%A0%9C-%EC%BD%94%EB%93%9C-1">&#xC608;&#xC81C; &#xCF54;&#xB4DC;:</h4><pre><code class="language-javascript">
// &#xBAA8;&#xB4C8;&#xD654;&#xB41C; &#xD568;&#xC218;
const add = (a, b) =&gt; a + b;
const multiply = (a, b) =&gt; a * b;
const operate = (operator, a, b) =&gt; operator(a, b);
console.log(operate(add, 2, 3)); // &#xCD9C;&#xB825;: 5
console.log(operate(multiply, 2, 3)); // &#xCD9C;&#xB825;: 6
</code></pre><pre><code class="language-javascript">
// &#xC7AC;&#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xBAA8;&#xB4C8;
const square = (x) =&gt; x * x;
const sumOfSquares = (a, b) =&gt; add(square(a), square(b));
console.log(sumOfSquares(3, 4)); // &#xCD9C;&#xB825;: 25
</code></pre><h3 id="3-%ED%95%A8%EC%88%98-%EA%B2%B0%ED%95%A9-gluing-functions-together-page-4-8">3. &#xD568;&#xC218; &#xACB0;&#xD569; (Gluing Functions Together) [Page 4-8]</h3><p>&#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C;&#xB294; &#xC791;&#xC740; &#xD568;&#xC218;&#xB97C; &#xBCF5;&#xC7A1;&#xD55C; &#xD568;&#xC218;&#xB85C; &#xACB0;&#xD569;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xCF54;&#xB4DC;&#xC758; &#xC7AC;&#xC0AC;&#xC6A9;&#xC131;&#xACFC; &#xC720;&#xC9C0; &#xBCF4;&#xC218;&#xC131;&#xC774; &#xD5A5;&#xC0C1;&#xB429;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xB9AC;&#xC2A4;&#xD2B8; &#xCC98;&#xB9AC;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xB2E4;&#xC591;&#xD55C; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xACE0;&#xCC28; &#xD568;&#xC218;&#xB97C; &#xC791;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h4 id="%EC%98%88%EC%A0%9C-%EC%BD%94%EB%93%9C-2">&#xC608;&#xC81C; &#xCF54;&#xB4DC;:</h4><pre><code class="language-javascript">
// &#xB9AC;&#xC2A4;&#xD2B8;&#xC758; &#xD569;&#xACC4; &#xACC4;&#xC0B0;
const sum = (list) =&gt; list.reduce((acc, val) =&gt; acc + val, 0);
console.log(sum([1, 2, 3])); // &#xCD9C;&#xB825;: 6
</code></pre><pre><code class="language-javascript">
// &#xB9AC;&#xC2A4;&#xD2B8;&#xC758; &#xBAA8;&#xB4E0; &#xC694;&#xC18C;&#xC5D0; &#xD568;&#xC218; &#xC801;&#xC6A9;
const map = (fn, list) =&gt; list.map(fn);
const double = (x) =&gt; x * 2;
console.log(map(double, [1, 2, 3])); // &#xCD9C;&#xB825;: [2, 4, 6]
</code></pre><h3 id="4-%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%A8-%EA%B2%B0%ED%95%A9-gluing-programs-together-page-9">4. &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xACB0;&#xD569; (Gluing Programs Together) [Page 9]</h3><p>&#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C;&#xB294; &quot;&#xAC8C;&#xC73C;&#xB978; &#xD3C9;&#xAC00;&quot;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC804;&#xCCB4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xACB0;&#xD569;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xAC04;&#xC758; &#xC5C4;&#xACA9;&#xD55C; &#xB3D9;&#xAE30;&#xD654;&#xAC00; &#xAC00;&#xB2A5;&#xD558;&#xBA70;, &#xD544;&#xC694;&#xD55C; &#xB9CC;&#xD07C;&#xB9CC; &#xACC4;&#xC0B0;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xAC8C;&#xC73C;&#xB978; &#xD3C9;&#xAC00;&#xB294; &#xAC15;&#xB825;&#xD55C; &#xBAA8;&#xB4C8;&#xD654; &#xB3C4;&#xAD6C;&#xB85C; &#xC791;&#xC6A9;&#xD558;&#xBA70;, &#xC885;&#xB8CC; &#xC870;&#xAC74;&#xACFC; &#xB8E8;&#xD504; &#xBCF8;&#xBB38;&#xC744; &#xBD84;&#xB9AC;&#xD558;&#xB294; &#xB370; &#xC720;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p><h4 id="%EC%98%88%EC%A0%9C-%EC%BD%94%EB%93%9C-3">&#xC608;&#xC81C; &#xCF54;&#xB4DC;:</h4><pre><code class="language-javascript">
// &#xAC8C;&#xC73C;&#xB978; &#xD3C9;&#xAC00;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C; &#xBB34;&#xD55C; &#xC2DC;&#xD000;&#xC2A4;
const infiniteSequence = function* () {
  let i = 0;
  while (true) yield i++;
};
const take = function (n, iter) {
  const result = [];
  for (const val of iter) {
    if (result.length === n) break;
    result.push(val);
  }
  return result;
};
console.log(take(5, infiniteSequence())); // &#xCD9C;&#xB825;: [0, 1, 2, 3, 4]
</code></pre><pre><code class="language-javascript">
// &#xB450; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xACB0;&#xD569;
const double = (x) =&gt; x * 2;
const sum = (list) =&gt; list.reduce((acc, val) =&gt; acc + val, 0);
const doubleAndSum = (list) =&gt; sum(list.map(double));
console.log(doubleAndSum([1, 2, 3])); // &#xCD9C;&#xB825;: 12
</code></pre>]]></content:encoded></item><item><title><![CDATA[More What, Less How]]></title><description><![CDATA[<figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://tidyfirst.substack.com/p/more-what-less-how?ref=localhost"><div class="kg-bookmark-content"><div class="kg-bookmark-title">More What, Less How</div><div class="kg-bookmark-description">Synthetic -&gt; analytic skills</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://substackcdn.com/icons/substack/apple-touch-icon-1024x1024.png" alt><span class="kg-bookmark-author">Software Design: Tidy First?</span><span class="kg-bookmark-publisher">Kent Beck</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe7b504d6-4f2b-468c-8158-8e664f0dfbe0_950x402.png" alt></div></a></figure><p>kent back&#xC758; AI&#xC5D0; &#xB300;&#xD55C; 2023&#xB144; 4&#xC6D4; 23&#xC77C;&#xC758; &#xAE00;&#xC744; &#xA0;chatgpt&#xB97C; &#xD1B5;&#xD574; &#xC694;&#xC57D;&#xD55C; &#xB0B4;&#xC6A9;<br><br>&#xD574;&#xB2F9; &#xAE00;&#xC740; &quot;More What, Less How&</p>]]></description><link>https://blog.midagedev.com/more-what-less-how/</link><guid isPermaLink="false">64b7a5852e1df90c093717b7</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Wed, 19 Jul 2023 09:00:45 GMT</pubDate><content:encoded><![CDATA[<figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://tidyfirst.substack.com/p/more-what-less-how?ref=localhost"><div class="kg-bookmark-content"><div class="kg-bookmark-title">More What, Less How</div><div class="kg-bookmark-description">Synthetic -&gt; analytic skills</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://substackcdn.com/icons/substack/apple-touch-icon-1024x1024.png" alt><span class="kg-bookmark-author">Software Design: Tidy First?</span><span class="kg-bookmark-publisher">Kent Beck</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe7b504d6-4f2b-468c-8158-8e664f0dfbe0_950x402.png" alt></div></a></figure><p>kent back&#xC758; AI&#xC5D0; &#xB300;&#xD55C; 2023&#xB144; 4&#xC6D4; 23&#xC77C;&#xC758; &#xAE00;&#xC744; &#xA0;chatgpt&#xB97C; &#xD1B5;&#xD574; &#xC694;&#xC57D;&#xD55C; &#xB0B4;&#xC6A9;<br><br>&#xD574;&#xB2F9; &#xAE00;&#xC740; &quot;More What, Less How&quot;&#xB77C;&#xB294; &#xC81C;&#xBAA9;&#xC73C;&#xB85C;, &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xC640; &#xAE30;&#xC220;&#xC758; &#xC9C4;&#xD654;&#xC5D0; &#xB300;&#xD55C; &#xC774;&#xC57C;&#xAE30;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>1975&#xB144;, &#xC800;&#xC790;&#xC758; &#xC544;&#xBC84;&#xC9C0;&#xB294; &#xC5B4;&#xC148;&#xBE14;&#xB9AC; &#xC5B8;&#xC5B4; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB85C;&#xC11C;, C&#xC640; &#xAC19;&#xC740; &#xACE0;&#xAE09; &#xC5B8;&#xC5B4;&#xC5D0; &#xB300;&#xD55C; &#xC774;&#xC57C;&#xAE30;&#xB97C; &#xC810;&#xC810; &#xB354; &#xB9CE;&#xC774; &#xB4E3;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. C &#xC5B8;&#xC5B4;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xAC00; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xBB34;&#xC5C7;&#xC744; &#xD574;&#xC57C; &#xD558;&#xB294;&#xC9C0; &#xACB0;&#xC815;&#xD558;&#xACE0;, C &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xADF8;&#xAC83;&#xC744; &#xC218;&#xD589;&#xD560;&#xC9C0; &#xACB0;&#xC815;&#xD558;&#xB3C4;&#xB85D; &#xD574;&#xC8FC;&#xB294; &#xC57D;&#xC18D;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xD558;&#xC9C0;&#xB9CC;, &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB294; &#xC218;&#xB3D9;&#xC73C;&#xB85C; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD55C; &#xC5B4;&#xC148;&#xBE14;&#xB9AC; &#xC5B8;&#xC5B4;&#xB9CC;&#xD07C; &#xD6A8;&#xC728;&#xC801;&#xC774;&#xC9C0; &#xC54A;&#xC744; &#xAC83;&#xC774;&#xBA70;, &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC740; &#xACF5;&#xAC04;&#xC5D0; &#xC9D1;&#xC5B4;&#xB123;&#xB294; &#xB370; &#xC788;&#xC5B4; &#xC5B4;&#xC148;&#xBE14;&#xB9AC; &#xC5B8;&#xC5B4;&#xB9CC;&#xD07C; &#xB2A5;&#xB825;&#xC774; &#xC5C6;&#xC744; &#xAC83;&#xC774;&#xB77C;&#xB294; &#xC6B0;&#xB824;&#xAC00; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xAC00; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xB370; &#xAC78;&#xB9AC;&#xB294; &#xC2DC;&#xAC04;&#xC774; &#xC5B4;&#xC148;&#xBE14;&#xB7EC;&#xBCF4;&#xB2E4; &#xAE38;&#xB2E4;&#xB294; &#xBB38;&#xC81C;&#xB3C4; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC2DC;&#xAC04;&#xC774; &#xC9C0;&#xB0A8;&#xC5D0; &#xB530;&#xB77C; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB294; &#xC810;&#xC810; &#xB354; &#xB098;&#xC544;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC774;&#xB7EC;&#xD55C; &#xBCC0;&#xD654;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xAC00; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xBB34;&#xC5C7;&#xC744; &#xD574;&#xC57C; &#xD558;&#xB294;&#xC9C0; &#xB9D0;&#xD558;&#xAC8C; &#xD558;&#xACE0;, &#xBAA8;&#xB378;&#xC774; &#xADF8; &#xC791;&#xC5C5;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xC218;&#xD589;&#xD560;&#xC9C0; &#xD30C;&#xC545;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xB294; &#xB300;&#xD615; &#xC5B8;&#xC5B4; &#xBAA8;&#xB378;&#xC744; &#xC57D;&#xC18D;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xBE44;&#xC2B7;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC800;&#xC790;&#xB294; &#xC790;&#xC2E0;&#xC758; &#xAE30;&#xC220;&#xC758; 90%&#xB294; &#xC774;&#xC81C; &#xAC00;&#xCE58;&#xAC00; &#xC5C6;&#xC9C0;&#xB9CC;, &#xB0A8;&#xC740; 10%&#xB294; &#xC774;&#xC804;&#xBCF4;&#xB2E4; 1000&#xBC30; &#xAC00;&#xCE58;&#xAC00; &#xC788;&#xB2E4;&#xACE0; &#xD2B8;&#xC717;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; 90%&#xC640; 10%&#xAC00; &#xBB34;&#xC5C7;&#xC778;&#xC9C0;&#xB294; &#xD655;&#xC2E4;&#xD558;&#xC9C0; &#xC54A;&#xC9C0;&#xB9CC;, &#xBD84;&#xC11D;&#xC801; &#xAE30;&#xC220;&#xC5D0;&#xC11C; &#xCC3E;&#xC544;&#xBCFC; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xC989;, &#xBB34;&#xC5C7;&#xC744; &#xC120;&#xD0DD;&#xD560; &#xAC83;&#xC778;&#xC9C0;, &#xD53C;&#xB4DC;&#xBC31;&#xC5D0; &#xB530;&#xB77C; &#xBB34;&#xC5C7;&#xC744; &#xBCC0;&#xACBD;&#xD560; &#xAC83;&#xC778;&#xC9C0;, &#xC774;&#xC0C1;&#xD55C; &#xBE44;&#xC720;&#xB97C; &#xCC3E;&#xC544;&#xB0B4;&#xB294; &#xAC83;, &#xC544;&#xBB34;&#xB3C4; &#xC5F0;&#xACB0;&#xD574;&#xBCFC; &#xC0DD;&#xAC01;&#xC744; &#xD558;&#xC9C0; &#xC54A;&#xC740; &#xC774;&#xC0C1;&#xD55C; &#xAC83;&#xB4E4;&#xC744; &#xC5F0;&#xACB0;&#xD558;&#xB294; &#xAC83; &#xB4F1;&#xC774; &#xC911;&#xC694;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC774; &#xC0C8;&#xB85C;&#xC6B4; &#xC138;&#xC0C1;&#xC5D0;&#xC11C; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xD574;&#xACB0;&#xCC45;&#xC744; &#xCC3D;&#xCD9C;&#xD558;&#xB294; &#xD569;&#xC131;&#xC801;&#xC778; &#xAE30;&#xC220;&#xC740; &#xAC00;&#xCE58;&#xAC00; &#xB5A8;&#xC5B4;&#xC9C0;&#xC9C0;&#xB9CC;, &#xBB38;&#xC81C;&#xC640; &#xD574;&#xACB0;&#xCC45;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xAE30;&#xC220;&#xC740; &#xAC00;&#xCE58;&#xAC00; &#xD06C;&#xAC8C; &#xC0C1;&#xC2B9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC800;&#xC790;&#xC758; &#xC544;&#xBC84;&#xC9C0;&#xB294; &#xC5B4;&#xC148;&#xBE14;&#xB9AC; &#xC5B8;&#xC5B4;&#xC5D0;&#xC11C; C &#xC5B8;&#xC5B4;&#xB85C; &#xB118;&#xC5B4;&#xAC14;&#xACE0;, &#xADF8;&#xB294; &#xC5EC;&#xC804;&#xD788; &#xAC19;&#xC740; &#xC885;&#xB958;&#xC758; &#xB9C8;&#xC774;&#xD06C;&#xB85C; &#xCEE8;&#xD2B8;&#xB864;&#xB7EC; &#xCF54;&#xB4DC; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD588;&#xC9C0;&#xB9CC;, &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB294; &#xADF8;&#xAC00; &#xB354; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xC791;&#xC5C5;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB294; &apos;&#xC5B4;&#xB5BB;&#xAC8C;&apos;&#xD558;&#xB294; &#xAE30;&#xC220;&#xC744; &#xD3EC;&#xAE30;&#xD558;&#xACE0; &apos;&#xBB34;&#xC5C7;&apos;&#xC5D0; &#xB354; &#xC9D1;&#xC911;&#xD558;&#xB3C4;&#xB85D; &#xBC30;&#xC6E0;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC774; &#xC774;&#xC57C;&#xAE30;&#xC758; &#xC544;&#xC774;&#xB7EC;&#xB2C8;&#xD55C; &#xACB0;&#xB9D0;&#xC740;, &#xC800;&#xC790;&#xAC00; &#xB300;&#xD559;&#xC744; &#xC878;&#xC5C5;&#xD558;&#xACE0; &#xAC1D;&#xCCB4; &#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774; &#xB300;&#xC138;&#xAC00; &#xB418;&#xC5C8;&#xC744; &#xB54C;, &#xADF8;&#xC758; &#xC544;&#xBC84;&#xC9C0;&#xB294; &#xAC1D;&#xCCB4; &#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC774;&#xD574;&#xD558;&#xB824;&#xACE0; &#xC2DC;&#xB3C4;&#xD588;&#xC9C0;&#xB9CC; &#xC2E4;&#xD328;&#xD588;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB294; &#xB9C8;&#xC774;&#xD06C;&#xB85C; &#xCEE8;&#xD2B8;&#xB864;&#xB7EC;&#xB97C; C&#xB85C; &#xACC4;&#xC18D; &#xC791;&#xC131;&#xD588;&#xACE0;, &#xACB0;&#xAD6D; &#xC218;&#xC694;&#xAC00; &#xC0AC;&#xB77C;&#xC9C0;&#xACE0; &#xADF8;&#xB294; &#xC740;&#xD1F4;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded></item><item><title><![CDATA[시계열 예측모델 ARIMA와 LSTM]]></title><description><![CDATA[<p>ARIMA (Autoregressive Integrated Moving Average)&#xC640; LSTM (Long Short-Term Memory)&#xC740; &#xB450; &#xAC00;&#xC9C0; &#xC8FC;&#xC694; &#xC2DC;&#xACC4;&#xC5F4; &#xC608;&#xCE21; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC774; &#xB450; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC740; &#xC0AC;&#xC6A9; &#xBC29;&#xBC95;, &#xAD6C;&#xC870;, &#xADF8;&#xB9AC;&#xACE0; &#xB3D9;&#xC791; &#xBC29;</p>]]></description><link>https://blog.midagedev.com/arima-vs-lstm/</link><guid isPermaLink="false">64b690482e1df90c093717ad</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Tue, 18 Jul 2023 13:15:21 GMT</pubDate><content:encoded><![CDATA[<p>ARIMA (Autoregressive Integrated Moving Average)&#xC640; LSTM (Long Short-Term Memory)&#xC740; &#xB450; &#xAC00;&#xC9C0; &#xC8FC;&#xC694; &#xC2DC;&#xACC4;&#xC5F4; &#xC608;&#xCE21; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC774; &#xB450; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC740; &#xC0AC;&#xC6A9; &#xBC29;&#xBC95;, &#xAD6C;&#xC870;, &#xADF8;&#xB9AC;&#xACE0; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC5D0;&#xC11C; &#xAF64; &#xB9CE;&#xC740; &#xCC28;&#xC774;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ol><li><strong>&#xBAA8;&#xB378; &#xD0C0;&#xC785;</strong>: ARIMA&#xB294; &#xD1B5;&#xACC4; &#xAE30;&#xBC18;&#xC758; &#xC120;&#xD615; &#xBAA8;&#xB378;&#xC785;&#xB2C8;&#xB2E4;. &#xC2DC;&#xACC4;&#xC5F4;&#xC758; &#xD328;&#xD134;&#xC744; &#xC778;&#xC2DD;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBBF8;&#xB798; &#xAC12;&#xC744; &#xC608;&#xCE21;&#xD558;&#xB294;&#xB370;, &#xC790;&#xAE30; &#xC0C1;&#xAD00;&#xC131;&#xC774; &#xC788;&#xB294; &#xC120;&#xD615; &#xC2DC;&#xACC4;&#xC5F4; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xC801;&#xD569;&#xD569;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74;&#xC5D0; LSTM&#xC740; &#xC778;&#xACF5;&#xC2E0;&#xACBD;&#xB9DD;&#xC758; &#xD55C; &#xC885;&#xB958;&#xB85C;, &#xBE44;&#xC120;&#xD615; &#xD328;&#xD134;&#xC744; &#xD559;&#xC2B5;&#xD558;&#xACE0; &#xBCF5;&#xC7A1;&#xD55C; &#xC2DC;&#xACC4;&#xC5F4; &#xB370;&#xC774;&#xD130;&#xC5D0;&#xC11C; &#xB354;&#xC6B1; &#xD6A8;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xC791;&#xB3D9;&#xD569;&#xB2C8;&#xB2E4;.</li><li><strong>&#xC2DC;&#xAC04; &#xC758;&#xC874;&#xC131;</strong>: ARIMA&#xB294; &#xACE0;&#xC815;&#xB41C; &#xC2DC;&#xAC04; &#xCC3D;(window) &#xB0B4;&#xC5D0;&#xC11C;&#xB9CC; &#xC758;&#xC874;&#xC131;&#xC744; &#xC778;&#xC2DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, &#xCC3D;&#xC758; &#xD06C;&#xAE30;&#xAC00; &#xB108;&#xBB34; &#xCEE4;&#xC9C0;&#xBA74; &#xBAA8;&#xB378;&#xC758; &#xC131;&#xB2A5;&#xC774; &#xC800;&#xD558;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74;&#xC5D0; LSTM&#xC740; &quot;&#xC7A5;&#xAE30; &#xC758;&#xC874;&#xC131;&quot; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC124;&#xACC4;&#xB418;&#xC5C8;&#xC73C;&#xBA70;, &#xC7A5;&#xAE30;&#xC801;&#xC778; &#xC758;&#xC874;&#xC131;&#xC744; &#xAC00;&#xC9C4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xB370; &#xB354;&#xC6B1; &#xC720;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.</li><li><strong>&#xB370;&#xC774;&#xD130; &#xC804;&#xCC98;&#xB9AC;</strong>: ARIMA&#xB294; &#xC815;&#xC0C1; &#xC0C1;&#xD0DC;&#xC758; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD544;&#xC694;&#xB85C; &#xD569;&#xB2C8;&#xB2E4;. &#xC989;, &#xB370;&#xC774;&#xD130;&#xAC00; &#xC77C;&#xC815;&#xD55C; &#xD3C9;&#xADE0;&#xACFC; &#xBD84;&#xC0B0;&#xC744; &#xAC00;&#xC838;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC704;&#xD574; &#xC885;&#xC885; &#xCC28;&#xBD84;(differencing)&#xC774;&#xB098; &#xBCC0;&#xD658;(transformation)&#xACFC; &#xAC19;&#xC740; &#xC804;&#xCC98;&#xB9AC; &#xB2E8;&#xACC4;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. LSTM&#xC740; &#xC774;&#xB7EC;&#xD55C; &#xC804;&#xCC98;&#xB9AC; &#xACFC;&#xC815;&#xC774; &#xD544;&#xC218;&#xC801;&#xC774;&#xC9C0;&#xB294; &#xC54A;&#xC9C0;&#xB9CC;, &#xC885;&#xC885; &#xB370;&#xC774;&#xD130;&#xC758; &#xC2A4;&#xCF00;&#xC77C;&#xB9C1;&#xC774; &#xD544;&#xC694;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li><strong>&#xD559;&#xC2B5; &#xC2DC;&#xAC04;</strong>: LSTM&#xC740; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; ARIMA&#xBCF4;&#xB2E4; &#xD559;&#xC2B5; &#xC2DC;&#xAC04;&#xC774; &#xB354; &#xAE38;&#xB2E4;. LSTM&#xC740; &#xBE44;&#xC120;&#xD615;&#xC801;&#xC778; &#xD2B9;&#xC9D5;&#xC744; &#xD559;&#xC2B5;&#xD558;&#xACE0;, &#xC774;&#xB97C; &#xC704;&#xD574; &#xB354; &#xB9CE;&#xC740; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB97C; &#xD559;&#xC2B5;&#xD574;&#xC57C; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</li><li><strong>&#xD574;&#xC11D; &#xAC00;&#xB2A5;&#xC131;</strong>: ARIMA &#xBAA8;&#xB378;&#xC758; &#xC7A5;&#xC810; &#xC911; &#xD558;&#xB098;&#xB294; &#xADF8; &#xACB0;&#xACFC;&#xB97C; &#xD574;&#xC11D;&#xD558;&#xB294; &#xB370; &#xC788;&#xC5B4;&#xC11C;&#xC758; &#xBA85;&#xD655;&#xC131;&#xC785;&#xB2C8;&#xB2E4;. ARIMA &#xBAA8;&#xB378;&#xC758; &#xACC4;&#xC218;&#xB294; &#xD1B5;&#xACC4;&#xC801;&#xC73C;&#xB85C; &#xC758;&#xBBF8;&#xB97C; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74;&#xC5D0; LSTM&#xC740; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &apos;&#xBE14;&#xB799;&#xBC15;&#xC2A4;&apos; &#xBAA8;&#xB378;&#xB85C; &#xC5EC;&#xACA8;&#xC9C0;&#xBA70;, &#xC774;&#xB294; &#xADF8;&#xB4E4;&#xC758; &#xB0B4;&#xBD80; &#xC791;&#xB3D9; &#xBC29;&#xC2DD;&#xC744; &#xC774;&#xD574;&#xD558;&#xAC70;&#xB098; &#xC124;&#xBA85;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC5B4;&#xB835;&#xB2E4;&#xB294; &#xC758;&#xBBF8;&#xC785;&#xB2C8;&#xB2E4;.</li></ol><p>&#xC774;&#xB7EC;&#xD55C; &#xCC28;&#xC774;&#xC810;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0;, ARIMA&#xC640; LSTM &#xBAA8;&#xB450; &#xC2DC;&#xACC4;&#xC5F4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB2E4;&#xB8E8;&#xB294; &#xB370; &#xC720;&#xC6A9;&#xD55C; &#xB3C4;&#xAD6C;&#xC785;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB5A4; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC774; &#xAC00;&#xC7A5; &#xC801;&#xD569;&#xD55C;&#xC9C0;&#xB294; &#xBB38;&#xC81C;&#xC758; &#xD2B9;&#xC131;, &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xB370;&#xC774;&#xD130;, &#xADF8;&#xB9AC;&#xACE0; &#xD2B9;&#xC815; &#xC791;&#xC5C5;&#xC5D0; &#xB300;&#xD55C; &#xC694;&#xAD6C; &#xC0AC;&#xD56D;&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9D1;&#xB2C8;&#xB2E4;.</p>]]></content:encoded></item><item><title><![CDATA[django viewset에서 create와 perform_create의 차이]]></title><description><![CDATA[<p><code>Django REST Framework</code>&#xC5D0;&#xC11C; <code>ViewSet</code>&#xC740; API &#xB85C;&#xC9C1;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. <code>ViewSet</code>&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC8FC;&#xC694; &#xBA54;&#xC11C;&#xB4DC; &#xC911; &#xB450; &#xAC00;&#xC9C0;&#xC778; <code>create</code>&#xC640; <code>perform_create</code>&#xC5D0;&#xB294; &#xBA85;&#xD655;&#xD55C; &#xCC28;</p>]]></description><link>https://blog.midagedev.com/django-preform-create/</link><guid isPermaLink="false">64b68ed82e1df90c09371795</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Tue, 18 Jul 2023 13:11:40 GMT</pubDate><content:encoded><![CDATA[<p><code>Django REST Framework</code>&#xC5D0;&#xC11C; <code>ViewSet</code>&#xC740; API &#xB85C;&#xC9C1;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. <code>ViewSet</code>&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC8FC;&#xC694; &#xBA54;&#xC11C;&#xB4DC; &#xC911; &#xB450; &#xAC00;&#xC9C0;&#xC778; <code>create</code>&#xC640; <code>perform_create</code>&#xC5D0;&#xB294; &#xBA85;&#xD655;&#xD55C; &#xCC28;&#xC774;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li><code>create</code>&#xB294; <code>POST</code> &#xC694;&#xCCAD;&#xC774; &#xB4E4;&#xC5B4;&#xC654;&#xC744; &#xB54C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xBDF0;&#xC758; &#xB85C;&#xC9C1;&#xC785;&#xB2C8;&#xB2E4;. <code>request</code> &#xAC1D;&#xCCB4;&#xB97C; &#xBC1B;&#xC544; &#xD574;&#xB2F9; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC0C8;&#xB85C;&#xC6B4; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0;, &#xC751;&#xB2F5;&#xC744; &#xB9AC;&#xD134;&#xD558;&#xB294; &#xB85C;&#xC9C1;&#xC744; &#xD3EC;&#xD568;&#xD569;&#xB2C8;&#xB2E4;. <code>create</code> &#xBA54;&#xC11C;&#xB4DC;&#xB294; API &#xC694;&#xCCAD;&#xC5D0; &#xB300;&#xD55C; &#xC804;&#xCCB4;&#xC801;&#xC778; &#xD750;&#xB984;&#xC744; &#xB2F4;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</li><li>&#xBC18;&#xBA74;, <code>perform_create</code>&#xB294; <code>create</code>&#xAC00; &#xC9C4;&#xD589;&#xB418;&#xB294; &#xACFC;&#xC815; &#xC911;, &#xC2E4;&#xC81C;&#xB85C; &#xC0C8;&#xB85C;&#xC6B4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. <code>perform_create</code> &#xBA54;&#xC11C;&#xB4DC;&#xC5D0;&#xB294; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C; <code>request</code> &#xAC1D;&#xCCB4;&#xB97C; &#xB118;&#xACA8;&#xBC1B;&#xC9C0; &#xC54A;&#xACE0;, <code>create</code>&#xB85C;&#xBD80;&#xD130; &#xC804;&#xB2EC;&#xBC1B;&#xC740; serializer&#xC640; <code>validated_data</code>&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</li></ul><p>&#xC989;, <code>create</code> &#xBA54;&#xC11C;&#xB4DC;&#xAC00; &#xC804;&#xCCB4;&#xC801;&#xC778; &#xC0DD;&#xC131; &#xD750;&#xB984;&#xC744; &#xB2F4;&#xB2F9;&#xD558;&#xB294; &#xBC18;&#xBA74;, <code>perform_create</code>&#xB294; &#xADF8; &#xACFC;&#xC815; &#xC911; &#xB370;&#xC774;&#xD130; &#xC800;&#xC7A5;&#xC5D0; &#xC9D1;&#xC911;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC774;&#xB7EC;&#xD55C; &#xAD6C;&#xC870;&#xB294; &#xCF54;&#xB4DC;&#xC758; &#xBAA8;&#xB4C8;&#xD654;&#xC640; &#xC7AC;&#xC0AC;&#xC6A9;&#xC131;&#xC744; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0A4;&#xBA70;, &#xD544;&#xC694;&#xC5D0; &#xB530;&#xB77C; <code>perform_create</code>&#xB97C; &#xC624;&#xBC84;&#xB77C;&#xC774;&#xB4DC;&#xD558;&#xBA74; <code>create</code> &#xBA54;&#xC11C;&#xB4DC;&#xC758; &#xD750;&#xB984;&#xC740; &#xADF8;&#xB300;&#xB85C; &#xC720;&#xC9C0;&#xD558;&#xBA74;&#xC11C; &#xB370;&#xC774;&#xD130; &#xC800;&#xC7A5; &#xBC29;&#xC2DD;&#xB9CC;&#xC744; &#xBCC0;&#xACBD;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xC720;&#xC5F0;&#xD55C; &#xCEE4;&#xC2A4;&#xD130;&#xB9C8;&#xC774;&#xC9D5;&#xC744; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;.</p><pre><code class="language-python">from rest_framework import viewsets, status
from rest_framework.response import Response
from .serializers import YourModelSerializer
from .models import YourModel

class YourModelViewSet(viewsets.ModelViewSet):
    queryset = YourModel.objects.all()
    serializer_class = YourModelSerializer

    def create(self, request, *args, **kwargs):
        serializer = self.get_serializer(data=request.data)
        if serializer.is_valid(raise_exception=True):
            self.perform_create(serializer)
            return Response(serializer.data, status=status.HTTP_201_CREATED)

    def perform_create(self, serializer):
        # &#xC5EC;&#xAE30;&#xC5D0;&#xC11C; &#xC2E4;&#xC81C;&#xB85C; &#xBAA8;&#xB378; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.
        serializer.save()
</code></pre><p>&#xC704; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; <code>create</code> &#xBA54;&#xC11C;&#xB4DC;&#xC5D0;&#xC11C; &#xBA3C;&#xC800; &#xC694;&#xCCAD;&#xB41C; &#xB370;&#xC774;&#xD130;(<code>request.data</code>)&#xB97C; serializer&#xB97C; &#xD1B5;&#xD574; &#xAC80;&#xC99D;(<code>is_valid()</code>)&#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xAC80;&#xC99D;&#xC774; &#xC131;&#xACF5;&#xD558;&#xBA74;, <code>perform_create</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xD1B5;&#xD574; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC2E4;&#xC81C;&#xB85C; &#xC800;&#xC7A5;&#xD558;&#xACE0;, &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xC0DD;&#xC131;&#xB418;&#xC5C8;&#xB2E4;&#xB294; &#xC751;&#xB2F5;&#xC744; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;.</p><p><code>perform_create</code>&#xB294; serializer&#xC758; <code>save</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC5EC; &#xC2E4;&#xC81C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. &#xD544;&#xC694;&#xC5D0; &#xB530;&#xB77C; &#xC774; &#xBD80;&#xBD84;&#xC744; &#xC624;&#xBC84;&#xB77C;&#xC774;&#xB4DC;&#xD558;&#xC5EC; &#xD2B9;&#xC815; &#xB85C;&#xC9C1;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xAC70;&#xB098; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded></item><item><title><![CDATA[commonjs is not going away]]></title><description><![CDATA[<p><a href="https://blog.midagedev.com/commonjs-is-hurting-javascript/?ref=localhost">&#xC55E;&#xC11C; deno&#xC758; &#xAE00;</a>&#xACFC;&#xB294; &#xC0C1;&#xBC18;&#xB41C; &#xC785;&#xC7A5;&#xC758; <a href="https://bun.sh/blog/commonjs-is-not-going-away?ref=localhost">bun&#xC758; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; &#xC62C;&#xB77C;&#xC628; &#xAE00;</a> &#xC694;&#xC57D; from chatgpt</p><p>&quot;CommonJS is not going away&quot;&#xB77C;&#xB294; &#xC81C;&#xBAA9;&#xC758; &#xAE30;&#xC0AC;&#xB294; CommonJS&#xAC00; &#xC5EC;&#xC804;&#xD788; &#xC720;&#xC9C0;&#xB420;</p>]]></description><link>https://blog.midagedev.com/commonjs-is-not-going-away/</link><guid isPermaLink="false">64b177132e1df90c09371784</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Fri, 14 Jul 2023 16:27:18 GMT</pubDate><content:encoded><![CDATA[<p><a href="https://blog.midagedev.com/commonjs-is-hurting-javascript/?ref=localhost">&#xC55E;&#xC11C; deno&#xC758; &#xAE00;</a>&#xACFC;&#xB294; &#xC0C1;&#xBC18;&#xB41C; &#xC785;&#xC7A5;&#xC758; <a href="https://bun.sh/blog/commonjs-is-not-going-away?ref=localhost">bun&#xC758; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; &#xC62C;&#xB77C;&#xC628; &#xAE00;</a> &#xC694;&#xC57D; from chatgpt</p><p>&quot;CommonJS is not going away&quot;&#xB77C;&#xB294; &#xC81C;&#xBAA9;&#xC758; &#xAE30;&#xC0AC;&#xB294; CommonJS&#xAC00; &#xC5EC;&#xC804;&#xD788; &#xC720;&#xC9C0;&#xB420; &#xAC83;&#xC774;&#xBA70;, &#xC774;&#xB294; &#xAD1C;&#xCC2E;&#xC740; &#xC77C;&#xC774;&#xB77C;&#xACE0; &#xB9D0;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. CommonJS&#xB294; 2009&#xB144;&#xC5D0; &#xAC1C;&#xBC1C;&#xB418;&#xC5B4; Node.js&#xC5D0; &#xC758;&#xD574; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBAA8;&#xB4C8; &#xD615;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74; ECMAScript &#xBAA8;&#xB4C8;(ES &#xBAA8;&#xB4C8;)&#xC740; 2015&#xB144;&#xC5D0; &#xB3C4;&#xC785;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. ES &#xBAA8;&#xB4C8;&#xC740; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC5D0;&#xC11C; &#xC791;&#xB3D9;&#xD558;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB418;&#xC5C8;&#xC73C;&#xBA70;, &#xD30C;&#xC77C;&#xC774; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xD1B5;&#xD574; &#xB85C;&#xB4DC;&#xB41C;&#xB2E4;&#xB294; &#xC810;&#xC5D0;&#xC11C; &#xBE44;&#xB3D9;&#xAE30;&#xC801;&#xC785;&#xB2C8;&#xB2E4;.</p><p>CommonJS&#xC758; &#xC7A5;&#xC810; &#xC911; &#xD558;&#xB098;&#xB294; &#xB354; &#xBE60;&#xB978; &#xC2DC;&#xC791; &#xC2DC;&#xAC04;&#xC785;&#xB2C8;&#xB2E4;. &#xD070; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xACBD;&#xC6B0; ES &#xBAA8;&#xB4C8;&#xBCF4;&#xB2E4; CommonJS&#xAC00; &#xB354; &#xBE60;&#xB974;&#xAC8C; &#xC2DC;&#xC791;&#xB429;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; CommonJS&#xB294; &#xB3D9;&#xC801; &#xBAA8;&#xB4C8; &#xB85C;&#xB529;&#xC744; &#xD5C8;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD50C;&#xB7EC;&#xADF8;&#xC778; &#xC2DC;&#xC2A4;&#xD15C;&#xC774;&#xB098; &#xC0AC;&#xC6A9;&#xC790; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xC5D0; &#xAE30;&#xBC18;&#xD55C; &#xD2B9;&#xC815; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xC758; &#xC9C0;&#xC5F0; &#xB85C;&#xB529;&#xACFC; &#xAC19;&#xC740; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xC5D0;&#xC11C; &#xC720;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xB610;&#xD55C; npm&#xC5D0; &#xC774;&#xBBF8; &#xC218;&#xBC31;&#xB9CC; &#xAC1C;&#xC758; CommonJS &#xBAA8;&#xB4C8;&#xC774; &#xAC8C;&#xC2DC;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70;, &#xC774; &#xC911; &#xB9CE;&#xC740; &#xBAA8;&#xB4C8;&#xC740; &#xB354; &#xC774;&#xC0C1; &#xD65C;&#xBC1C;&#xD788; &#xC720;&#xC9C0;&#xB418;&#xC9C0; &#xC54A;&#xC9C0;&#xB9CC; &#xAE30;&#xC874; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xB9E4;&#xC6B0; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xBAA8;&#xB4E0; &#xD328;&#xD0A4;&#xC9C0;&#xAC00; ES &#xBAA8;&#xB4C8;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB3C4;&#xB85D; &#xAE30;&#xB300;&#xD560; &#xC218;&#xB294; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Bun&#xC740; &#xCD5C;&#xADFC; &#xBC84;&#xC804;&#xC5D0;&#xC11C; CommonJS&#xB97C; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xAD6C;&#xD604;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70;, CommonJS &#xD30C;&#xC77C;&#xC744; &#xD2B9;&#xBCC4;&#xD55C; &quot;&#xB3D9;&#xAE30;&#xC2DD; ESM&quot; &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xBCC0;&#xD658;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, Bun&#xC740; &#xCD5C;&#xADFC;&#xC5D0; __esModule &#xC8FC;&#xC11D;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC744; &#xCD94;&#xAC00;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; CommonJS &#xBAA8;&#xB4C8;&#xC774; exports.default&#xB97C; &#xAE30;&#xBCF8; &#xB0B4;&#xBCF4;&#xB0B4;&#xAE30;&#xB85C; &#xD574;&#xC11D;&#xD574;&#xC57C; &#xD568;&#xC744; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xBE44;&#xACF5;&#xC2DD;&#xC801;&#xC778; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xACB0;&#xB860;&#xC801;&#xC73C;&#xB85C;, CommonJS&#xB294; &#xC774;&#xBBF8; &#xC5EC;&#xAE30;&#xC5D0; &#xC788;&#xC73C;&#xBA70; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xC774;&#xC720;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Bun&#xC740; CommonJS&#xB97C; &#xC911;&#xC694;&#xD558;&#xAC8C; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70;, &#xC774;&#xB97C; &#xD604;&#xB300;&#xC801;&#xC778; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC9C0;&#xC6D0;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded></item><item><title><![CDATA[commonjs is hurting javascript]]></title><description><![CDATA[<p><a href="https://deno.com/blog/commonjs-is-hurting-javascript?ref=localhost">deno&#xC5D0;&#xC11C; &#xC791;&#xC131;&#xD55C; commonjs&#xAC00; &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xC0DD;&#xD0DC;&#xACC4;&#xC5D0; &#xC545;&#xC601;&#xD5A5;&#xC744; &#xC900;&#xB2E4;&#xB294; &#xB0B4;&#xC6A9;&#xC758; &#xBE14;&#xB85C;&#xADF8; &#xAE00;</a>&#xC5D0; &#xB300;&#xD55C; &#xC694;&#xC57D; from chatgpt</p><p>&quot;CommonJS is hurting JavaScript&quot;&#xB77C;&#xB294; &#xC81C;&#xBAA9;&#xC758;</p>]]></description><link>https://blog.midagedev.com/commonjs-is-hurting-javascript/</link><guid isPermaLink="false">64b175332e1df90c09371753</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Fri, 14 Jul 2023 16:22:43 GMT</pubDate><content:encoded><![CDATA[<p><a href="https://deno.com/blog/commonjs-is-hurting-javascript?ref=localhost">deno&#xC5D0;&#xC11C; &#xC791;&#xC131;&#xD55C; commonjs&#xAC00; &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xC0DD;&#xD0DC;&#xACC4;&#xC5D0; &#xC545;&#xC601;&#xD5A5;&#xC744; &#xC900;&#xB2E4;&#xB294; &#xB0B4;&#xC6A9;&#xC758; &#xBE14;&#xB85C;&#xADF8; &#xAE00;</a>&#xC5D0; &#xB300;&#xD55C; &#xC694;&#xC57D; from chatgpt</p><p>&quot;CommonJS is hurting JavaScript&quot;&#xB77C;&#xB294; &#xC81C;&#xBAA9;&#xC758; &#xAE30;&#xC0AC;&#xB294; JavaScript&#xC758; &#xBC1C;&#xC804;&#xC744; &#xC800;&#xD574;&#xD558;&#xB294; &#xC694;&#xC778;&#xC73C;&#xB85C; CommonJS &#xBAA8;&#xB4C8; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xC9C0;&#xBAA9;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC694;&#xC57D;&#xD558;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li>JavaScript&#xB294; &#xC6F9; &#xAC1C;&#xBC1C;&#xC5D0;&#xC11C; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC5B8;&#xC5B4;&#xB85C;, &#xADF8;&#xB7EC;&#xB098; &#xACFC;&#xAC70;&#xC758; &#xC720;&#xC0B0;&#xC778; CommonJS&#xB85C; &#xC778;&#xD574; &#xBC1C;&#xC804;&#xC774; &#xC800;&#xD574;&#xB418;&#xACE0; &#xC788;&#xB2E4;.</li><li>CommonJS&#xB294; &#xC57D; 15&#xB144; &#xC804;&#xC5D0; JavaScript&#xAC00; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB97C; &#xB118;&#xC5B4; &#xC11C;&#xBC84; &#xCE21;&#xC73C;&#xB85C; &#xD655;&#xC7A5;&#xB418;&#xBA74;&#xC11C; &#xB4F1;&#xC7A5;&#xD588;&#xB2E4;. &#xB2F9;&#xC2DC; JavaScript&#xB294; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xB354; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xAD00;&#xB9AC;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC5C8;&#xACE0;, &#xC774;&#xB97C; &#xC704;&#xD574; &#xBAA8;&#xB4C8;&#xD654;&#xAC00; &#xD544;&#xC694;&#xD588;&#xB2E4;.</li><li>CommonJS&#xB294; Node.js&#xC758; &#xBAA8;&#xB4C8; &#xC2DC;&#xC2A4;&#xD15C;&#xC73C;&#xB85C; &#xCC44;&#xD0DD;&#xB418;&#xC5C8;&#xC73C;&#xBA70;, <code>require()</code>, <code>module.exports</code> &#xB4F1;&#xC758; &#xBB38;&#xBC95;&#xC744; &#xC81C;&#xACF5;&#xD588;&#xB2E4;. &#xC774;&#xB294; &#xC11C;&#xBC84; &#xCE21; &#xCF54;&#xB4DC;&#xC640; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xCE21; &#xCF54;&#xB4DC;&#xC758; &#xC694;&#xAD6C; &#xC0AC;&#xD56D;&#xC774; &#xB2E4;&#xB974;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC778;&#xC2DD;&#xD55C; &#xACB0;&#xACFC;&#xC600;&#xB2E4;.</li><li>&#xADF8;&#xB7EC;&#xB098; CommonJS&#xC5D0;&#xB294; &#xBA87; &#xAC00;&#xC9C0; &#xBB38;&#xC81C;&#xC810;&#xC774; &#xC788;&#xC5C8;&#xB2E4;. &#xBAA8;&#xB4C8; &#xB85C;&#xB529;&#xC774; &#xB3D9;&#xAE30;&#xC2DD;&#xC774;&#xC5C8;&#xACE0;, &#xD2B8;&#xB9AC; &#xC250;&#xC774;&#xD0B9;(tree shaking)&#xC774; &#xC5B4;&#xB824;&#xC6CC; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xBAA8;&#xB4C8;&#xC744; &#xC81C;&#xAC70;&#xD558;&#xB294;&#xB370; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xC5C8;&#xB2E4;. &#xB610;&#xD55C; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC640; &#xB124;&#xC774;&#xD2F0;&#xBE0C;&#xB85C; &#xD638;&#xD658;&#xB418;&#xC9C0; &#xC54A;&#xC544; &#xBC88;&#xB4E4;&#xB7EC;&#xC640; &#xD2B8;&#xB79C;&#xC2A4;&#xD30C;&#xC77C;&#xB7EC;&#xAC00; &#xD544;&#xC694;&#xD588;&#xB2E4;.</li><li>2013&#xB144;&#xACBD;, TC39 &#xC704;&#xC6D0;&#xD68C;&#xB294; CommonJS &#xBAA8;&#xB4C8;&#xC758; &#xD6C4;&#xC18D; &#xBC84;&#xC804;&#xC73C;&#xB85C; ECMAScript &#xBAA8;&#xB4C8;(ESM)&#xC744; &#xAC1C;&#xBC1C;&#xD558;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xB2E4;. ESM&#xC740; &#xC6F9;&#xC744; &#xC704;&#xD574; &#xCD5C;&#xC801;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70;, &#xBE44;&#xB3D9;&#xAE30; &#xBAA8;&#xB4C8; &#xB85C;&#xB529;, &#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xD638;&#xD658;&#xC131;, &#xC815;&#xC801; &#xBD84;&#xC11D;, &#xD2B8;&#xB9AC; &#xC250;&#xC774;&#xD0B9; &#xB4F1;&#xC744; &#xC9C0;&#xC6D0;&#xD55C;&#xB2E4;.</li><li>Node.js&#xB294; CommonJS&#xC640; ESM&#xC744; &#xBAA8;&#xB450; &#xC9C0;&#xC6D0;&#xD558;&#xAE30;&#xB85C; &#xACB0;&#xC815;&#xD588;&#xC73C;&#xB098;, &#xB450; &#xC2DC;&#xC2A4;&#xD15C; &#xAC04;&#xC758; &#xC0C1;&#xD638; &#xC6B4;&#xC6A9;&#xC131;&#xC5D0; &#xB300;&#xD55C; &#xBA85;&#xD655;&#xD55C; &#xD569;&#xC758;&#xC5D0;&#xB294; &#xB3C4;&#xB2EC;&#xD558;&#xC9C0; &#xBABB;&#xD588;&#xB2E4;.</li><li>&#xAE30;&#xC0AC;&#xB294; 2023&#xB144; &#xD604;&#xC7AC;, CommonJS&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xAC83;&#xC774; &#xB354; &#xC774;&#xC0C1; &#xBB34;&#xC2DC;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xB418;&#xC5C8;&#xC73C;&#xBA70;, ESM&#xC73C;&#xB85C; &#xC644;&#xC804;&#xD788; &#xC804;&#xD658;&#xD560; &#xC2DC;&#xC810;&#xC774;&#xB77C;&#xACE0; &#xC8FC;&#xC7A5;&#xD55C;&#xB2E4;. ESM&#xC740; &#xAC1C;&#xBC1C;&#xC790;&#xC5D0;&#xAC8C; &#xB354; &#xB098;&#xC740; &#xC194;&#xB8E8;&#xC158;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xBA70;, &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C;&#xB3C4; &#xB354; &#xB098;&#xC740; &#xACBD;&#xD5D8;&#xC744; &#xC81C;&#xACF5;&#xD55C;&#xB2E4;.</li></ul><hr><h2 id="commonjs%EC%99%80-esm%EC%9D%98-%EB%B9%84%EA%B5%90">commonjs&#xC640; esm&#xC758; &#xBE44;&#xAD50;</h2><p>CommonJS&#xC640; ECMAScript Modules(ESM)&#xC740; JavaScript &#xBAA8;&#xB4C8; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xB450; &#xAC00;&#xC9C0; &#xC8FC;&#xC694; &#xD615;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;. &#xAC01;&#xAC01;&#xC758; &#xD2B9;&#xC9D5;&#xACFC; &#xCC28;&#xC774;&#xC810;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><strong>&#xC815;&#xC758; &#xBC29;&#xC2DD;</strong>:</p><ul><li><strong>CommonJS</strong>: <code>module.exports</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBAA8;&#xB4C8;&#xC744; &#xB0B4;&#xBCF4;&#xB0B4;&#xACE0;, <code>require()</code> &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBAA8;&#xB4C8;&#xC744; &#xAC00;&#xC838;&#xC635;&#xB2C8;&#xB2E4;.</li></ul><pre><code class="language-javascript">// math.js
module.exports = {
  add: (a, b) =&gt; a + b,
  subtract: (a, b) =&gt; a - b
};

// app.js
const math = require(&apos;./math.js&apos;);</code></pre><ul><li><strong>ESM</strong>: <code>export</code> &#xD0A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBAA8;&#xB4C8;&#xC744; &#xB0B4;&#xBCF4;&#xB0B4;&#xACE0;, <code>import</code> &#xD0A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBAA8;&#xB4C8;&#xC744; &#xAC00;&#xC838;&#xC635;&#xB2C8;&#xB2E4;.</li></ul><pre><code class="language-javascript">// math.js
export const add = (a, b) =&gt; a + b;
export const subtract = (a, b) =&gt; a - b;

// app.js
import { add, subtract } from &apos;./math.js&apos;;</code></pre><p><strong>&#xB85C;&#xB529; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;</strong>:</p><ul><li><strong>CommonJS</strong>: &#xB3D9;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xBAA8;&#xB4C8;&#xC744; &#xB85C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC11C;&#xBC84; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC801;&#xD569;&#xD558;&#xC9C0;&#xB9CC;, &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC5D0;&#xC11C;&#xB294; &#xC131;&#xB2A5; &#xBB38;&#xC81C;&#xB97C; &#xC77C;&#xC73C;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li><strong>ESM</strong>: &#xBE44;&#xB3D9;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xBAA8;&#xB4C8;&#xC744; &#xB85C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xB354; &#xD6A8;&#xC728;&#xC801;&#xC785;&#xB2C8;&#xB2E4;.</li></ul><p><strong>&#xD638;&#xD658;&#xC131;</strong>:</p><ul><li><strong>CommonJS</strong>: Node.js&#xC5D0;&#xC11C; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xBA70;, &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC5D0;&#xC11C;&#xB294; &#xBC88;&#xB4E4;&#xB7EC;(&#xC608;: webpack)&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBCC0;&#xD658;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</li><li><strong>ESM</strong>: &#xCD5C;&#xC2E0; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC5D0;&#xC11C; &#xC9C1;&#xC811; &#xC9C0;&#xC6D0;&#xB418;&#xBA70;, Node.js&#xC5D0;&#xC11C;&#xB3C4; &#xC9C0;&#xC6D0;&#xB429;&#xB2C8;&#xB2E4;.</li></ul><p><strong>&#xC815;&#xC801; &#xBD84;&#xC11D;&#xACFC; &#xCD5C;&#xC801;&#xD654;</strong>:</p><ul><li><strong>CommonJS</strong>: &#xB7F0;&#xD0C0;&#xC784;&#xC5D0; &#xBAA8;&#xB4C8; &#xAD6C;&#xC870;&#xB97C; &#xD574;&#xC11D;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC774; &#xC5B4;&#xB835;&#xACE0;, &#xD2B8;&#xB9AC; &#xC250;&#xC774;&#xD0B9;&#xACFC; &#xAC19;&#xC740; &#xCD5C;&#xC801;&#xD654; &#xAE30;&#xBC95;&#xC744; &#xC801;&#xC6A9;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li><strong>ESM</strong>: &#xBAA8;&#xB4C8; &#xAD6C;&#xC870;&#xAC00; &#xC815;&#xC801;&#xC774;&#xBBC0;&#xB85C; &#xBE4C;&#xB4DC; &#xD0C0;&#xC784;&#xC5D0; &#xBD84;&#xC11D;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACE0;, &#xD2B8;&#xB9AC; &#xC250;&#xC774;&#xD0B9;&#xACFC; &#xAC19;&#xC740; &#xCD5C;&#xC801;&#xD654; &#xAE30;&#xBC95;&#xC744; &#xC801;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul><p><strong>&#xC0C1;&#xD638; &#xC6B4;&#xC6A9;&#xC131;</strong>:</p><ul><li><strong>CommonJS</strong>: ESM&#xACFC; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xD638;&#xD658;&#xB418;&#xC9C0; &#xC54A;&#xC73C;&#xBA70;, &#xBCC0;&#xD658; &#xB2E8;&#xACC4;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</li><li><strong>ESM</strong>: &#xCD5C;&#xC2E0; Node.js &#xBC84;&#xC804;&#xC5D0;&#xC11C;&#xB294; CommonJS &#xBAA8;&#xB4C8;&#xC744; &#xAC00;&#xC838;&#xC62C; &#xC218; &#xC788;&#xC73C;&#xB098;, &#xC77C;&#xBD80; &#xC81C;&#xC57D; &#xC0AC;&#xD56D;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</li></ul><p><strong>&#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC640; &#xCC44;&#xD0DD;</strong>:</p><ul><li><strong>CommonJS</strong>: &#xACFC;&#xAC70;&#xC5D0; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xC5C8;&#xC73C;&#xB098;, &#xD604;&#xC7AC;&#xB294; &#xC810;&#xCC28; ESM&#xC73C;&#xB85C; &#xC774;&#xB3D9;&#xD558;&#xB294; &#xCD94;&#xC138;&#xC785;&#xB2C8;&#xB2E4;.</li><li><strong>ESM</strong>: &#xD604;&#xB300;&#xC801;&#xC778; JavaScript &#xAC1C;&#xBC1C;&#xC5D0; &#xAD8C;&#xC7A5;&#xB418;&#xBA70;, &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC640; &#xC0C8;&#xB85C;&#xC6B4; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC5D0;&#xC11C; &#xB110;&#xB9AC; &#xCC44;&#xD0DD;&#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul><p>&#xACB0;&#xB860;&#xC801;&#xC73C;&#xB85C;, ESM&#xC740; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC640; &#xC11C;&#xBC84; &#xBAA8;&#xB450;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30;&#xC5D0; &#xB354; &#xC801;&#xD569;&#xD558;&#xBA70;, &#xCD5C;&#xC801;&#xD654; &#xAE30;&#xBC95;&#xACFC; &#xB354; &#xB098;&#xC740; &#xBB38;&#xBC95;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. CommonJS&#xB294; &#xC5EC;&#xC804;&#xD788; &#xB9CE;&#xC740; &#xB808;&#xAC70;&#xC2DC; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC640; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xC9C0;&#xB9CC;, &#xC0C8;&#xB85C;&#xC6B4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; ESM&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded></item><item><title><![CDATA[ghost + cloudflare pages로 블로그 셋팅]]></title><description><![CDATA[<p>cloudflare&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xD55C;&#xC2DC;&#xAC04;&#xB9CC;&#xC5D0; &#xB3C4;&#xBA54;&#xC778;+&#xD638;&#xC2A4;&#xD305;+&#xBC30;&#xD3EC;+&#xC5B4;&#xB0BC;&#xB9AC;&#xD2F1;&#xC2A4; &#xC2F9; &#xBD99;&#xC778; &#xCDA9;&#xACA9;&#xC801;&#xC778; &#xACBD;&#xD5D8;</p><h3 id="%EC%8B%9C%EC%9E%91%EC%A0%90">&#xC2DC;&#xC791;&#xC810;</h3><p>chatgpt&#xC5D0;&#xC11C; &#xC8FC;&#xACE0;&#xBC1B;&#xB294; &#xC9C8;&#xBB38; &#xB2F5;&#xBCC0;&#xB4E4;</p>]]></description><link>https://blog.midagedev.com/ghost-cloudflare-pages-blog-deploy/</link><guid isPermaLink="false">64b165f82e1df90c093716d6</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Fri, 14 Jul 2023 15:35:52 GMT</pubDate><content:encoded><![CDATA[<p>cloudflare&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xD55C;&#xC2DC;&#xAC04;&#xB9CC;&#xC5D0; &#xB3C4;&#xBA54;&#xC778;+&#xD638;&#xC2A4;&#xD305;+&#xBC30;&#xD3EC;+&#xC5B4;&#xB0BC;&#xB9AC;&#xD2F1;&#xC2A4; &#xC2F9; &#xBD99;&#xC778; &#xCDA9;&#xACA9;&#xC801;&#xC778; &#xACBD;&#xD5D8;</p><h3 id="%EC%8B%9C%EC%9E%91%EC%A0%90">&#xC2DC;&#xC791;&#xC810;</h3><p>chatgpt&#xC5D0;&#xC11C; &#xC8FC;&#xACE0;&#xBC1B;&#xB294; &#xC9C8;&#xBB38; &#xB2F5;&#xBCC0;&#xB4E4;&#xC774; &#xC815;&#xD655;&#xB3C4;&#xAC00; &#xC870;&#xAE08; &#xB5A8;&#xC5B4;&#xC9C0;&#xB354;&#xB77C;&#xB3C4; &#xB098;&#xC640; &#xBE44;&#xC2B7;&#xD55C; &#xAD81;&#xAE08;&#xC99D;&#xC744; &#xAC00;&#xC9C4; &#xBD84;&#xB4E4;&#xC5D0;&#xAC8C; &#xB3C4;&#xC6C0;&#xC774; &#xB420; &#xC218; &#xC788;&#xACA0;&#xB2E4; &#xC2F6;&#xC5B4;&#xC11C; &#xC774; &#xB0B4;&#xC6A9;&#xC744; &#xACF5;&#xC720;&#xD560; &#xBE14;&#xB85C;&#xADF8;&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4;&#xBD10;&#xC57C;&#xACA0;&#xB2E4;&#xB294; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5C8;&#xC74C;</p><h3 id="%EB%AC%B4%EC%A7%80%EC%84%B1-%EB%8F%84%EB%A9%94%EC%9D%B8-%EA%B5%AC%EC%9E%85">&#xBB34;&#xC9C0;&#xC131; &#xB3C4;&#xBA54;&#xC778; &#xAD6C;&#xC785;</h3><figure class="kg-card kg-image-card"><img src="https://blog.midagedev.com/content/images/2023/07/image-1.png" class="kg-image" alt loading="lazy" width="798" height="235" srcset="https://blog.midagedev.com/content/images/size/w600/2023/07/image-1.png 600w, https://blog.midagedev.com/content/images/2023/07/image-1.png 798w" sizes="(min-width: 720px) 720px"></figure><figure class="kg-card kg-image-card"><img src="https://blog.midagedev.com/content/images/2023/07/image.png" class="kg-image" alt loading="lazy" width="540" height="597"></figure><p>chatgpt&#xC5D0;&#xAC8C; &#xB3C4;&#xBA54;&#xC778;&#xBA85;&#xC744; &#xCD94;&#xCC9C;&#xBC1B;&#xC558;&#xC74C;, midagedev&#xB77C;&#xB294; &#xD0A4;&#xC6CC;&#xB4DC;&#xAC00; &#xAD6C;&#xAE00;&#xC5D0;&#xC11C; &#xAC80;&#xC0C9;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD558;&#xACE0; &#xBC14;&#xB85C; gmail &#xACC4;&#xC815;&#xB3C4; &#xD558;&#xB098; &#xD30C;&#xACE0;, &#xB3C4;&#xBA54;&#xC778;&#xB3C4; &#xAD6C;&#xB9E4;. &#xB3C4;&#xBA54;&#xC778;&#xC740; &#xC608;&#xC804;&#xC5D0; google domains &#xC0AC;&#xC5C5; &#xC811;&#xB294;&#xB2E4;&#xB294; &#xB274;&#xC2A4;&#xC5D0; cloudflare&#xC5D0;&#xC11C; &#xCE04;&#xB77C;&#xC774;&#xCE04;&#xB77C;&#xC774; &#xD588;&#xB358; &#xAC83;&#xC774; &#xAE30;&#xC5B5;&#xB098;&#xC11C; <a href="https://www.cloudflare.com/ko-kr/products/registrar/?ref=localhost">cloudflare</a>&#xC5D0;&#xC11C; &#xAD6C;&#xC785;, 1&#xB144;&#xC5D0; 9&#xB2EC;&#xB77C; &#xC815;&#xB3C4;</p><h3 id="crm%ED%88%B4-%EC%84%A0%EC%A0%95">CRM&#xD234; &#xC120;&#xC815;</h3><p><a href="https://jekyllrb-ko.github.io/?ref=localhost">jekyll</a>&#xC774;&#xB098; <a href="https://hexo.io/ko/index.html?ref=localhost">hexo</a>&#xB294; &#xC774;&#xC804;&#xC5D0; &#xC0AC;&#xC6A9;&#xD574;&#xBD24;&#xACE0; &#xBB50; &#xC0C9;&#xB2E4;&#xB978; &#xAC83;&#xC774; &#xC5C6;&#xC744;&#xAE4C; &#xC2F6;&#xC5B4; &#xCC3E;&#xC544;&#xBCF4;&#xB2E4;&#xAC00; <a href="https://github.com/tryghost/ghost?ref=localhost">ghost</a>&#xB97C; &#xBCF4;&#xACE0; &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xAE30;&#xB85C; &#xD558;&#xC600;&#xC74C;, &#xC14B;&#xC5C5;&#xD558;&#xACE0; &#xCCAB; &#xAE00; &#xC4F0;&#xB294;&#xB370;&#xAE4C;&#xC9C0; 20&#xBD84; &#xC548;&#xAC78;&#xB838;&#xC744; &#xC815;&#xB3C4;&#xB85C; &#xBE60;&#xB974;&#xAC8C; &#xC0AC;&#xC6A9;&#xD574;&#xBCFC; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC900;&#xBE44;&#xAC00; &#xB41C; &#xD234;&#xC774;&#xC5C8;&#xB2E4;.</p><h3 id="cloudflare-pages%EC%97%90-%EB%B0%B0%ED%8F%AC-%EC%85%8B%ED%8C%85">Cloudflare Pages&#xC5D0; &#xBC30;&#xD3EC; &#xC14B;&#xD305;</h3><figure class="kg-card kg-image-card"><img src="https://blog.midagedev.com/content/images/2023/07/image-2.png" class="kg-image" alt loading="lazy" width="1295" height="682" srcset="https://blog.midagedev.com/content/images/size/w600/2023/07/image-2.png 600w, https://blog.midagedev.com/content/images/size/w1000/2023/07/image-2.png 1000w, https://blog.midagedev.com/content/images/2023/07/image-2.png 1295w" sizes="(min-width: 720px) 720px"></figure><p><a href="https://sgbarker.com/blog/how-to-host-scalable-ghost-publication-for-free/?ref=localhost">&#xC774; &#xAE00;</a>&#xC744; &#xCC38;&#xC870;&#xD558;&#xC5EC; &#xC9C4;&#xD589;&#xD558;&#xC600;&#xC74C;. ghost&#xC5D0;&#xC11C;&#xB294; SSG&#xB97C; &#xC9C1;&#xC811; &#xC9C0;&#xC6D0;&#xD574;&#xC8FC;&#xC9C0;&#xB294; &#xC54A;&#xC544;&#xC11C; &#xC774;&#xB97C; &#xB300;&#xC2E0;&#xD574;&#xC8FC;&#xB294; <a href="https://github.com/Fried-Chicken/ghost-static-site-generator?ref=localhost">ghost-static-site-generator</a>&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC5EC; static&#xD30C;&#xC77C;&#xC744; &#xB9CC;&#xB4E4;&#xACE0; github repository&#xC5D0; push&#xD55C; &#xD6C4;&#xC5D0; cloudflare&#xC758; pages&#xC640; github&#xC5F0;&#xB3D9;, &#xC774;&#xC81C; remote&#xC5D0; commit&#xC774; &#xC0DD;&#xAE38;&#xB54C;&#xB9C8;&#xB2E4; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xBC30;&#xD3EC;&#xB428;, &#xADF8;&#xB9AC;&#xACE0; &#xB3C4;&#xBA54;&#xC778; &#xC14B;&#xD305; &#xC774; &#xACFC;&#xC815;&#xC774; 10&#xBD84;&#xC774; &#xCC44; &#xC548;&#xAC78;&#xB838;&#xC744; &#xC815;&#xB3C4;&#xB85C; &#xBE60;&#xB974;&#xAC8C; &#xC9C4;&#xD589;&#xB418;&#xC5C8;&#xC74C;</p><h3 id="cloudflare-web-analytics">Cloudflare Web Analytics</h3><figure class="kg-card kg-image-card"><img src="https://blog.midagedev.com/content/images/2023/07/image-4.png" class="kg-image" alt loading="lazy" width="1329" height="922" srcset="https://blog.midagedev.com/content/images/size/w600/2023/07/image-4.png 600w, https://blog.midagedev.com/content/images/size/w1000/2023/07/image-4.png 1000w, https://blog.midagedev.com/content/images/2023/07/image-4.png 1329w" sizes="(min-width: 720px) 720px"></figure><p>&#xC5B4;&#xB0BC;&#xB9AD;&#xD2F1;&#xC2A4;&#xB3C4; &#xBB58; &#xBD99;&#xC77C;&#xAE4C; &#xD558;&#xB2E4;&#xAC00; cloudflare&#xAEC4; &#xBD99;&#xC5EC;&#xBD04;, &#xC544;.. &#xC774;&#xAC74; &#xCC38;, &#xADF8;&#xB0E5; &#xB3C4;&#xBA54;&#xC778; &#xC120;&#xD0DD;&#xD558;&#xACE0; &#xD074;&#xB9AD;&#xD074;&#xB9AD; &#xD588;&#xB354;&#xB2C8; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; &#xCD94;&#xC801;&#xD0DC;&#xADF8;&#xAC00; &#xCD94;&#xAC00;&#xB428;&#x1F92F; &#xA0;&#xC774;&#xB7F0; &#xACBD;&#xD5D8;&#xC740; &#xCC98;&#xC74C;&#xD574;&#xBCF4;&#xB294; &#xAC83; &#xAC19;&#xB2E4;. &#xB3C4;&#xBA54;&#xC778;&#xBD80;&#xD130;, &#xD638;&#xC2A4;&#xD305;, &#xBC30;&#xD3EC;, &#xCD94;&#xC801;&#xAE4C;&#xC9C0; &#xB17C;&#xC2A4;&#xD1B1;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xC774; &#xB418;&#xC5B4;&#xBC84;&#xB838;&#xB2E4;. cloudflare&#xC9C4;&#xC9DC; &#xB300;&#xB2E8;&#xD55C;&#xB4EF;</p><p>&#xB300;&#xB7B5; &#xA0;ghost&#xC14B;&#xD305;&#xC5D0; 30&#xBD84;, &#xAE00;&#xC4F0;&#xB294;&#xB370; 30&#xBD84;, cloudflare&#xC14B;&#xD305;&#xD558;&#xB294;&#xB370; 60&#xBD84; &#xC815;&#xB3C4; &#xAC78;&#xB9B0;&#xB4EF; &#xD558;&#xB2E4;.</p>]]></content:encoded></item><item><title><![CDATA[python에서 GIL을 사용하지 않는다면]]></title><description><![CDATA[<p><a href="https://discuss.python.org/t/a-fast-free-threading-python/27903/99?ref=localhost" rel="noreferrer">If PEP 703 is accepted, Meta can commit three engineer-years to no-GIL CPython</a><br>&#xC544;&#xB798;&#xC758; &#xB0B4;&#xC6A9;&#xC740; &#xC704; &#xAE00;&#xC744; &#xBCF4;&#xACE0; chatgpt&#xC640;&#xC758; &#xB300;&#xD654;&#xB97C; &#xC815;&#xB9AC;&#xD55C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p><!--kg-card-begin: markdown--><h2 id="gil%EC%9D%B4%EB%9E%80">GIL&#xC774;&#xB780;?</h2>
<p>Python&#xC758; GIL&#xC774;&#xB780; Global Interpreter Lock&#xC758; &#xC57D;</p>]]></description><link>https://blog.midagedev.com/python-no-gil/</link><guid isPermaLink="false">64b157d3b104a3f8363cfa92</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Fri, 14 Jul 2023 14:26:32 GMT</pubDate><content:encoded><![CDATA[<p><a href="https://discuss.python.org/t/a-fast-free-threading-python/27903/99?ref=localhost" rel="noreferrer">If PEP 703 is accepted, Meta can commit three engineer-years to no-GIL CPython</a><br>&#xC544;&#xB798;&#xC758; &#xB0B4;&#xC6A9;&#xC740; &#xC704; &#xAE00;&#xC744; &#xBCF4;&#xACE0; chatgpt&#xC640;&#xC758; &#xB300;&#xD654;&#xB97C; &#xC815;&#xB9AC;&#xD55C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p><!--kg-card-begin: markdown--><h2 id="gil%EC%9D%B4%EB%9E%80">GIL&#xC774;&#xB780;?</h2>
<p>Python&#xC758; GIL&#xC774;&#xB780; Global Interpreter Lock&#xC758; &#xC57D;&#xC790;&#xB85C;, &#xD55C; &#xBC88;&#xC5D0; &#xD558;&#xB098;&#xC758; &#xC2A4;&#xB808;&#xB4DC;&#xB9CC; Python &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB3C4;&#xB85D; &#xC81C;&#xD55C;&#xD558;&#xB294; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC774;&#xB2E4;.</p>
<p>&#xC774;&#xB294; Python &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xAC00; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xB3D9;&#xC2DC;&#xC5D0; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC2A4;&#xB808;&#xB4DC; &#xAC04;&#xC5D0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC548;&#xC804;&#xD558;&#xAC8C; &#xCC98;&#xB9AC;&#xD558;&#xB3C4;&#xB85D; &#xB3C4;&#xC640;&#xC900;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC774;&#xB85C; &#xC778;&#xD574; &#xBA40;&#xD2F0;&#xCF54;&#xC5B4; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC5D0;&#xC11C; Python&#xC758; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB529;&#xC774; &#xD6A8;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xD65C;&#xC6A9;&#xB418;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xB2E8;&#xC810;&#xC774; &#xC788;&#xB2E4;.<br>
GIL&#xC740; CPython&#xC5D0;&#xC11C;&#xB9CC; &#xBC1C;&#xACAC;&#xB418;&#xBA70;, Jython&#xC774;&#xB098; IronPython&#xACFC; &#xAC19;&#xC740; &#xB2E4;&#xB978; Python &#xAD6C;&#xD604;&#xC5D0;&#xC11C;&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xC81C;&#xD55C;&#xC774; &#xC5C6;&#xB2E4;. &#xB610;&#xD55C;, &#xBCD1;&#xB82C; &#xCC98;&#xB9AC;&#xB97C; &#xD544;&#xC694;&#xB85C; &#xD558;&#xB294; &#xC791;&#xC5C5;&#xC758; &#xACBD;&#xC6B0; Python&#xC758; &#xBA40;&#xD2F0;&#xD504;&#xB85C;&#xC138;&#xC2F1; &#xBAA8;&#xB4C8;&#xC774;&#xB098; &#xC368;&#xB4DC;&#xD30C;&#xD2F0; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC774; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<h2 id="gil%EC%9D%84-%EC%82%AC%EC%9A%A9%ED%95%98%EC%A7%80-%EC%95%8A%EA%B2%8C-%EB%90%9C%EB%8B%A4%EB%A9%B4">GIL&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xAC8C; &#xB41C;&#xB2E4;&#xBA74;?</h2>
<p>GIL&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xAC8C; &#xB418;&#xBA74;, &#xC5EC;&#xB7EC; &#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xB3D9;&#xC2DC;&#xC5D0; &#xC2E4;&#xD589;&#xB418;&#xBA74;&#xC11C; Python &#xAC1D;&#xCCB4;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xBA40;&#xD2F0; &#xCF54;&#xC5B4; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC5D0;&#xC11C; &#xBCD1;&#xB82C; &#xC791;&#xC5C5;&#xC744; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD558;&#xBBC0;&#xB85C;, &#xC774;&#xB860;&#xC801;&#xC73C;&#xB85C;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC2E4;&#xD589; &#xC18D;&#xB3C4;&#xB97C; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xB098; GIL&#xC774; &#xC5C6;&#xB2E4;&#xBA74;, &#xACF5;&#xC720; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xB300;&#xD55C; &#xB3D9;&#xC2DC; &#xC811;&#xADFC;&#xC744; &#xB9C9;&#xAE30; &#xC704;&#xD55C; &#xC0C8;&#xB85C;&#xC6B4; &#xBC29;&#xBC95;&#xC774; &#xD544;&#xC694;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC989;, &#xC2A4;&#xB808;&#xB4DC; &#xC548;&#xC804;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB354; &#xB9CE;&#xC740; &#xB3D9;&#xAE30;&#xD654;&#xAC00; &#xD544;&#xC694;&#xD574;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xB418;&#xBA74; &#xBCF5;&#xC7A1;&#xC131;&#xC774; &#xC99D;&#xAC00;&#xD558;&#xACE0;, &#xC798;&#xBABB; &#xAD00;&#xB9AC;&#xB41C; &#xACBD;&#xC6B0; &#xB370;&#xC774;&#xD130;&#xC758; &#xC77C;&#xAD00;&#xC131;&#xC774; &#xC190;&#xC0C1;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB610;&#xD55C;, &#xB3D9;&#xAE30;&#xD654;&#xB97C; &#xC704;&#xD55C; &#xC624;&#xBC84;&#xD5E4;&#xB4DC;&#xB85C; &#xC778;&#xD574; &#xC2E4;&#xC81C;&#xB85C; &#xC131;&#xB2A5; &#xD5A5;&#xC0C1;&#xC744; &#xC5BB;&#xC9C0; &#xBABB;&#xD558;&#xACE0;, &#xC624;&#xD788;&#xB824; &#xC131;&#xB2A5;&#xC774; &#xC800;&#xD558;&#xB420; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD2B9;&#xD788; &#xC2A4;&#xB808;&#xB4DC;&#xAC04;&#xC5D0; &#xB9CE;&#xC740; &#xACF5;&#xC720; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC788;&#xB294; &#xACBD;&#xC6B0;&#xC5D0; &#xD574;&#xB2F9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; GIL&#xC744; &#xC81C;&#xAC70;&#xD558;&#xB294; &#xAC83;&#xC740; &#xAC04;&#xB2E8;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA70;, &#xC7A0;&#xC7AC;&#xC801;&#xC73C;&#xB85C; &#xB9CE;&#xC740; &#xBB38;&#xC81C;&#xB97C; &#xCD08;&#xB798;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xC774;&#xC720;&#xB85C;, Python &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB294; &#xC5EC;&#xB7EC; &#xBC88; GIL&#xC744; &#xC81C;&#xAC70;&#xD558;&#xB824;&#xB294; &#xC2DC;&#xB3C4;&#xB97C; &#xD588;&#xC9C0;&#xB9CC; &#xC544;&#xC9C1;&#xAE4C;&#xC9C0;&#xB294; &#xC644;&#xC804;&#xD788; &#xC131;&#xACF5;&#xD558;&#xC9C0; &#xBABB;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="django%EC%97%90%EC%84%9C-gil%EC%9D%B4-%EC%97%86%EB%8A%94-python%EC%9D%84-%EC%93%B4%EB%8B%A4%EB%A9%B4-%EC%96%B4%EB%96%A4-%EC%9E%A5%EB%8B%A8%EC%A0%90%EC%9D%B4-%EC%9E%88%EC%9D%84%EA%B9%8C">django&#xC5D0;&#xC11C; GIL&#xC774; &#xC5C6;&#xB294; python&#xC744; &#xC4F4;&#xB2E4;&#xBA74; &#xC5B4;&#xB5A4; &#xC7A5;&#xB2E8;&#xC810;&#xC774; &#xC788;&#xC744;&#xAE4C;?</h2>
<h3 id="%EC%9E%A5%EC%A0%90">&#xC7A5;&#xC810;:</h3>
<ol>
<li>
<p><strong>&#xBCD1;&#xB82C; &#xCC98;&#xB9AC; &#xAC1C;&#xC120;</strong>: GIL&#xC774; &#xC5C6;&#xB294; &#xACBD;&#xC6B0;, &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xAC01; &#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xB3C5;&#xB9BD;&#xC801;&#xC73C;&#xB85C; &#xB3D9;&#xC2DC;&#xC5D0; &#xC791;&#xC5C5;&#xC744; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB85C; &#xC778;&#xD574; &#xBCD1;&#xB82C; &#xCC98;&#xB9AC; &#xC131;&#xB2A5;&#xC774; &#xD5A5;&#xC0C1;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li>
<p><strong>CPU &#xD65C;&#xC6A9;&#xB3C4; &#xC99D;&#xAC00;</strong>: GIL&#xC774; &#xC5C6;&#xB2E4;&#xBA74;, &#xBA40;&#xD2F0; &#xCF54;&#xC5B4; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC758; &#xBAA8;&#xB4E0; &#xCF54;&#xC5B4;&#xB97C; &#xB3D9;&#xC2DC;&#xC5D0; &#xD65C;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; CPU &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xBCF4;&#xB2E4; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
<h3 id="%EB%8B%A8%EC%A0%90">&#xB2E8;&#xC810;:</h3>
<ol>
<li>
<p><strong>&#xB3D9;&#xAE30;&#xD654; &#xBB38;&#xC81C;</strong>: GIL&#xC774; &#xC5C6;&#xB294; &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xB294; &#xC2A4;&#xB808;&#xB4DC; &#xAC04;&#xC758; &#xB3D9;&#xAE30;&#xD654;&#xB97C; &#xBCF4;&#xB2E4; &#xC2E0;&#xC911;&#xD558;&#xAC8C; &#xCC98;&#xB9AC;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xACF5;&#xC720;&#xB41C; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xB300;&#xD55C; &#xB3D9;&#xC2DC; &#xC811;&#xADFC;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; &#xB370;&#xC774;&#xD130;&#xC758; &#xC77C;&#xAD00;&#xC131;&#xC774; &#xC190;&#xC0C1;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li>
<p><strong>&#xC131;&#xB2A5; &#xC800;&#xD558; &#xAC00;&#xB2A5;&#xC131;</strong>: &#xACFC;&#xB3C4;&#xD55C; &#xC2A4;&#xB808;&#xB4DC; &#xB3D9;&#xAE30;&#xD654;&#xB85C; &#xC778;&#xD55C; &#xC624;&#xBC84;&#xD5E4;&#xB4DC;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xBA74;, &#xC624;&#xD788;&#xB824; &#xC131;&#xB2A5; &#xC800;&#xD558;&#xB97C; &#xCD08;&#xB798;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li>
<p><strong>&#xB514;&#xBC84;&#xAE45; &#xC5B4;&#xB824;&#xC6C0;</strong>: &#xBCD1;&#xB82C; &#xCF54;&#xB4DC;&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xB514;&#xBC84;&#xAE45;&#xC774; &#xC5B4;&#xB835;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2A4;&#xB808;&#xB4DC; &#xAC04;&#xC758; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xC774;&#xB098; &#xACBD;&#xC7C1; &#xC870;&#xAC74; &#xB4F1;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xCC3E;&#xACE0; &#xD574;&#xACB0;&#xD558;&#xB294; &#xAC83;&#xC774; &#xBCF5;&#xC7A1;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
<p>&#xB530;&#xB77C;&#xC11C;, Django&#xC5D0;&#xC11C; GIL&#xC774; &#xC5C6;&#xB294; Python&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB824;&#xBA74; &#xC2A4;&#xB808;&#xB4DC; &#xB3D9;&#xAE30;&#xD654;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xC798; &#xC774;&#xD574;&#xD558;&#xACE0; &#xAD00;&#xB9AC;&#xD560; &#xC904; &#xC54C;&#xC544;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, CPU &#xD65C;&#xC6A9;&#xB3C4;&#xC640; &#xBCD1;&#xB82C; &#xCC98;&#xB9AC; &#xC131;&#xB2A5; &#xD5A5;&#xC0C1;&#xC774; &#xC2E4;&#xC81C;&#xB85C; &#xD544;&#xC694;&#xD55C; &#xACBD;&#xC6B0;&#xC5D0;&#xB9CC; &#xACE0;&#xB824;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="django%EB%8A%94-%EC%A7%80%EA%B8%88-%EC%8A%A4%EB%A0%88%EB%93%9C%EB%A5%BC-%EC%96%B4%EB%96%A4-%EC%8B%9D%EC%9C%BC%EB%A1%9C-%EC%93%B0%EA%B3%A0-%EC%9E%88%EC%96%B4">django&#xB294; &#xC9C0;&#xAE08; &#xC2A4;&#xB808;&#xB4DC;&#xB97C; &#xC5B4;&#xB5A4; &#xC2DD;&#xC73C;&#xB85C; &#xC4F0;&#xACE0; &#xC788;&#xC5B4;?</h2>
<p>Django&#xB294; &#xC694;&#xCCAD;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC2A4;&#xB808;&#xB4DC;&#xB098; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xB370;, &#xADF8; &#xBC29;&#xC2DD;&#xC740; &#xC6F9; &#xC11C;&#xBC84;&#xC758; &#xC124;&#xC815;&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p>Django&#xB294; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xB3D9;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xC989;, &#xD558;&#xB098;&#xC758; &#xC694;&#xCCAD;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xB3D9;&#xC548; &#xB2E4;&#xB978; &#xC694;&#xCCAD;&#xC740; &#xB300;&#xAE30;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC740; &#xAC04;&#xB2E8;&#xD558;&#xACE0; &#xC9C1;&#xAD00;&#xC801;&#xC774;&#xC9C0;&#xB9CC;, &#xC694;&#xCCAD;&#xC774; &#xB9CE;&#xC544;&#xC9C8; &#xACBD;&#xC6B0; &#xD6A8;&#xC728;&#xC131;&#xC774; &#xB5A8;&#xC5B4;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB798;&#xC11C; &#xC2E4;&#xC81C; &#xC6B4;&#xC601; &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xB294; &#xC5EC;&#xB7EC; &#xC694;&#xCCAD;&#xC744; &#xB3D9;&#xC2DC;&#xC5D0; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC6F9; &#xC11C;&#xBC84;&#xB97C; &#xC124;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, WSGI &#xC11C;&#xBC84;&#xC778; Gunicorn&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xACBD;&#xC6B0;, &#xC6CC;&#xCEE4;(worker)&#xB77C;&#xB294; &#xAC1C;&#xB150;&#xC744; &#xD1B5;&#xD574; &#xC694;&#xCCAD;&#xC744; &#xBCD1;&#xB82C;&#xB85C; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6CC;&#xCEE4;&#xB294; &#xBCC4;&#xB3C4;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB098; &#xC2A4;&#xB808;&#xB4DC;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xBA70;, &#xAC01; &#xC6CC;&#xCEE4;&#xB294; &#xB3C5;&#xB9BD;&#xC801;&#xC73C;&#xB85C; &#xC694;&#xCCAD;&#xC744; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xD568;&#xC73C;&#xB85C;&#xC368; Gunicorn&#xC740; &#xC5EC;&#xB7EC; &#xC694;&#xCCAD;&#xC744; &#xB3D9;&#xC2DC;&#xC5D0; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Django 3.1 &#xC774;&#xC0C1;&#xC5D0;&#xC11C;&#xB294; &#xBE44;&#xB3D9;&#xAE30; &#xAE30;&#xB2A5;&#xC774; &#xCD94;&#xAC00;&#xB418;&#xC5B4;, ASGI(Application Server Gateway Interface)&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xBE44;&#xB3D9;&#xAE30; &#xC694;&#xCCAD;&#xB3C4; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74;, Django&#xB294; &#xC6F9;&#xC18C;&#xCF13;&#xACFC; &#xAC19;&#xC740; &#xBE44;&#xB3D9;&#xAE30; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xBA70;, &#xBE44;&#xB3D9;&#xAE30; &#xBDF0;, &#xBBF8;&#xB4E4;&#xC6E8;&#xC5B4;, &#xD14C;&#xC2A4;&#xD2B8; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xB098; Python&#xC758; GIL &#xB54C;&#xBB38;&#xC5D0;, &#xC2F1;&#xAE00; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xB0B4;&#xC5D0;&#xC11C;&#xC758; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB529;&#xC740; &#xC5EC;&#xC804;&#xD788; CPU-bound &#xC791;&#xC5C5;&#xC5D0;&#xC11C;&#xB294; &#xBCD1;&#xB82C;&#xC131;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xBABB;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; CPU &#xC0AC;&#xC6A9;&#xC774; &#xB9CE;&#xC740; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; Django &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xACBD;&#xC6B0;, &#xC5EC;&#xB7EC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xB354; &#xD6A8;&#xC728;&#xC801;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="gunicorn%EC%97%90%EC%84%9C-%EB%A9%80%ED%8B%B0%ED%94%84%EB%A1%9C%EC%84%B8%EC%8A%A4%EA%B0%80-%EC%95%84%EB%8B%8C-%EB%A9%80%ED%8B%B0%EC%8A%A4%EB%A0%88%EB%93%9C-%EB%AA%A8%EB%93%9C%EB%A5%BC-%EC%82%AC%EC%9A%A9%ED%95%98%EB%8A%94-%EA%B2%83%EC%9D%B4-%EC%9D%B4%EC%A0%90">gunicorn&#xC5D0;&#xC11C; &#xBA40;&#xD2F0;&#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC544;&#xB2CC; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC774;&#xC810;</h2>
<p>Gunicorn&#xC5D0;&#xC11C; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC774;&#xC810;&#xC774; &#xB420; &#xC218; &#xC788;&#xB294; &#xC0C1;&#xD669;&#xB4E4;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC;&#xC640; &#xBA40;&#xD2F0;&#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xAC01;&#xAC01;&#xC758; &#xC7A5;&#xB2E8;&#xC810;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xACE0;, &#xADF8; &#xC120;&#xD0DD;&#xC740; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xD2B9;&#xC131;&#xACFC; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xC758; &#xC8FC;&#xC694; &#xC774;&#xC810;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ol>
<li>
<p><strong>&#xBA54;&#xBAA8;&#xB9AC; &#xD6A8;&#xC728;&#xC131;</strong>: &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C;&#xB294;, &#xBAA8;&#xB4E0; &#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xAC19;&#xC740; &#xBA54;&#xBAA8;&#xB9AC; &#xACF5;&#xAC04;&#xC744; &#xACF5;&#xC720;&#xD558;&#xBBC0;&#xB85C; &#xBA54;&#xBAA8;&#xB9AC; &#xC0AC;&#xC6A9;&#xB7C9;&#xC774; &#xC904;&#xC5B4;&#xB4ED;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74;&#xC5D0;, &#xBA40;&#xD2F0;&#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#xAC01; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xB3C5;&#xB9BD;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xACF5;&#xAC04;&#xC744; &#xAC00;&#xC9C0;&#xBBC0;&#xB85C;, &#xBE44;&#xC2B7;&#xD55C; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD558;&#xB354;&#xB77C;&#xB3C4; &#xBA54;&#xBAA8;&#xB9AC; &#xC0AC;&#xC6A9;&#xB7C9;&#xC774; &#xB298;&#xC5B4;&#xB0A9;&#xB2C8;&#xB2E4;.</p>
</li>
<li>
<p><strong>&#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC2A4;&#xC704;&#xCE6D;</strong>: &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; &#xC2A4;&#xB808;&#xB4DC; &#xAC04;&#xC758; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC2A4;&#xC704;&#xCE6D;&#xC740; &#xBA40;&#xD2F0;&#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC04;&#xC758; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC2A4;&#xC704;&#xCE6D;&#xBCF4;&#xB2E4; &#xC624;&#xBC84;&#xD5E4;&#xB4DC;&#xAC00; &#xC801;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xACF5;&#xC720;&#xD558;&#xBBC0;&#xB85C; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC815;&#xBCF4;&#xB97C; &#xAD50;&#xD658;&#xD558;&#xB294; &#xB370; &#xBE44;&#xC6A9;&#xC774; &#xB35C; &#xB4E4;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
<p>&#xADF8;&#xB7EC;&#xB098; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; Python&#xC758; GIL(Global Interpreter Lock)&#xC774; &#xBCD1;&#xBAA9;&#xC774; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, &#xD55C; &#xBC88;&#xC5D0; &#xD558;&#xB098;&#xC758; &#xC2A4;&#xB808;&#xB4DC;&#xB9CC;&#xC774; &#xC2E4;&#xD589;&#xB420; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; CPU-bound &#xC791;&#xC5C5;&#xC5D0;&#xC11C;&#xB294; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xBCD1;&#xB82C;&#xC131;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xBABB;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; Gunicorn&#xC5D0;&#xC11C; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC774;&#xC810;&#xC774; &#xB418;&#xB294;&#xC9C0;&#xB294; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xD2B9;&#xC131;&#xACFC; &#xD658;&#xACBD;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;. I/O-bound &#xC791;&#xC5C5;&#xC774; &#xB9CE;&#xC740; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0;&#xC11C;&#xB294; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xD6A8;&#xACFC;&#xC801;&#xC77C; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xBC18;&#xB300;&#xB85C; CPU-bound &#xC791;&#xC5C5;&#xC774; &#xB9CE;&#xC740; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0;&#xC11C;&#xB294; &#xBA40;&#xD2F0;&#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xB354; &#xB098;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="db%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%A5%BC-%EC%8B%9C%EB%A6%AC%EC%96%BC%EB%9D%BC%EC%9D%B4%EC%A6%88-%ED%95%98%EB%8A%94-%EC%9D%BC%EC%9D%B4-%EB%8C%80%EB%B6%80%EB%B6%84%EC%9D%B4%EB%9D%BC%EB%A9%B4">DB&#xB370;&#xC774;&#xD130;&#xB97C; &#xC2DC;&#xB9AC;&#xC5BC;&#xB77C;&#xC774;&#xC988; &#xD558;&#xB294; &#xC77C;&#xC774; &#xB300;&#xBD80;&#xBD84;&#xC774;&#xB77C;&#xBA74;</h2>
<p>&#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0;&#xC11C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAC00;&#xC838;&#xC624;&#xB294; &#xC791;&#xC5C5;&#xC740; &#xB300;&#xBD80;&#xBD84; I/O-bound &#xC791;&#xC5C5;&#xC785;&#xB2C8;&#xB2E4;. &#xC989;, &#xC774;&#xB7EC;&#xD55C; &#xC791;&#xC5C5;&#xC740; CPU &#xC5F0;&#xC0B0;&#xBCF4;&#xB2E4;&#xB294; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB098; &#xB514;&#xC2A4;&#xD06C; I/O&#xC5D0; &#xC758;&#xD574; &#xC131;&#xB2A5;&#xC774; &#xACB0;&#xC815;&#xB429;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC774;&#xB7F0; &#xACBD;&#xC6B0;, &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xAC00; &#xB354; &#xC801;&#xD569;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#xC2A4;&#xB808;&#xB4DC;&#xB4E4;&#xC774; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xACF5;&#xC720;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xBA54;&#xBAA8;&#xB9AC; &#xC0AC;&#xC6A9;&#xB7C9;&#xC774; &#xB354; &#xC801;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC2A4;&#xB808;&#xB4DC; &#xAC04;&#xC758; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC2A4;&#xC704;&#xCE6D; &#xBE44;&#xC6A9;&#xC774; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC04;&#xC758; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC2A4;&#xC704;&#xCE6D; &#xBE44;&#xC6A9;&#xBCF4;&#xB2E4; &#xC801;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, I/O-bound &#xC791;&#xC5C5;&#xC5D0;&#xC11C;&#xB294; &#xB354; &#xD6A8;&#xC728;&#xC801;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xB294; &#xB3D9;&#xC2DC;&#xC131; &#xC81C;&#xC5B4;&#xC5D0; &#xC8FC;&#xC758;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC218;&#xC758; &#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xB3D9;&#xC77C;&#xD55C; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xB3D9;&#xC2DC;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294; &#xACBD;&#xC6B0;, &#xB370;&#xC774;&#xD130;&#xC758; &#xC77C;&#xAD00;&#xC131;&#xC744; &#xC720;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xB3D9;&#xAE30;&#xD654;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xC99D;&#xAC00;&#xC2DC;&#xD0A4;&#xACE0;, &#xC798;&#xBABB; &#xAD00;&#xB9AC;&#xB418;&#xBA74; &#xBC84;&#xADF8;&#xB97C; &#xC720;&#xBC1C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; &#xC774;&#xB7EC;&#xD55C; &#xC694;&#xC18C;&#xB4E4;&#xC744; &#xC885;&#xD569;&#xC801;&#xC73C;&#xB85C; &#xACE0;&#xB824;&#xD558;&#xC5EC;, &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xD2B9;&#xC131;, &#xD2B8;&#xB798;&#xD53D; &#xD328;&#xD134;, &#xC11C;&#xBC84;&#xC758; &#xC790;&#xC6D0; &#xB4F1;&#xC5D0; &#xB530;&#xB77C; &#xAC00;&#xC7A5; &#xC801;&#xD569;&#xD55C; &#xBAA8;&#xB4DC;&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="%EC%8A%A4%EB%A0%88%EB%93%9C%EB%A5%BC-%EC%82%AC%EC%9A%A9%ED%95%98%EC%A7%80-%EC%95%8A%EB%8A%94-%ED%8E%B8%EC%9D%B4-%EA%B0%9C%EB%B0%9C-%EB%82%9C%EC%9D%B4%EB%8F%84%EA%B0%80-%EB%82%AE%EB%8B%A4%EA%B3%A0-%ED%95%A0-%EC%88%98-%EC%9E%88%EC%9D%84%EA%B9%8C">&#xC2A4;&#xB808;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xD3B8;&#xC774; &#xAC1C;&#xBC1C; &#xB09C;&#xC774;&#xB3C4;&#xAC00; &#xB0AE;&#xB2E4;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;?</h2>
<p>&#xC608;, &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC2A4;&#xB808;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xB3D9;&#xAE30; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774; &#xBE44;&#xB3D9;&#xAE30;&#xB098; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xBE44;&#xD574; &#xAC1C;&#xBC1C; &#xB09C;&#xC774;&#xB3C4;&#xAC00; &#xB0AE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC774;&#xC720; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;:</p>
<ol>
<li>
<p><strong>&#xBCF5;&#xC7A1;&#xC131; &#xAC10;&#xC18C;</strong>: &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C;&#xB294; &#xC2A4;&#xB808;&#xB4DC;&#xAC04;&#xC758; &#xC0C1;&#xD638;&#xC791;&#xC6A9; &#xBC0F; &#xB3D9;&#xAE30;&#xD654; &#xBB38;&#xC81C;&#xB97C; &#xCC98;&#xB9AC;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xBB38;&#xC81C;&#xB294; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xB192;&#xC774;&#xBA70;, &#xC885;&#xC885; &#xBC84;&#xADF8;&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xB294; &#xC6D0;&#xC778;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>
</li>
<li>
<p><strong>&#xB514;&#xBC84;&#xAE45; &#xC6A9;&#xC774;&#xC131;</strong>: &#xB3D9;&#xAE30; &#xCF54;&#xB4DC;&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xAE30; &#xC27D;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCF54;&#xB4DC;&#xC758; &#xD750;&#xB984;&#xC774; &#xBA85;&#xD655;&#xD558;&#xACE0; &#xC608;&#xCE21; &#xAC00;&#xB2A5;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBB38;&#xC81C;&#xB97C; &#xCC3E;&#xACE0; &#xD574;&#xACB0;&#xD558;&#xB294; &#xAC83;&#xC774; &#xB354; &#xAC04;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74;, &#xBE44;&#xB3D9;&#xAE30;&#xB098; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xCF54;&#xB4DC;&#xB294; &#xB3D9;&#xC2DC;&#xC131; &#xBB38;&#xC81C;&#xB85C; &#xC778;&#xD574; &#xB514;&#xBC84;&#xAE45;&#xC774; &#xB354; &#xC5B4;&#xB824;&#xC6B8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li>
<p><strong>&#xCF54;&#xB4DC; &#xAC00;&#xB3C5;&#xC131;</strong>: &#xB3D9;&#xAE30; &#xCF54;&#xB4DC;&#xB294; &#xC704;&#xC5D0;&#xC11C; &#xC544;&#xB798;&#xB85C; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xBBC0;&#xB85C;, &#xAC00;&#xB3C5;&#xC131;&#xC774; &#xB192;&#xACE0; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC27D;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBE44;&#xB3D9;&#xAE30;&#xB098; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xCF54;&#xB4DC;&#xB294; &#xC774;&#xBCA4;&#xD2B8; &#xB8E8;&#xD504;, &#xCF5C;&#xBC31;, &#xD504;&#xB85C;&#xBBF8;&#xC2A4; &#xB4F1;&#xC758; &#xAC1C;&#xB150;&#xC744; &#xC774;&#xD574;&#xD574;&#xC57C; &#xD558;&#xBA70;, &#xCF54;&#xB4DC; &#xD750;&#xB984;&#xC744; &#xCD94;&#xC801;&#xD558;&#xAE30; &#xC5B4;&#xB824;&#xC6B8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
<p>&#xADF8;&#xB7EC;&#xB098; &#xC774;&#xB7EC;&#xD55C; &#xC774;&#xC810;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0;, &#xB300;&#xADDC;&#xBAA8; &#xC11C;&#xBE44;&#xC2A4;&#xB098; I/O &#xC791;&#xC5C5;&#xC774; &#xB9CE;&#xC740; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0;&#xC11C;&#xB294; &#xBE44;&#xB3D9;&#xAE30;&#xB098; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xD6A8;&#xC728;&#xC801;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xC131;&#xB2A5;&#xC744; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0A4;&#xACE0;, &#xC11C;&#xBC84; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xB354; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xD65C;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xC694;&#xAD6C; &#xC0AC;&#xD56D;&#xC5D0; &#xB530;&#xB77C; &#xC801;&#xC808;&#xD55C; &#xC811;&#xADFC;&#xBC95;&#xC744; &#xC120;&#xD0DD;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<!--kg-card-end: markdown--><p></p><p></p>]]></content:encoded></item></channel></rss>