<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[애매한중년개발자 blog]]></title><description><![CDATA[개발 관련 메모장]]></description><link>https://blog.midagedev.com/</link><image><url>https://blog.midagedev.com/favicon.png</url><title>애매한중년개발자 blog</title><link>https://blog.midagedev.com/</link></image><generator>Ghost 5.54</generator><lastBuildDate>Wed, 19 Jul 2023 09:01:57 GMT</lastBuildDate><atom:link href="https://blog.midagedev.com/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[More What, Less How]]></title><description><![CDATA[<figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://tidyfirst.substack.com/p/more-what-less-how?ref=localhost"><div class="kg-bookmark-content"><div class="kg-bookmark-title">More What, Less How</div><div class="kg-bookmark-description">Synthetic -&gt; analytic skills</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://substackcdn.com/icons/substack/apple-touch-icon-1024x1024.png" alt><span class="kg-bookmark-author">Software Design: Tidy First?</span><span class="kg-bookmark-publisher">Kent Beck</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe7b504d6-4f2b-468c-8158-8e664f0dfbe0_950x402.png" alt></div></a></figure><p>kent back&#xC758; AI&#xC5D0; &#xB300;&#xD55C; 2023&#xB144; 4&#xC6D4; 23&#xC77C;&#xC758; &#xAE00;&#xC744; &#xA0;chatgpt&#xB97C; &#xD1B5;&#xD574; &#xC694;&#xC57D;&#xD55C; &#xB0B4;&#xC6A9;<br><br>&#xD574;&#xB2F9; &#xAE00;&#xC740; &quot;More What, Less How&</p>]]></description><link>https://blog.midagedev.com/more-what-less-how/</link><guid isPermaLink="false">64b7a5852e1df90c093717b7</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Wed, 19 Jul 2023 09:00:45 GMT</pubDate><content:encoded><![CDATA[<figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://tidyfirst.substack.com/p/more-what-less-how?ref=localhost"><div class="kg-bookmark-content"><div class="kg-bookmark-title">More What, Less How</div><div class="kg-bookmark-description">Synthetic -&gt; analytic skills</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://substackcdn.com/icons/substack/apple-touch-icon-1024x1024.png" alt><span class="kg-bookmark-author">Software Design: Tidy First?</span><span class="kg-bookmark-publisher">Kent Beck</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fe7b504d6-4f2b-468c-8158-8e664f0dfbe0_950x402.png" alt></div></a></figure><p>kent back&#xC758; AI&#xC5D0; &#xB300;&#xD55C; 2023&#xB144; 4&#xC6D4; 23&#xC77C;&#xC758; &#xAE00;&#xC744; &#xA0;chatgpt&#xB97C; &#xD1B5;&#xD574; &#xC694;&#xC57D;&#xD55C; &#xB0B4;&#xC6A9;<br><br>&#xD574;&#xB2F9; &#xAE00;&#xC740; &quot;More What, Less How&quot;&#xB77C;&#xB294; &#xC81C;&#xBAA9;&#xC73C;&#xB85C;, &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xC640; &#xAE30;&#xC220;&#xC758; &#xC9C4;&#xD654;&#xC5D0; &#xB300;&#xD55C; &#xC774;&#xC57C;&#xAE30;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>1975&#xB144;, &#xC800;&#xC790;&#xC758; &#xC544;&#xBC84;&#xC9C0;&#xB294; &#xC5B4;&#xC148;&#xBE14;&#xB9AC; &#xC5B8;&#xC5B4; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB85C;&#xC11C;, C&#xC640; &#xAC19;&#xC740; &#xACE0;&#xAE09; &#xC5B8;&#xC5B4;&#xC5D0; &#xB300;&#xD55C; &#xC774;&#xC57C;&#xAE30;&#xB97C; &#xC810;&#xC810; &#xB354; &#xB9CE;&#xC774; &#xB4E3;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. C &#xC5B8;&#xC5B4;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xAC00; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xBB34;&#xC5C7;&#xC744; &#xD574;&#xC57C; &#xD558;&#xB294;&#xC9C0; &#xACB0;&#xC815;&#xD558;&#xACE0;, C &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xADF8;&#xAC83;&#xC744; &#xC218;&#xD589;&#xD560;&#xC9C0; &#xACB0;&#xC815;&#xD558;&#xB3C4;&#xB85D; &#xD574;&#xC8FC;&#xB294; &#xC57D;&#xC18D;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xD558;&#xC9C0;&#xB9CC;, &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB294; &#xC218;&#xB3D9;&#xC73C;&#xB85C; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC131;&#xD55C; &#xC5B4;&#xC148;&#xBE14;&#xB9AC; &#xC5B8;&#xC5B4;&#xB9CC;&#xD07C; &#xD6A8;&#xC728;&#xC801;&#xC774;&#xC9C0; &#xC54A;&#xC744; &#xAC83;&#xC774;&#xBA70;, &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xC791;&#xC740; &#xACF5;&#xAC04;&#xC5D0; &#xC9D1;&#xC5B4;&#xB123;&#xB294; &#xB370; &#xC788;&#xC5B4; &#xC5B4;&#xC148;&#xBE14;&#xB9AC; &#xC5B8;&#xC5B4;&#xB9CC;&#xD07C; &#xB2A5;&#xB825;&#xC774; &#xC5C6;&#xC744; &#xAC83;&#xC774;&#xB77C;&#xB294; &#xC6B0;&#xB824;&#xAC00; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xAC00; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xB370; &#xAC78;&#xB9AC;&#xB294; &#xC2DC;&#xAC04;&#xC774; &#xC5B4;&#xC148;&#xBE14;&#xB7EC;&#xBCF4;&#xB2E4; &#xAE38;&#xB2E4;&#xB294; &#xBB38;&#xC81C;&#xB3C4; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC2DC;&#xAC04;&#xC774; &#xC9C0;&#xB0A8;&#xC5D0; &#xB530;&#xB77C; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB294; &#xC810;&#xC810; &#xB354; &#xB098;&#xC544;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC774;&#xB7EC;&#xD55C; &#xBCC0;&#xD654;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xAC00; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xBB34;&#xC5C7;&#xC744; &#xD574;&#xC57C; &#xD558;&#xB294;&#xC9C0; &#xB9D0;&#xD558;&#xAC8C; &#xD558;&#xACE0;, &#xBAA8;&#xB378;&#xC774; &#xADF8; &#xC791;&#xC5C5;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xC218;&#xD589;&#xD560;&#xC9C0; &#xD30C;&#xC545;&#xD558;&#xB3C4;&#xB85D; &#xD558;&#xB294; &#xB300;&#xD615; &#xC5B8;&#xC5B4; &#xBAA8;&#xB378;&#xC744; &#xC57D;&#xC18D;&#xD558;&#xB294; &#xAC83;&#xACFC; &#xBE44;&#xC2B7;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC800;&#xC790;&#xB294; &#xC790;&#xC2E0;&#xC758; &#xAE30;&#xC220;&#xC758; 90%&#xB294; &#xC774;&#xC81C; &#xAC00;&#xCE58;&#xAC00; &#xC5C6;&#xC9C0;&#xB9CC;, &#xB0A8;&#xC740; 10%&#xB294; &#xC774;&#xC804;&#xBCF4;&#xB2E4; 1000&#xBC30; &#xAC00;&#xCE58;&#xAC00; &#xC788;&#xB2E4;&#xACE0; &#xD2B8;&#xC717;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; 90%&#xC640; 10%&#xAC00; &#xBB34;&#xC5C7;&#xC778;&#xC9C0;&#xB294; &#xD655;&#xC2E4;&#xD558;&#xC9C0; &#xC54A;&#xC9C0;&#xB9CC;, &#xBD84;&#xC11D;&#xC801; &#xAE30;&#xC220;&#xC5D0;&#xC11C; &#xCC3E;&#xC544;&#xBCFC; &#xC218; &#xC788;&#xB2E4;&#xACE0; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xC989;, &#xBB34;&#xC5C7;&#xC744; &#xC120;&#xD0DD;&#xD560; &#xAC83;&#xC778;&#xC9C0;, &#xD53C;&#xB4DC;&#xBC31;&#xC5D0; &#xB530;&#xB77C; &#xBB34;&#xC5C7;&#xC744; &#xBCC0;&#xACBD;&#xD560; &#xAC83;&#xC778;&#xC9C0;, &#xC774;&#xC0C1;&#xD55C; &#xBE44;&#xC720;&#xB97C; &#xCC3E;&#xC544;&#xB0B4;&#xB294; &#xAC83;, &#xC544;&#xBB34;&#xB3C4; &#xC5F0;&#xACB0;&#xD574;&#xBCFC; &#xC0DD;&#xAC01;&#xC744; &#xD558;&#xC9C0; &#xC54A;&#xC740; &#xC774;&#xC0C1;&#xD55C; &#xAC83;&#xB4E4;&#xC744; &#xC5F0;&#xACB0;&#xD558;&#xB294; &#xAC83; &#xB4F1;&#xC774; &#xC911;&#xC694;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC774; &#xC0C8;&#xB85C;&#xC6B4; &#xC138;&#xC0C1;&#xC5D0;&#xC11C; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xD574;&#xACB0;&#xCC45;&#xC744; &#xCC3D;&#xCD9C;&#xD558;&#xB294; &#xD569;&#xC131;&#xC801;&#xC778; &#xAE30;&#xC220;&#xC740; &#xAC00;&#xCE58;&#xAC00; &#xB5A8;&#xC5B4;&#xC9C0;&#xC9C0;&#xB9CC;, &#xBB38;&#xC81C;&#xC640; &#xD574;&#xACB0;&#xCC45;&#xC744; &#xBD84;&#xC11D;&#xD558;&#xB294; &#xAE30;&#xC220;&#xC740; &#xAC00;&#xCE58;&#xAC00; &#xD06C;&#xAC8C; &#xC0C1;&#xC2B9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC800;&#xC790;&#xC758; &#xC544;&#xBC84;&#xC9C0;&#xB294; &#xC5B4;&#xC148;&#xBE14;&#xB9AC; &#xC5B8;&#xC5B4;&#xC5D0;&#xC11C; C &#xC5B8;&#xC5B4;&#xB85C; &#xB118;&#xC5B4;&#xAC14;&#xACE0;, &#xADF8;&#xB294; &#xC5EC;&#xC804;&#xD788; &#xAC19;&#xC740; &#xC885;&#xB958;&#xC758; &#xB9C8;&#xC774;&#xD06C;&#xB85C; &#xCEE8;&#xD2B8;&#xB864;&#xB7EC; &#xCF54;&#xB4DC; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD588;&#xC9C0;&#xB9CC;, &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB294; &#xADF8;&#xAC00; &#xB354; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xC791;&#xC5C5;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB294; &apos;&#xC5B4;&#xB5BB;&#xAC8C;&apos;&#xD558;&#xB294; &#xAE30;&#xC220;&#xC744; &#xD3EC;&#xAE30;&#xD558;&#xACE0; &apos;&#xBB34;&#xC5C7;&apos;&#xC5D0; &#xB354; &#xC9D1;&#xC911;&#xD558;&#xB3C4;&#xB85D; &#xBC30;&#xC6E0;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC774; &#xC774;&#xC57C;&#xAE30;&#xC758; &#xC544;&#xC774;&#xB7EC;&#xB2C8;&#xD55C; &#xACB0;&#xB9D0;&#xC740;, &#xC800;&#xC790;&#xAC00; &#xB300;&#xD559;&#xC744; &#xC878;&#xC5C5;&#xD558;&#xACE0; &#xAC1D;&#xCCB4; &#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774; &#xB300;&#xC138;&#xAC00; &#xB418;&#xC5C8;&#xC744; &#xB54C;, &#xADF8;&#xC758; &#xC544;&#xBC84;&#xC9C0;&#xB294; &#xAC1D;&#xCCB4; &#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC774;&#xD574;&#xD558;&#xB824;&#xACE0; &#xC2DC;&#xB3C4;&#xD588;&#xC9C0;&#xB9CC; &#xC2E4;&#xD328;&#xD588;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB294; &#xB9C8;&#xC774;&#xD06C;&#xB85C; &#xCEE8;&#xD2B8;&#xB864;&#xB7EC;&#xB97C; C&#xB85C; &#xACC4;&#xC18D; &#xC791;&#xC131;&#xD588;&#xACE0;, &#xACB0;&#xAD6D; &#xC218;&#xC694;&#xAC00; &#xC0AC;&#xB77C;&#xC9C0;&#xACE0; &#xADF8;&#xB294; &#xC740;&#xD1F4;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded></item><item><title><![CDATA[시계열 예측모델 ARIMA와 LSTM]]></title><description><![CDATA[<p>ARIMA (Autoregressive Integrated Moving Average)&#xC640; LSTM (Long Short-Term Memory)&#xC740; &#xB450; &#xAC00;&#xC9C0; &#xC8FC;&#xC694; &#xC2DC;&#xACC4;&#xC5F4; &#xC608;&#xCE21; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC774; &#xB450; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC740; &#xC0AC;&#xC6A9; &#xBC29;&#xBC95;, &#xAD6C;&#xC870;, &#xADF8;&#xB9AC;&#xACE0; &#xB3D9;&#xC791; &#xBC29;</p>]]></description><link>https://blog.midagedev.com/arima-vs-lstm/</link><guid isPermaLink="false">64b690482e1df90c093717ad</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Tue, 18 Jul 2023 13:15:21 GMT</pubDate><content:encoded><![CDATA[<p>ARIMA (Autoregressive Integrated Moving Average)&#xC640; LSTM (Long Short-Term Memory)&#xC740; &#xB450; &#xAC00;&#xC9C0; &#xC8FC;&#xC694; &#xC2DC;&#xACC4;&#xC5F4; &#xC608;&#xCE21; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC774; &#xB450; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC740; &#xC0AC;&#xC6A9; &#xBC29;&#xBC95;, &#xAD6C;&#xC870;, &#xADF8;&#xB9AC;&#xACE0; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC5D0;&#xC11C; &#xAF64; &#xB9CE;&#xC740; &#xCC28;&#xC774;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ol><li><strong>&#xBAA8;&#xB378; &#xD0C0;&#xC785;</strong>: ARIMA&#xB294; &#xD1B5;&#xACC4; &#xAE30;&#xBC18;&#xC758; &#xC120;&#xD615; &#xBAA8;&#xB378;&#xC785;&#xB2C8;&#xB2E4;. &#xC2DC;&#xACC4;&#xC5F4;&#xC758; &#xD328;&#xD134;&#xC744; &#xC778;&#xC2DD;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBBF8;&#xB798; &#xAC12;&#xC744; &#xC608;&#xCE21;&#xD558;&#xB294;&#xB370;, &#xC790;&#xAE30; &#xC0C1;&#xAD00;&#xC131;&#xC774; &#xC788;&#xB294; &#xC120;&#xD615; &#xC2DC;&#xACC4;&#xC5F4; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xC801;&#xD569;&#xD569;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74;&#xC5D0; LSTM&#xC740; &#xC778;&#xACF5;&#xC2E0;&#xACBD;&#xB9DD;&#xC758; &#xD55C; &#xC885;&#xB958;&#xB85C;, &#xBE44;&#xC120;&#xD615; &#xD328;&#xD134;&#xC744; &#xD559;&#xC2B5;&#xD558;&#xACE0; &#xBCF5;&#xC7A1;&#xD55C; &#xC2DC;&#xACC4;&#xC5F4; &#xB370;&#xC774;&#xD130;&#xC5D0;&#xC11C; &#xB354;&#xC6B1; &#xD6A8;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xC791;&#xB3D9;&#xD569;&#xB2C8;&#xB2E4;.</li><li><strong>&#xC2DC;&#xAC04; &#xC758;&#xC874;&#xC131;</strong>: ARIMA&#xB294; &#xACE0;&#xC815;&#xB41C; &#xC2DC;&#xAC04; &#xCC3D;(window) &#xB0B4;&#xC5D0;&#xC11C;&#xB9CC; &#xC758;&#xC874;&#xC131;&#xC744; &#xC778;&#xC2DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, &#xCC3D;&#xC758; &#xD06C;&#xAE30;&#xAC00; &#xB108;&#xBB34; &#xCEE4;&#xC9C0;&#xBA74; &#xBAA8;&#xB378;&#xC758; &#xC131;&#xB2A5;&#xC774; &#xC800;&#xD558;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74;&#xC5D0; LSTM&#xC740; &quot;&#xC7A5;&#xAE30; &#xC758;&#xC874;&#xC131;&quot; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC124;&#xACC4;&#xB418;&#xC5C8;&#xC73C;&#xBA70;, &#xC7A5;&#xAE30;&#xC801;&#xC778; &#xC758;&#xC874;&#xC131;&#xC744; &#xAC00;&#xC9C4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xB370; &#xB354;&#xC6B1; &#xC720;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.</li><li><strong>&#xB370;&#xC774;&#xD130; &#xC804;&#xCC98;&#xB9AC;</strong>: ARIMA&#xB294; &#xC815;&#xC0C1; &#xC0C1;&#xD0DC;&#xC758; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD544;&#xC694;&#xB85C; &#xD569;&#xB2C8;&#xB2E4;. &#xC989;, &#xB370;&#xC774;&#xD130;&#xAC00; &#xC77C;&#xC815;&#xD55C; &#xD3C9;&#xADE0;&#xACFC; &#xBD84;&#xC0B0;&#xC744; &#xAC00;&#xC838;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC704;&#xD574; &#xC885;&#xC885; &#xCC28;&#xBD84;(differencing)&#xC774;&#xB098; &#xBCC0;&#xD658;(transformation)&#xACFC; &#xAC19;&#xC740; &#xC804;&#xCC98;&#xB9AC; &#xB2E8;&#xACC4;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. LSTM&#xC740; &#xC774;&#xB7EC;&#xD55C; &#xC804;&#xCC98;&#xB9AC; &#xACFC;&#xC815;&#xC774; &#xD544;&#xC218;&#xC801;&#xC774;&#xC9C0;&#xB294; &#xC54A;&#xC9C0;&#xB9CC;, &#xC885;&#xC885; &#xB370;&#xC774;&#xD130;&#xC758; &#xC2A4;&#xCF00;&#xC77C;&#xB9C1;&#xC774; &#xD544;&#xC694;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li><strong>&#xD559;&#xC2B5; &#xC2DC;&#xAC04;</strong>: LSTM&#xC740; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; ARIMA&#xBCF4;&#xB2E4; &#xD559;&#xC2B5; &#xC2DC;&#xAC04;&#xC774; &#xB354; &#xAE38;&#xB2E4;. LSTM&#xC740; &#xBE44;&#xC120;&#xD615;&#xC801;&#xC778; &#xD2B9;&#xC9D5;&#xC744; &#xD559;&#xC2B5;&#xD558;&#xACE0;, &#xC774;&#xB97C; &#xC704;&#xD574; &#xB354; &#xB9CE;&#xC740; &#xD30C;&#xB77C;&#xBBF8;&#xD130;&#xB97C; &#xD559;&#xC2B5;&#xD574;&#xC57C; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</li><li><strong>&#xD574;&#xC11D; &#xAC00;&#xB2A5;&#xC131;</strong>: ARIMA &#xBAA8;&#xB378;&#xC758; &#xC7A5;&#xC810; &#xC911; &#xD558;&#xB098;&#xB294; &#xADF8; &#xACB0;&#xACFC;&#xB97C; &#xD574;&#xC11D;&#xD558;&#xB294; &#xB370; &#xC788;&#xC5B4;&#xC11C;&#xC758; &#xBA85;&#xD655;&#xC131;&#xC785;&#xB2C8;&#xB2E4;. ARIMA &#xBAA8;&#xB378;&#xC758; &#xACC4;&#xC218;&#xB294; &#xD1B5;&#xACC4;&#xC801;&#xC73C;&#xB85C; &#xC758;&#xBBF8;&#xB97C; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74;&#xC5D0; LSTM&#xC740; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &apos;&#xBE14;&#xB799;&#xBC15;&#xC2A4;&apos; &#xBAA8;&#xB378;&#xB85C; &#xC5EC;&#xACA8;&#xC9C0;&#xBA70;, &#xC774;&#xB294; &#xADF8;&#xB4E4;&#xC758; &#xB0B4;&#xBD80; &#xC791;&#xB3D9; &#xBC29;&#xC2DD;&#xC744; &#xC774;&#xD574;&#xD558;&#xAC70;&#xB098; &#xC124;&#xBA85;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC5B4;&#xB835;&#xB2E4;&#xB294; &#xC758;&#xBBF8;&#xC785;&#xB2C8;&#xB2E4;.</li></ol><p>&#xC774;&#xB7EC;&#xD55C; &#xCC28;&#xC774;&#xC810;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0;, ARIMA&#xC640; LSTM &#xBAA8;&#xB450; &#xC2DC;&#xACC4;&#xC5F4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB2E4;&#xB8E8;&#xB294; &#xB370; &#xC720;&#xC6A9;&#xD55C; &#xB3C4;&#xAD6C;&#xC785;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB5A4; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC774; &#xAC00;&#xC7A5; &#xC801;&#xD569;&#xD55C;&#xC9C0;&#xB294; &#xBB38;&#xC81C;&#xC758; &#xD2B9;&#xC131;, &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xB370;&#xC774;&#xD130;, &#xADF8;&#xB9AC;&#xACE0; &#xD2B9;&#xC815; &#xC791;&#xC5C5;&#xC5D0; &#xB300;&#xD55C; &#xC694;&#xAD6C; &#xC0AC;&#xD56D;&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9D1;&#xB2C8;&#xB2E4;.</p>]]></content:encoded></item><item><title><![CDATA[django viewset에서 create와 perform_create의 차이]]></title><description><![CDATA[<p><code>Django REST Framework</code>&#xC5D0;&#xC11C; <code>ViewSet</code>&#xC740; API &#xB85C;&#xC9C1;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. <code>ViewSet</code>&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC8FC;&#xC694; &#xBA54;&#xC11C;&#xB4DC; &#xC911; &#xB450; &#xAC00;&#xC9C0;&#xC778; <code>create</code>&#xC640; <code>perform_create</code>&#xC5D0;&#xB294; &#xBA85;&#xD655;&#xD55C; &#xCC28;</p>]]></description><link>https://blog.midagedev.com/django-preform-create/</link><guid isPermaLink="false">64b68ed82e1df90c09371795</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Tue, 18 Jul 2023 13:11:40 GMT</pubDate><content:encoded><![CDATA[<p><code>Django REST Framework</code>&#xC5D0;&#xC11C; <code>ViewSet</code>&#xC740; API &#xB85C;&#xC9C1;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. <code>ViewSet</code>&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC8FC;&#xC694; &#xBA54;&#xC11C;&#xB4DC; &#xC911; &#xB450; &#xAC00;&#xC9C0;&#xC778; <code>create</code>&#xC640; <code>perform_create</code>&#xC5D0;&#xB294; &#xBA85;&#xD655;&#xD55C; &#xCC28;&#xC774;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li><code>create</code>&#xB294; <code>POST</code> &#xC694;&#xCCAD;&#xC774; &#xB4E4;&#xC5B4;&#xC654;&#xC744; &#xB54C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xBDF0;&#xC758; &#xB85C;&#xC9C1;&#xC785;&#xB2C8;&#xB2E4;. <code>request</code> &#xAC1D;&#xCCB4;&#xB97C; &#xBC1B;&#xC544; &#xD574;&#xB2F9; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC0C8;&#xB85C;&#xC6B4; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0;, &#xC751;&#xB2F5;&#xC744; &#xB9AC;&#xD134;&#xD558;&#xB294; &#xB85C;&#xC9C1;&#xC744; &#xD3EC;&#xD568;&#xD569;&#xB2C8;&#xB2E4;. <code>create</code> &#xBA54;&#xC11C;&#xB4DC;&#xB294; API &#xC694;&#xCCAD;&#xC5D0; &#xB300;&#xD55C; &#xC804;&#xCCB4;&#xC801;&#xC778; &#xD750;&#xB984;&#xC744; &#xB2F4;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</li><li>&#xBC18;&#xBA74;, <code>perform_create</code>&#xB294; <code>create</code>&#xAC00; &#xC9C4;&#xD589;&#xB418;&#xB294; &#xACFC;&#xC815; &#xC911;, &#xC2E4;&#xC81C;&#xB85C; &#xC0C8;&#xB85C;&#xC6B4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. <code>perform_create</code> &#xBA54;&#xC11C;&#xB4DC;&#xC5D0;&#xB294; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C; <code>request</code> &#xAC1D;&#xCCB4;&#xB97C; &#xB118;&#xACA8;&#xBC1B;&#xC9C0; &#xC54A;&#xACE0;, <code>create</code>&#xB85C;&#xBD80;&#xD130; &#xC804;&#xB2EC;&#xBC1B;&#xC740; serializer&#xC640; <code>validated_data</code>&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</li></ul><p>&#xC989;, <code>create</code> &#xBA54;&#xC11C;&#xB4DC;&#xAC00; &#xC804;&#xCCB4;&#xC801;&#xC778; &#xC0DD;&#xC131; &#xD750;&#xB984;&#xC744; &#xB2F4;&#xB2F9;&#xD558;&#xB294; &#xBC18;&#xBA74;, <code>perform_create</code>&#xB294; &#xADF8; &#xACFC;&#xC815; &#xC911; &#xB370;&#xC774;&#xD130; &#xC800;&#xC7A5;&#xC5D0; &#xC9D1;&#xC911;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC774;&#xB7EC;&#xD55C; &#xAD6C;&#xC870;&#xB294; &#xCF54;&#xB4DC;&#xC758; &#xBAA8;&#xB4C8;&#xD654;&#xC640; &#xC7AC;&#xC0AC;&#xC6A9;&#xC131;&#xC744; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0A4;&#xBA70;, &#xD544;&#xC694;&#xC5D0; &#xB530;&#xB77C; <code>perform_create</code>&#xB97C; &#xC624;&#xBC84;&#xB77C;&#xC774;&#xB4DC;&#xD558;&#xBA74; <code>create</code> &#xBA54;&#xC11C;&#xB4DC;&#xC758; &#xD750;&#xB984;&#xC740; &#xADF8;&#xB300;&#xB85C; &#xC720;&#xC9C0;&#xD558;&#xBA74;&#xC11C; &#xB370;&#xC774;&#xD130; &#xC800;&#xC7A5; &#xBC29;&#xC2DD;&#xB9CC;&#xC744; &#xBCC0;&#xACBD;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xC720;&#xC5F0;&#xD55C; &#xCEE4;&#xC2A4;&#xD130;&#xB9C8;&#xC774;&#xC9D5;&#xC744; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;.</p><pre><code class="language-python">from rest_framework import viewsets, status
from rest_framework.response import Response
from .serializers import YourModelSerializer
from .models import YourModel

class YourModelViewSet(viewsets.ModelViewSet):
    queryset = YourModel.objects.all()
    serializer_class = YourModelSerializer

    def create(self, request, *args, **kwargs):
        serializer = self.get_serializer(data=request.data)
        if serializer.is_valid(raise_exception=True):
            self.perform_create(serializer)
            return Response(serializer.data, status=status.HTTP_201_CREATED)

    def perform_create(self, serializer):
        # &#xC5EC;&#xAE30;&#xC5D0;&#xC11C; &#xC2E4;&#xC81C;&#xB85C; &#xBAA8;&#xB378; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.
        serializer.save()
</code></pre><p>&#xC704; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; <code>create</code> &#xBA54;&#xC11C;&#xB4DC;&#xC5D0;&#xC11C; &#xBA3C;&#xC800; &#xC694;&#xCCAD;&#xB41C; &#xB370;&#xC774;&#xD130;(<code>request.data</code>)&#xB97C; serializer&#xB97C; &#xD1B5;&#xD574; &#xAC80;&#xC99D;(<code>is_valid()</code>)&#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xAC80;&#xC99D;&#xC774; &#xC131;&#xACF5;&#xD558;&#xBA74;, <code>perform_create</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xD1B5;&#xD574; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC2E4;&#xC81C;&#xB85C; &#xC800;&#xC7A5;&#xD558;&#xACE0;, &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xC0DD;&#xC131;&#xB418;&#xC5C8;&#xB2E4;&#xB294; &#xC751;&#xB2F5;&#xC744; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;.</p><p><code>perform_create</code>&#xB294; serializer&#xC758; <code>save</code> &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC5EC; &#xC2E4;&#xC81C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. &#xD544;&#xC694;&#xC5D0; &#xB530;&#xB77C; &#xC774; &#xBD80;&#xBD84;&#xC744; &#xC624;&#xBC84;&#xB77C;&#xC774;&#xB4DC;&#xD558;&#xC5EC; &#xD2B9;&#xC815; &#xB85C;&#xC9C1;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xAC70;&#xB098; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded></item><item><title><![CDATA[commonjs is not going away]]></title><description><![CDATA[<p><a href="https://blog.midagedev.com/commonjs-is-hurting-javascript/?ref=localhost">&#xC55E;&#xC11C; deno&#xC758; &#xAE00;</a>&#xACFC;&#xB294; &#xC0C1;&#xBC18;&#xB41C; &#xC785;&#xC7A5;&#xC758; <a href="https://bun.sh/blog/commonjs-is-not-going-away?ref=localhost">bun&#xC758; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; &#xC62C;&#xB77C;&#xC628; &#xAE00;</a> &#xC694;&#xC57D; from chatgpt</p><p>&quot;CommonJS is not going away&quot;&#xB77C;&#xB294; &#xC81C;&#xBAA9;&#xC758; &#xAE30;&#xC0AC;&#xB294; CommonJS&#xAC00; &#xC5EC;&#xC804;&#xD788; &#xC720;&#xC9C0;&#xB420;</p>]]></description><link>https://blog.midagedev.com/commonjs-is-not-going-away/</link><guid isPermaLink="false">64b177132e1df90c09371784</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Fri, 14 Jul 2023 16:27:18 GMT</pubDate><content:encoded><![CDATA[<p><a href="https://blog.midagedev.com/commonjs-is-hurting-javascript/?ref=localhost">&#xC55E;&#xC11C; deno&#xC758; &#xAE00;</a>&#xACFC;&#xB294; &#xC0C1;&#xBC18;&#xB41C; &#xC785;&#xC7A5;&#xC758; <a href="https://bun.sh/blog/commonjs-is-not-going-away?ref=localhost">bun&#xC758; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; &#xC62C;&#xB77C;&#xC628; &#xAE00;</a> &#xC694;&#xC57D; from chatgpt</p><p>&quot;CommonJS is not going away&quot;&#xB77C;&#xB294; &#xC81C;&#xBAA9;&#xC758; &#xAE30;&#xC0AC;&#xB294; CommonJS&#xAC00; &#xC5EC;&#xC804;&#xD788; &#xC720;&#xC9C0;&#xB420; &#xAC83;&#xC774;&#xBA70;, &#xC774;&#xB294; &#xAD1C;&#xCC2E;&#xC740; &#xC77C;&#xC774;&#xB77C;&#xACE0; &#xB9D0;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. CommonJS&#xB294; 2009&#xB144;&#xC5D0; &#xAC1C;&#xBC1C;&#xB418;&#xC5B4; Node.js&#xC5D0; &#xC758;&#xD574; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBAA8;&#xB4C8; &#xD615;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74; ECMAScript &#xBAA8;&#xB4C8;(ES &#xBAA8;&#xB4C8;)&#xC740; 2015&#xB144;&#xC5D0; &#xB3C4;&#xC785;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. ES &#xBAA8;&#xB4C8;&#xC740; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC5D0;&#xC11C; &#xC791;&#xB3D9;&#xD558;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB418;&#xC5C8;&#xC73C;&#xBA70;, &#xD30C;&#xC77C;&#xC774; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xD1B5;&#xD574; &#xB85C;&#xB4DC;&#xB41C;&#xB2E4;&#xB294; &#xC810;&#xC5D0;&#xC11C; &#xBE44;&#xB3D9;&#xAE30;&#xC801;&#xC785;&#xB2C8;&#xB2E4;.</p><p>CommonJS&#xC758; &#xC7A5;&#xC810; &#xC911; &#xD558;&#xB098;&#xB294; &#xB354; &#xBE60;&#xB978; &#xC2DC;&#xC791; &#xC2DC;&#xAC04;&#xC785;&#xB2C8;&#xB2E4;. &#xD070; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xACBD;&#xC6B0; ES &#xBAA8;&#xB4C8;&#xBCF4;&#xB2E4; CommonJS&#xAC00; &#xB354; &#xBE60;&#xB974;&#xAC8C; &#xC2DC;&#xC791;&#xB429;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; CommonJS&#xB294; &#xB3D9;&#xC801; &#xBAA8;&#xB4C8; &#xB85C;&#xB529;&#xC744; &#xD5C8;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD50C;&#xB7EC;&#xADF8;&#xC778; &#xC2DC;&#xC2A4;&#xD15C;&#xC774;&#xB098; &#xC0AC;&#xC6A9;&#xC790; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xC5D0; &#xAE30;&#xBC18;&#xD55C; &#xD2B9;&#xC815; &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xC758; &#xC9C0;&#xC5F0; &#xB85C;&#xB529;&#xACFC; &#xAC19;&#xC740; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xC5D0;&#xC11C; &#xC720;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xB610;&#xD55C; npm&#xC5D0; &#xC774;&#xBBF8; &#xC218;&#xBC31;&#xB9CC; &#xAC1C;&#xC758; CommonJS &#xBAA8;&#xB4C8;&#xC774; &#xAC8C;&#xC2DC;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70;, &#xC774; &#xC911; &#xB9CE;&#xC740; &#xBAA8;&#xB4C8;&#xC740; &#xB354; &#xC774;&#xC0C1; &#xD65C;&#xBC1C;&#xD788; &#xC720;&#xC9C0;&#xB418;&#xC9C0; &#xC54A;&#xC9C0;&#xB9CC; &#xAE30;&#xC874; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xB9E4;&#xC6B0; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xBAA8;&#xB4E0; &#xD328;&#xD0A4;&#xC9C0;&#xAC00; ES &#xBAA8;&#xB4C8;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB3C4;&#xB85D; &#xAE30;&#xB300;&#xD560; &#xC218;&#xB294; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Bun&#xC740; &#xCD5C;&#xADFC; &#xBC84;&#xC804;&#xC5D0;&#xC11C; CommonJS&#xB97C; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xAD6C;&#xD604;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70;, CommonJS &#xD30C;&#xC77C;&#xC744; &#xD2B9;&#xBCC4;&#xD55C; &quot;&#xB3D9;&#xAE30;&#xC2DD; ESM&quot; &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xBCC0;&#xD658;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, Bun&#xC740; &#xCD5C;&#xADFC;&#xC5D0; __esModule &#xC8FC;&#xC11D;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC744; &#xCD94;&#xAC00;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; CommonJS &#xBAA8;&#xB4C8;&#xC774; exports.default&#xB97C; &#xAE30;&#xBCF8; &#xB0B4;&#xBCF4;&#xB0B4;&#xAE30;&#xB85C; &#xD574;&#xC11D;&#xD574;&#xC57C; &#xD568;&#xC744; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xBE44;&#xACF5;&#xC2DD;&#xC801;&#xC778; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xACB0;&#xB860;&#xC801;&#xC73C;&#xB85C;, CommonJS&#xB294; &#xC774;&#xBBF8; &#xC5EC;&#xAE30;&#xC5D0; &#xC788;&#xC73C;&#xBA70; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xC774;&#xC720;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Bun&#xC740; CommonJS&#xB97C; &#xC911;&#xC694;&#xD558;&#xAC8C; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xBA70;, &#xC774;&#xB97C; &#xD604;&#xB300;&#xC801;&#xC778; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC9C0;&#xC6D0;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded></item><item><title><![CDATA[commonjs is hurting javascript]]></title><description><![CDATA[<p><a href="https://deno.com/blog/commonjs-is-hurting-javascript?ref=localhost">deno&#xC5D0;&#xC11C; &#xC791;&#xC131;&#xD55C; commonjs&#xAC00; &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xC0DD;&#xD0DC;&#xACC4;&#xC5D0; &#xC545;&#xC601;&#xD5A5;&#xC744; &#xC900;&#xB2E4;&#xB294; &#xB0B4;&#xC6A9;&#xC758; &#xBE14;&#xB85C;&#xADF8; &#xAE00;</a>&#xC5D0; &#xB300;&#xD55C; &#xC694;&#xC57D; from chatgpt</p><p>&quot;CommonJS is hurting JavaScript&quot;&#xB77C;&#xB294; &#xC81C;&#xBAA9;&#xC758;</p>]]></description><link>https://blog.midagedev.com/commonjs-is-hurting-javascript/</link><guid isPermaLink="false">64b175332e1df90c09371753</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Fri, 14 Jul 2023 16:22:43 GMT</pubDate><content:encoded><![CDATA[<p><a href="https://deno.com/blog/commonjs-is-hurting-javascript?ref=localhost">deno&#xC5D0;&#xC11C; &#xC791;&#xC131;&#xD55C; commonjs&#xAC00; &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xC0DD;&#xD0DC;&#xACC4;&#xC5D0; &#xC545;&#xC601;&#xD5A5;&#xC744; &#xC900;&#xB2E4;&#xB294; &#xB0B4;&#xC6A9;&#xC758; &#xBE14;&#xB85C;&#xADF8; &#xAE00;</a>&#xC5D0; &#xB300;&#xD55C; &#xC694;&#xC57D; from chatgpt</p><p>&quot;CommonJS is hurting JavaScript&quot;&#xB77C;&#xB294; &#xC81C;&#xBAA9;&#xC758; &#xAE30;&#xC0AC;&#xB294; JavaScript&#xC758; &#xBC1C;&#xC804;&#xC744; &#xC800;&#xD574;&#xD558;&#xB294; &#xC694;&#xC778;&#xC73C;&#xB85C; CommonJS &#xBAA8;&#xB4C8; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xC9C0;&#xBAA9;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC694;&#xC57D;&#xD558;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li>JavaScript&#xB294; &#xC6F9; &#xAC1C;&#xBC1C;&#xC5D0;&#xC11C; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC5B8;&#xC5B4;&#xB85C;, &#xADF8;&#xB7EC;&#xB098; &#xACFC;&#xAC70;&#xC758; &#xC720;&#xC0B0;&#xC778; CommonJS&#xB85C; &#xC778;&#xD574; &#xBC1C;&#xC804;&#xC774; &#xC800;&#xD574;&#xB418;&#xACE0; &#xC788;&#xB2E4;.</li><li>CommonJS&#xB294; &#xC57D; 15&#xB144; &#xC804;&#xC5D0; JavaScript&#xAC00; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB97C; &#xB118;&#xC5B4; &#xC11C;&#xBC84; &#xCE21;&#xC73C;&#xB85C; &#xD655;&#xC7A5;&#xB418;&#xBA74;&#xC11C; &#xB4F1;&#xC7A5;&#xD588;&#xB2E4;. &#xB2F9;&#xC2DC; JavaScript&#xB294; &#xC18C;&#xC2A4; &#xCF54;&#xB4DC;&#xB97C; &#xB354; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xAD00;&#xB9AC;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC5C8;&#xACE0;, &#xC774;&#xB97C; &#xC704;&#xD574; &#xBAA8;&#xB4C8;&#xD654;&#xAC00; &#xD544;&#xC694;&#xD588;&#xB2E4;.</li><li>CommonJS&#xB294; Node.js&#xC758; &#xBAA8;&#xB4C8; &#xC2DC;&#xC2A4;&#xD15C;&#xC73C;&#xB85C; &#xCC44;&#xD0DD;&#xB418;&#xC5C8;&#xC73C;&#xBA70;, <code>require()</code>, <code>module.exports</code> &#xB4F1;&#xC758; &#xBB38;&#xBC95;&#xC744; &#xC81C;&#xACF5;&#xD588;&#xB2E4;. &#xC774;&#xB294; &#xC11C;&#xBC84; &#xCE21; &#xCF54;&#xB4DC;&#xC640; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xCE21; &#xCF54;&#xB4DC;&#xC758; &#xC694;&#xAD6C; &#xC0AC;&#xD56D;&#xC774; &#xB2E4;&#xB974;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC778;&#xC2DD;&#xD55C; &#xACB0;&#xACFC;&#xC600;&#xB2E4;.</li><li>&#xADF8;&#xB7EC;&#xB098; CommonJS&#xC5D0;&#xB294; &#xBA87; &#xAC00;&#xC9C0; &#xBB38;&#xC81C;&#xC810;&#xC774; &#xC788;&#xC5C8;&#xB2E4;. &#xBAA8;&#xB4C8; &#xB85C;&#xB529;&#xC774; &#xB3D9;&#xAE30;&#xC2DD;&#xC774;&#xC5C8;&#xACE0;, &#xD2B8;&#xB9AC; &#xC250;&#xC774;&#xD0B9;(tree shaking)&#xC774; &#xC5B4;&#xB824;&#xC6CC; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xBAA8;&#xB4C8;&#xC744; &#xC81C;&#xAC70;&#xD558;&#xB294;&#xB370; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xC5C8;&#xB2E4;. &#xB610;&#xD55C; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC640; &#xB124;&#xC774;&#xD2F0;&#xBE0C;&#xB85C; &#xD638;&#xD658;&#xB418;&#xC9C0; &#xC54A;&#xC544; &#xBC88;&#xB4E4;&#xB7EC;&#xC640; &#xD2B8;&#xB79C;&#xC2A4;&#xD30C;&#xC77C;&#xB7EC;&#xAC00; &#xD544;&#xC694;&#xD588;&#xB2E4;.</li><li>2013&#xB144;&#xACBD;, TC39 &#xC704;&#xC6D0;&#xD68C;&#xB294; CommonJS &#xBAA8;&#xB4C8;&#xC758; &#xD6C4;&#xC18D; &#xBC84;&#xC804;&#xC73C;&#xB85C; ECMAScript &#xBAA8;&#xB4C8;(ESM)&#xC744; &#xAC1C;&#xBC1C;&#xD558;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xB2E4;. ESM&#xC740; &#xC6F9;&#xC744; &#xC704;&#xD574; &#xCD5C;&#xC801;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70;, &#xBE44;&#xB3D9;&#xAE30; &#xBAA8;&#xB4C8; &#xB85C;&#xB529;, &#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xD638;&#xD658;&#xC131;, &#xC815;&#xC801; &#xBD84;&#xC11D;, &#xD2B8;&#xB9AC; &#xC250;&#xC774;&#xD0B9; &#xB4F1;&#xC744; &#xC9C0;&#xC6D0;&#xD55C;&#xB2E4;.</li><li>Node.js&#xB294; CommonJS&#xC640; ESM&#xC744; &#xBAA8;&#xB450; &#xC9C0;&#xC6D0;&#xD558;&#xAE30;&#xB85C; &#xACB0;&#xC815;&#xD588;&#xC73C;&#xB098;, &#xB450; &#xC2DC;&#xC2A4;&#xD15C; &#xAC04;&#xC758; &#xC0C1;&#xD638; &#xC6B4;&#xC6A9;&#xC131;&#xC5D0; &#xB300;&#xD55C; &#xBA85;&#xD655;&#xD55C; &#xD569;&#xC758;&#xC5D0;&#xB294; &#xB3C4;&#xB2EC;&#xD558;&#xC9C0; &#xBABB;&#xD588;&#xB2E4;.</li><li>&#xAE30;&#xC0AC;&#xB294; 2023&#xB144; &#xD604;&#xC7AC;, CommonJS&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xAC83;&#xC774; &#xB354; &#xC774;&#xC0C1; &#xBB34;&#xC2DC;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xBB38;&#xC81C;&#xAC00; &#xB418;&#xC5C8;&#xC73C;&#xBA70;, ESM&#xC73C;&#xB85C; &#xC644;&#xC804;&#xD788; &#xC804;&#xD658;&#xD560; &#xC2DC;&#xC810;&#xC774;&#xB77C;&#xACE0; &#xC8FC;&#xC7A5;&#xD55C;&#xB2E4;. ESM&#xC740; &#xAC1C;&#xBC1C;&#xC790;&#xC5D0;&#xAC8C; &#xB354; &#xB098;&#xC740; &#xC194;&#xB8E8;&#xC158;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xBA70;, &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C;&#xB3C4; &#xB354; &#xB098;&#xC740; &#xACBD;&#xD5D8;&#xC744; &#xC81C;&#xACF5;&#xD55C;&#xB2E4;.</li></ul><hr><h2 id="commonjs%EC%99%80-esm%EC%9D%98-%EB%B9%84%EA%B5%90">commonjs&#xC640; esm&#xC758; &#xBE44;&#xAD50;</h2><p>CommonJS&#xC640; ECMAScript Modules(ESM)&#xC740; JavaScript &#xBAA8;&#xB4C8; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xB450; &#xAC00;&#xC9C0; &#xC8FC;&#xC694; &#xD615;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;. &#xAC01;&#xAC01;&#xC758; &#xD2B9;&#xC9D5;&#xACFC; &#xCC28;&#xC774;&#xC810;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><strong>&#xC815;&#xC758; &#xBC29;&#xC2DD;</strong>:</p><ul><li><strong>CommonJS</strong>: <code>module.exports</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBAA8;&#xB4C8;&#xC744; &#xB0B4;&#xBCF4;&#xB0B4;&#xACE0;, <code>require()</code> &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBAA8;&#xB4C8;&#xC744; &#xAC00;&#xC838;&#xC635;&#xB2C8;&#xB2E4;.</li></ul><pre><code class="language-javascript">// math.js
module.exports = {
  add: (a, b) =&gt; a + b,
  subtract: (a, b) =&gt; a - b
};

// app.js
const math = require(&apos;./math.js&apos;);</code></pre><ul><li><strong>ESM</strong>: <code>export</code> &#xD0A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBAA8;&#xB4C8;&#xC744; &#xB0B4;&#xBCF4;&#xB0B4;&#xACE0;, <code>import</code> &#xD0A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBAA8;&#xB4C8;&#xC744; &#xAC00;&#xC838;&#xC635;&#xB2C8;&#xB2E4;.</li></ul><pre><code class="language-javascript">// math.js
export const add = (a, b) =&gt; a + b;
export const subtract = (a, b) =&gt; a - b;

// app.js
import { add, subtract } from &apos;./math.js&apos;;</code></pre><p><strong>&#xB85C;&#xB529; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;</strong>:</p><ul><li><strong>CommonJS</strong>: &#xB3D9;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xBAA8;&#xB4C8;&#xC744; &#xB85C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC11C;&#xBC84; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xC801;&#xD569;&#xD558;&#xC9C0;&#xB9CC;, &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC5D0;&#xC11C;&#xB294; &#xC131;&#xB2A5; &#xBB38;&#xC81C;&#xB97C; &#xC77C;&#xC73C;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li><strong>ESM</strong>: &#xBE44;&#xB3D9;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xBAA8;&#xB4C8;&#xC744; &#xB85C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xB354; &#xD6A8;&#xC728;&#xC801;&#xC785;&#xB2C8;&#xB2E4;.</li></ul><p><strong>&#xD638;&#xD658;&#xC131;</strong>:</p><ul><li><strong>CommonJS</strong>: Node.js&#xC5D0;&#xC11C; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xBA70;, &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC5D0;&#xC11C;&#xB294; &#xBC88;&#xB4E4;&#xB7EC;(&#xC608;: webpack)&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xBCC0;&#xD658;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</li><li><strong>ESM</strong>: &#xCD5C;&#xC2E0; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC5D0;&#xC11C; &#xC9C1;&#xC811; &#xC9C0;&#xC6D0;&#xB418;&#xBA70;, Node.js&#xC5D0;&#xC11C;&#xB3C4; &#xC9C0;&#xC6D0;&#xB429;&#xB2C8;&#xB2E4;.</li></ul><p><strong>&#xC815;&#xC801; &#xBD84;&#xC11D;&#xACFC; &#xCD5C;&#xC801;&#xD654;</strong>:</p><ul><li><strong>CommonJS</strong>: &#xB7F0;&#xD0C0;&#xC784;&#xC5D0; &#xBAA8;&#xB4C8; &#xAD6C;&#xC870;&#xB97C; &#xD574;&#xC11D;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC774; &#xC5B4;&#xB835;&#xACE0;, &#xD2B8;&#xB9AC; &#xC250;&#xC774;&#xD0B9;&#xACFC; &#xAC19;&#xC740; &#xCD5C;&#xC801;&#xD654; &#xAE30;&#xBC95;&#xC744; &#xC801;&#xC6A9;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li><strong>ESM</strong>: &#xBAA8;&#xB4C8; &#xAD6C;&#xC870;&#xAC00; &#xC815;&#xC801;&#xC774;&#xBBC0;&#xB85C; &#xBE4C;&#xB4DC; &#xD0C0;&#xC784;&#xC5D0; &#xBD84;&#xC11D;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACE0;, &#xD2B8;&#xB9AC; &#xC250;&#xC774;&#xD0B9;&#xACFC; &#xAC19;&#xC740; &#xCD5C;&#xC801;&#xD654; &#xAE30;&#xBC95;&#xC744; &#xC801;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul><p><strong>&#xC0C1;&#xD638; &#xC6B4;&#xC6A9;&#xC131;</strong>:</p><ul><li><strong>CommonJS</strong>: ESM&#xACFC; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xD638;&#xD658;&#xB418;&#xC9C0; &#xC54A;&#xC73C;&#xBA70;, &#xBCC0;&#xD658; &#xB2E8;&#xACC4;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</li><li><strong>ESM</strong>: &#xCD5C;&#xC2E0; Node.js &#xBC84;&#xC804;&#xC5D0;&#xC11C;&#xB294; CommonJS &#xBAA8;&#xB4C8;&#xC744; &#xAC00;&#xC838;&#xC62C; &#xC218; &#xC788;&#xC73C;&#xB098;, &#xC77C;&#xBD80; &#xC81C;&#xC57D; &#xC0AC;&#xD56D;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</li></ul><p><strong>&#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC640; &#xCC44;&#xD0DD;</strong>:</p><ul><li><strong>CommonJS</strong>: &#xACFC;&#xAC70;&#xC5D0; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xC5C8;&#xC73C;&#xB098;, &#xD604;&#xC7AC;&#xB294; &#xC810;&#xCC28; ESM&#xC73C;&#xB85C; &#xC774;&#xB3D9;&#xD558;&#xB294; &#xCD94;&#xC138;&#xC785;&#xB2C8;&#xB2E4;.</li><li><strong>ESM</strong>: &#xD604;&#xB300;&#xC801;&#xC778; JavaScript &#xAC1C;&#xBC1C;&#xC5D0; &#xAD8C;&#xC7A5;&#xB418;&#xBA70;, &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xC640; &#xC0C8;&#xB85C;&#xC6B4; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC5D0;&#xC11C; &#xB110;&#xB9AC; &#xCC44;&#xD0DD;&#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul><p>&#xACB0;&#xB860;&#xC801;&#xC73C;&#xB85C;, ESM&#xC740; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC640; &#xC11C;&#xBC84; &#xBAA8;&#xB450;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30;&#xC5D0; &#xB354; &#xC801;&#xD569;&#xD558;&#xBA70;, &#xCD5C;&#xC801;&#xD654; &#xAE30;&#xBC95;&#xACFC; &#xB354; &#xB098;&#xC740; &#xBB38;&#xBC95;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. CommonJS&#xB294; &#xC5EC;&#xC804;&#xD788; &#xB9CE;&#xC740; &#xB808;&#xAC70;&#xC2DC; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC640; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xC9C0;&#xB9CC;, &#xC0C8;&#xB85C;&#xC6B4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; ESM&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded></item><item><title><![CDATA[ghost + cloudflare pages로 블로그 셋팅]]></title><description><![CDATA[<p>cloudflare&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xD55C;&#xC2DC;&#xAC04;&#xB9CC;&#xC5D0; &#xB3C4;&#xBA54;&#xC778;+&#xD638;&#xC2A4;&#xD305;+&#xBC30;&#xD3EC;+&#xC5B4;&#xB0BC;&#xB9AC;&#xD2F1;&#xC2A4; &#xC2F9; &#xBD99;&#xC778; &#xCDA9;&#xACA9;&#xC801;&#xC778; &#xACBD;&#xD5D8;</p><h3 id="%EC%8B%9C%EC%9E%91%EC%A0%90">&#xC2DC;&#xC791;&#xC810;</h3><p>chatgpt&#xC5D0;&#xC11C; &#xC8FC;&#xACE0;&#xBC1B;&#xB294; &#xC9C8;&#xBB38; &#xB2F5;&#xBCC0;&#xB4E4;</p>]]></description><link>https://blog.midagedev.com/ghost-cloudflare-pages-blog-deploy/</link><guid isPermaLink="false">64b165f82e1df90c093716d6</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Fri, 14 Jul 2023 15:35:52 GMT</pubDate><content:encoded><![CDATA[<p>cloudflare&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xD55C;&#xC2DC;&#xAC04;&#xB9CC;&#xC5D0; &#xB3C4;&#xBA54;&#xC778;+&#xD638;&#xC2A4;&#xD305;+&#xBC30;&#xD3EC;+&#xC5B4;&#xB0BC;&#xB9AC;&#xD2F1;&#xC2A4; &#xC2F9; &#xBD99;&#xC778; &#xCDA9;&#xACA9;&#xC801;&#xC778; &#xACBD;&#xD5D8;</p><h3 id="%EC%8B%9C%EC%9E%91%EC%A0%90">&#xC2DC;&#xC791;&#xC810;</h3><p>chatgpt&#xC5D0;&#xC11C; &#xC8FC;&#xACE0;&#xBC1B;&#xB294; &#xC9C8;&#xBB38; &#xB2F5;&#xBCC0;&#xB4E4;&#xC774; &#xC815;&#xD655;&#xB3C4;&#xAC00; &#xC870;&#xAE08; &#xB5A8;&#xC5B4;&#xC9C0;&#xB354;&#xB77C;&#xB3C4; &#xB098;&#xC640; &#xBE44;&#xC2B7;&#xD55C; &#xAD81;&#xAE08;&#xC99D;&#xC744; &#xAC00;&#xC9C4; &#xBD84;&#xB4E4;&#xC5D0;&#xAC8C; &#xB3C4;&#xC6C0;&#xC774; &#xB420; &#xC218; &#xC788;&#xACA0;&#xB2E4; &#xC2F6;&#xC5B4;&#xC11C; &#xC774; &#xB0B4;&#xC6A9;&#xC744; &#xACF5;&#xC720;&#xD560; &#xBE14;&#xB85C;&#xADF8;&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4;&#xBD10;&#xC57C;&#xACA0;&#xB2E4;&#xB294; &#xC0DD;&#xAC01;&#xC774; &#xB4E4;&#xC5C8;&#xC74C;</p><h3 id="%EB%AC%B4%EC%A7%80%EC%84%B1-%EB%8F%84%EB%A9%94%EC%9D%B8-%EA%B5%AC%EC%9E%85">&#xBB34;&#xC9C0;&#xC131; &#xB3C4;&#xBA54;&#xC778; &#xAD6C;&#xC785;</h3><figure class="kg-card kg-image-card"><img src="https://blog.midagedev.com/content/images/2023/07/image-1.png" class="kg-image" alt loading="lazy" width="798" height="235" srcset="https://blog.midagedev.com/content/images/size/w600/2023/07/image-1.png 600w, https://blog.midagedev.com/content/images/2023/07/image-1.png 798w" sizes="(min-width: 720px) 720px"></figure><figure class="kg-card kg-image-card"><img src="https://blog.midagedev.com/content/images/2023/07/image.png" class="kg-image" alt loading="lazy" width="540" height="597"></figure><p>chatgpt&#xC5D0;&#xAC8C; &#xB3C4;&#xBA54;&#xC778;&#xBA85;&#xC744; &#xCD94;&#xCC9C;&#xBC1B;&#xC558;&#xC74C;, midagedev&#xB77C;&#xB294; &#xD0A4;&#xC6CC;&#xB4DC;&#xAC00; &#xAD6C;&#xAE00;&#xC5D0;&#xC11C; &#xAC80;&#xC0C9;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD558;&#xACE0; &#xBC14;&#xB85C; gmail &#xACC4;&#xC815;&#xB3C4; &#xD558;&#xB098; &#xD30C;&#xACE0;, &#xB3C4;&#xBA54;&#xC778;&#xB3C4; &#xAD6C;&#xB9E4;. &#xB3C4;&#xBA54;&#xC778;&#xC740; &#xC608;&#xC804;&#xC5D0; google domains &#xC0AC;&#xC5C5; &#xC811;&#xB294;&#xB2E4;&#xB294; &#xB274;&#xC2A4;&#xC5D0; cloudflare&#xC5D0;&#xC11C; &#xCE04;&#xB77C;&#xC774;&#xCE04;&#xB77C;&#xC774; &#xD588;&#xB358; &#xAC83;&#xC774; &#xAE30;&#xC5B5;&#xB098;&#xC11C; <a href="https://www.cloudflare.com/ko-kr/products/registrar/?ref=localhost">cloudflare</a>&#xC5D0;&#xC11C; &#xAD6C;&#xC785;, 1&#xB144;&#xC5D0; 9&#xB2EC;&#xB77C; &#xC815;&#xB3C4;</p><h3 id="crm%ED%88%B4-%EC%84%A0%EC%A0%95">CRM&#xD234; &#xC120;&#xC815;</h3><p><a href="https://jekyllrb-ko.github.io/?ref=localhost">jekyll</a>&#xC774;&#xB098; <a href="https://hexo.io/ko/index.html?ref=localhost">hexo</a>&#xB294; &#xC774;&#xC804;&#xC5D0; &#xC0AC;&#xC6A9;&#xD574;&#xBD24;&#xACE0; &#xBB50; &#xC0C9;&#xB2E4;&#xB978; &#xAC83;&#xC774; &#xC5C6;&#xC744;&#xAE4C; &#xC2F6;&#xC5B4; &#xCC3E;&#xC544;&#xBCF4;&#xB2E4;&#xAC00; <a href="https://github.com/tryghost/ghost?ref=localhost">ghost</a>&#xB97C; &#xBCF4;&#xACE0; &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xAE30;&#xB85C; &#xD558;&#xC600;&#xC74C;, &#xC14B;&#xC5C5;&#xD558;&#xACE0; &#xCCAB; &#xAE00; &#xC4F0;&#xB294;&#xB370;&#xAE4C;&#xC9C0; 20&#xBD84; &#xC548;&#xAC78;&#xB838;&#xC744; &#xC815;&#xB3C4;&#xB85C; &#xBE60;&#xB974;&#xAC8C; &#xC0AC;&#xC6A9;&#xD574;&#xBCFC; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC900;&#xBE44;&#xAC00; &#xB41C; &#xD234;&#xC774;&#xC5C8;&#xB2E4;.</p><h3 id="cloudflare-pages%EC%97%90-%EB%B0%B0%ED%8F%AC-%EC%85%8B%ED%8C%85">Cloudflare Pages&#xC5D0; &#xBC30;&#xD3EC; &#xC14B;&#xD305;</h3><figure class="kg-card kg-image-card"><img src="https://blog.midagedev.com/content/images/2023/07/image-2.png" class="kg-image" alt loading="lazy" width="1295" height="682" srcset="https://blog.midagedev.com/content/images/size/w600/2023/07/image-2.png 600w, https://blog.midagedev.com/content/images/size/w1000/2023/07/image-2.png 1000w, https://blog.midagedev.com/content/images/2023/07/image-2.png 1295w" sizes="(min-width: 720px) 720px"></figure><p><a href="https://sgbarker.com/blog/how-to-host-scalable-ghost-publication-for-free/?ref=localhost">&#xC774; &#xAE00;</a>&#xC744; &#xCC38;&#xC870;&#xD558;&#xC5EC; &#xC9C4;&#xD589;&#xD558;&#xC600;&#xC74C;. ghost&#xC5D0;&#xC11C;&#xB294; SSG&#xB97C; &#xC9C1;&#xC811; &#xC9C0;&#xC6D0;&#xD574;&#xC8FC;&#xC9C0;&#xB294; &#xC54A;&#xC544;&#xC11C; &#xC774;&#xB97C; &#xB300;&#xC2E0;&#xD574;&#xC8FC;&#xB294; <a href="https://github.com/Fried-Chicken/ghost-static-site-generator?ref=localhost">ghost-static-site-generator</a>&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC5EC; static&#xD30C;&#xC77C;&#xC744; &#xB9CC;&#xB4E4;&#xACE0; github repository&#xC5D0; push&#xD55C; &#xD6C4;&#xC5D0; cloudflare&#xC758; pages&#xC640; github&#xC5F0;&#xB3D9;, &#xC774;&#xC81C; remote&#xC5D0; commit&#xC774; &#xC0DD;&#xAE38;&#xB54C;&#xB9C8;&#xB2E4; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xBC30;&#xD3EC;&#xB428;, &#xADF8;&#xB9AC;&#xACE0; &#xB3C4;&#xBA54;&#xC778; &#xC14B;&#xD305; &#xC774; &#xACFC;&#xC815;&#xC774; 10&#xBD84;&#xC774; &#xCC44; &#xC548;&#xAC78;&#xB838;&#xC744; &#xC815;&#xB3C4;&#xB85C; &#xBE60;&#xB974;&#xAC8C; &#xC9C4;&#xD589;&#xB418;&#xC5C8;&#xC74C;</p><h3 id="cloudflare-web-analytics">Cloudflare Web Analytics</h3><figure class="kg-card kg-image-card"><img src="https://blog.midagedev.com/content/images/2023/07/image-4.png" class="kg-image" alt loading="lazy" width="1329" height="922" srcset="https://blog.midagedev.com/content/images/size/w600/2023/07/image-4.png 600w, https://blog.midagedev.com/content/images/size/w1000/2023/07/image-4.png 1000w, https://blog.midagedev.com/content/images/2023/07/image-4.png 1329w" sizes="(min-width: 720px) 720px"></figure><p>&#xC5B4;&#xB0BC;&#xB9AD;&#xD2F1;&#xC2A4;&#xB3C4; &#xBB58; &#xBD99;&#xC77C;&#xAE4C; &#xD558;&#xB2E4;&#xAC00; cloudflare&#xAEC4; &#xBD99;&#xC5EC;&#xBD04;, &#xC544;.. &#xC774;&#xAC74; &#xCC38;, &#xADF8;&#xB0E5; &#xB3C4;&#xBA54;&#xC778; &#xC120;&#xD0DD;&#xD558;&#xACE0; &#xD074;&#xB9AD;&#xD074;&#xB9AD; &#xD588;&#xB354;&#xB2C8; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; &#xCD94;&#xC801;&#xD0DC;&#xADF8;&#xAC00; &#xCD94;&#xAC00;&#xB428;&#x1F92F; &#xA0;&#xC774;&#xB7F0; &#xACBD;&#xD5D8;&#xC740; &#xCC98;&#xC74C;&#xD574;&#xBCF4;&#xB294; &#xAC83; &#xAC19;&#xB2E4;. &#xB3C4;&#xBA54;&#xC778;&#xBD80;&#xD130;, &#xD638;&#xC2A4;&#xD305;, &#xBC30;&#xD3EC;, &#xCD94;&#xC801;&#xAE4C;&#xC9C0; &#xB17C;&#xC2A4;&#xD1B1;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xC774; &#xB418;&#xC5B4;&#xBC84;&#xB838;&#xB2E4;. cloudflare&#xC9C4;&#xC9DC; &#xB300;&#xB2E8;&#xD55C;&#xB4EF;</p><p>&#xB300;&#xB7B5; &#xA0;ghost&#xC14B;&#xD305;&#xC5D0; 30&#xBD84;, &#xAE00;&#xC4F0;&#xB294;&#xB370; 30&#xBD84;, cloudflare&#xC14B;&#xD305;&#xD558;&#xB294;&#xB370; 60&#xBD84; &#xC815;&#xB3C4; &#xAC78;&#xB9B0;&#xB4EF; &#xD558;&#xB2E4;.</p>]]></content:encoded></item><item><title><![CDATA[python에서 GIL을 사용하지 않는다면]]></title><description><![CDATA[<p><a href="https://discuss.python.org/t/a-fast-free-threading-python/27903/99?ref=localhost" rel="noreferrer">If PEP 703 is accepted, Meta can commit three engineer-years to no-GIL CPython</a><br>&#xC544;&#xB798;&#xC758; &#xB0B4;&#xC6A9;&#xC740; &#xC704; &#xAE00;&#xC744; &#xBCF4;&#xACE0; chatgpt&#xC640;&#xC758; &#xB300;&#xD654;&#xB97C; &#xC815;&#xB9AC;&#xD55C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p><!--kg-card-begin: markdown--><h2 id="gil%EC%9D%B4%EB%9E%80">GIL&#xC774;&#xB780;?</h2>
<p>Python&#xC758; GIL&#xC774;&#xB780; Global Interpreter Lock&#xC758; &#xC57D;</p>]]></description><link>https://blog.midagedev.com/python-no-gil/</link><guid isPermaLink="false">64b157d3b104a3f8363cfa92</guid><dc:creator><![CDATA[kim hyeoncheol]]></dc:creator><pubDate>Fri, 14 Jul 2023 14:26:32 GMT</pubDate><content:encoded><![CDATA[<p><a href="https://discuss.python.org/t/a-fast-free-threading-python/27903/99?ref=localhost" rel="noreferrer">If PEP 703 is accepted, Meta can commit three engineer-years to no-GIL CPython</a><br>&#xC544;&#xB798;&#xC758; &#xB0B4;&#xC6A9;&#xC740; &#xC704; &#xAE00;&#xC744; &#xBCF4;&#xACE0; chatgpt&#xC640;&#xC758; &#xB300;&#xD654;&#xB97C; &#xC815;&#xB9AC;&#xD55C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p><!--kg-card-begin: markdown--><h2 id="gil%EC%9D%B4%EB%9E%80">GIL&#xC774;&#xB780;?</h2>
<p>Python&#xC758; GIL&#xC774;&#xB780; Global Interpreter Lock&#xC758; &#xC57D;&#xC790;&#xB85C;, &#xD55C; &#xBC88;&#xC5D0; &#xD558;&#xB098;&#xC758; &#xC2A4;&#xB808;&#xB4DC;&#xB9CC; Python &#xBC14;&#xC774;&#xD2B8;&#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB3C4;&#xB85D; &#xC81C;&#xD55C;&#xD558;&#xB294; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC774;&#xB2E4;.</p>
<p>&#xC774;&#xB294; Python &#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xAC00; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xB3D9;&#xC2DC;&#xC5D0; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC2A4;&#xB808;&#xB4DC; &#xAC04;&#xC5D0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC548;&#xC804;&#xD558;&#xAC8C; &#xCC98;&#xB9AC;&#xD558;&#xB3C4;&#xB85D; &#xB3C4;&#xC640;&#xC900;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC774;&#xB85C; &#xC778;&#xD574; &#xBA40;&#xD2F0;&#xCF54;&#xC5B4; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC5D0;&#xC11C; Python&#xC758; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB529;&#xC774; &#xD6A8;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xD65C;&#xC6A9;&#xB418;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xB2E8;&#xC810;&#xC774; &#xC788;&#xB2E4;.<br>
GIL&#xC740; CPython&#xC5D0;&#xC11C;&#xB9CC; &#xBC1C;&#xACAC;&#xB418;&#xBA70;, Jython&#xC774;&#xB098; IronPython&#xACFC; &#xAC19;&#xC740; &#xB2E4;&#xB978; Python &#xAD6C;&#xD604;&#xC5D0;&#xC11C;&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xC81C;&#xD55C;&#xC774; &#xC5C6;&#xB2E4;. &#xB610;&#xD55C;, &#xBCD1;&#xB82C; &#xCC98;&#xB9AC;&#xB97C; &#xD544;&#xC694;&#xB85C; &#xD558;&#xB294; &#xC791;&#xC5C5;&#xC758; &#xACBD;&#xC6B0; Python&#xC758; &#xBA40;&#xD2F0;&#xD504;&#xB85C;&#xC138;&#xC2F1; &#xBAA8;&#xB4C8;&#xC774;&#xB098; &#xC368;&#xB4DC;&#xD30C;&#xD2F0; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC774; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD560; &#xC218; &#xC788;&#xB2E4;.</p>
<h2 id="gil%EC%9D%84-%EC%82%AC%EC%9A%A9%ED%95%98%EC%A7%80-%EC%95%8A%EA%B2%8C-%EB%90%9C%EB%8B%A4%EB%A9%B4">GIL&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xAC8C; &#xB41C;&#xB2E4;&#xBA74;?</h2>
<p>GIL&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xAC8C; &#xB418;&#xBA74;, &#xC5EC;&#xB7EC; &#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xB3D9;&#xC2DC;&#xC5D0; &#xC2E4;&#xD589;&#xB418;&#xBA74;&#xC11C; Python &#xAC1D;&#xCCB4;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xBA40;&#xD2F0; &#xCF54;&#xC5B4; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC5D0;&#xC11C; &#xBCD1;&#xB82C; &#xC791;&#xC5C5;&#xC744; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD558;&#xBBC0;&#xB85C;, &#xC774;&#xB860;&#xC801;&#xC73C;&#xB85C;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC2E4;&#xD589; &#xC18D;&#xB3C4;&#xB97C; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xB098; GIL&#xC774; &#xC5C6;&#xB2E4;&#xBA74;, &#xACF5;&#xC720; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xB300;&#xD55C; &#xB3D9;&#xC2DC; &#xC811;&#xADFC;&#xC744; &#xB9C9;&#xAE30; &#xC704;&#xD55C; &#xC0C8;&#xB85C;&#xC6B4; &#xBC29;&#xBC95;&#xC774; &#xD544;&#xC694;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC989;, &#xC2A4;&#xB808;&#xB4DC; &#xC548;&#xC804;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB354; &#xB9CE;&#xC740; &#xB3D9;&#xAE30;&#xD654;&#xAC00; &#xD544;&#xC694;&#xD574;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xB418;&#xBA74; &#xBCF5;&#xC7A1;&#xC131;&#xC774; &#xC99D;&#xAC00;&#xD558;&#xACE0;, &#xC798;&#xBABB; &#xAD00;&#xB9AC;&#xB41C; &#xACBD;&#xC6B0; &#xB370;&#xC774;&#xD130;&#xC758; &#xC77C;&#xAD00;&#xC131;&#xC774; &#xC190;&#xC0C1;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB610;&#xD55C;, &#xB3D9;&#xAE30;&#xD654;&#xB97C; &#xC704;&#xD55C; &#xC624;&#xBC84;&#xD5E4;&#xB4DC;&#xB85C; &#xC778;&#xD574; &#xC2E4;&#xC81C;&#xB85C; &#xC131;&#xB2A5; &#xD5A5;&#xC0C1;&#xC744; &#xC5BB;&#xC9C0; &#xBABB;&#xD558;&#xACE0;, &#xC624;&#xD788;&#xB824; &#xC131;&#xB2A5;&#xC774; &#xC800;&#xD558;&#xB420; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD2B9;&#xD788; &#xC2A4;&#xB808;&#xB4DC;&#xAC04;&#xC5D0; &#xB9CE;&#xC740; &#xACF5;&#xC720; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC788;&#xB294; &#xACBD;&#xC6B0;&#xC5D0; &#xD574;&#xB2F9;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; GIL&#xC744; &#xC81C;&#xAC70;&#xD558;&#xB294; &#xAC83;&#xC740; &#xAC04;&#xB2E8;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xBA70;, &#xC7A0;&#xC7AC;&#xC801;&#xC73C;&#xB85C; &#xB9CE;&#xC740; &#xBB38;&#xC81C;&#xB97C; &#xCD08;&#xB798;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xC774;&#xC720;&#xB85C;, Python &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB294; &#xC5EC;&#xB7EC; &#xBC88; GIL&#xC744; &#xC81C;&#xAC70;&#xD558;&#xB824;&#xB294; &#xC2DC;&#xB3C4;&#xB97C; &#xD588;&#xC9C0;&#xB9CC; &#xC544;&#xC9C1;&#xAE4C;&#xC9C0;&#xB294; &#xC644;&#xC804;&#xD788; &#xC131;&#xACF5;&#xD558;&#xC9C0; &#xBABB;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="django%EC%97%90%EC%84%9C-gil%EC%9D%B4-%EC%97%86%EB%8A%94-python%EC%9D%84-%EC%93%B4%EB%8B%A4%EB%A9%B4-%EC%96%B4%EB%96%A4-%EC%9E%A5%EB%8B%A8%EC%A0%90%EC%9D%B4-%EC%9E%88%EC%9D%84%EA%B9%8C">django&#xC5D0;&#xC11C; GIL&#xC774; &#xC5C6;&#xB294; python&#xC744; &#xC4F4;&#xB2E4;&#xBA74; &#xC5B4;&#xB5A4; &#xC7A5;&#xB2E8;&#xC810;&#xC774; &#xC788;&#xC744;&#xAE4C;?</h2>
<h3 id="%EC%9E%A5%EC%A0%90">&#xC7A5;&#xC810;:</h3>
<ol>
<li>
<p><strong>&#xBCD1;&#xB82C; &#xCC98;&#xB9AC; &#xAC1C;&#xC120;</strong>: GIL&#xC774; &#xC5C6;&#xB294; &#xACBD;&#xC6B0;, &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xAC01; &#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xB3C5;&#xB9BD;&#xC801;&#xC73C;&#xB85C; &#xB3D9;&#xC2DC;&#xC5D0; &#xC791;&#xC5C5;&#xC744; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB85C; &#xC778;&#xD574; &#xBCD1;&#xB82C; &#xCC98;&#xB9AC; &#xC131;&#xB2A5;&#xC774; &#xD5A5;&#xC0C1;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li>
<p><strong>CPU &#xD65C;&#xC6A9;&#xB3C4; &#xC99D;&#xAC00;</strong>: GIL&#xC774; &#xC5C6;&#xB2E4;&#xBA74;, &#xBA40;&#xD2F0; &#xCF54;&#xC5B4; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC758; &#xBAA8;&#xB4E0; &#xCF54;&#xC5B4;&#xB97C; &#xB3D9;&#xC2DC;&#xC5D0; &#xD65C;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; CPU &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xBCF4;&#xB2E4; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
<h3 id="%EB%8B%A8%EC%A0%90">&#xB2E8;&#xC810;:</h3>
<ol>
<li>
<p><strong>&#xB3D9;&#xAE30;&#xD654; &#xBB38;&#xC81C;</strong>: GIL&#xC774; &#xC5C6;&#xB294; &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xB294; &#xC2A4;&#xB808;&#xB4DC; &#xAC04;&#xC758; &#xB3D9;&#xAE30;&#xD654;&#xB97C; &#xBCF4;&#xB2E4; &#xC2E0;&#xC911;&#xD558;&#xAC8C; &#xCC98;&#xB9AC;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xACF5;&#xC720;&#xB41C; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xB300;&#xD55C; &#xB3D9;&#xC2DC; &#xC811;&#xADFC;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; &#xB370;&#xC774;&#xD130;&#xC758; &#xC77C;&#xAD00;&#xC131;&#xC774; &#xC190;&#xC0C1;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li>
<p><strong>&#xC131;&#xB2A5; &#xC800;&#xD558; &#xAC00;&#xB2A5;&#xC131;</strong>: &#xACFC;&#xB3C4;&#xD55C; &#xC2A4;&#xB808;&#xB4DC; &#xB3D9;&#xAE30;&#xD654;&#xB85C; &#xC778;&#xD55C; &#xC624;&#xBC84;&#xD5E4;&#xB4DC;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xBA74;, &#xC624;&#xD788;&#xB824; &#xC131;&#xB2A5; &#xC800;&#xD558;&#xB97C; &#xCD08;&#xB798;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li>
<p><strong>&#xB514;&#xBC84;&#xAE45; &#xC5B4;&#xB824;&#xC6C0;</strong>: &#xBCD1;&#xB82C; &#xCF54;&#xB4DC;&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xB514;&#xBC84;&#xAE45;&#xC774; &#xC5B4;&#xB835;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2A4;&#xB808;&#xB4DC; &#xAC04;&#xC758; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xC774;&#xB098; &#xACBD;&#xC7C1; &#xC870;&#xAC74; &#xB4F1;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xCC3E;&#xACE0; &#xD574;&#xACB0;&#xD558;&#xB294; &#xAC83;&#xC774; &#xBCF5;&#xC7A1;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
<p>&#xB530;&#xB77C;&#xC11C;, Django&#xC5D0;&#xC11C; GIL&#xC774; &#xC5C6;&#xB294; Python&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB824;&#xBA74; &#xC2A4;&#xB808;&#xB4DC; &#xB3D9;&#xAE30;&#xD654;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xC798; &#xC774;&#xD574;&#xD558;&#xACE0; &#xAD00;&#xB9AC;&#xD560; &#xC904; &#xC54C;&#xC544;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, CPU &#xD65C;&#xC6A9;&#xB3C4;&#xC640; &#xBCD1;&#xB82C; &#xCC98;&#xB9AC; &#xC131;&#xB2A5; &#xD5A5;&#xC0C1;&#xC774; &#xC2E4;&#xC81C;&#xB85C; &#xD544;&#xC694;&#xD55C; &#xACBD;&#xC6B0;&#xC5D0;&#xB9CC; &#xACE0;&#xB824;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="django%EB%8A%94-%EC%A7%80%EA%B8%88-%EC%8A%A4%EB%A0%88%EB%93%9C%EB%A5%BC-%EC%96%B4%EB%96%A4-%EC%8B%9D%EC%9C%BC%EB%A1%9C-%EC%93%B0%EA%B3%A0-%EC%9E%88%EC%96%B4">django&#xB294; &#xC9C0;&#xAE08; &#xC2A4;&#xB808;&#xB4DC;&#xB97C; &#xC5B4;&#xB5A4; &#xC2DD;&#xC73C;&#xB85C; &#xC4F0;&#xACE0; &#xC788;&#xC5B4;?</h2>
<p>Django&#xB294; &#xC694;&#xCCAD;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC2A4;&#xB808;&#xB4DC;&#xB098; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xB370;, &#xADF8; &#xBC29;&#xC2DD;&#xC740; &#xC6F9; &#xC11C;&#xBC84;&#xC758; &#xC124;&#xC815;&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p>Django&#xB294; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xB3D9;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. &#xC989;, &#xD558;&#xB098;&#xC758; &#xC694;&#xCCAD;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xB3D9;&#xC548; &#xB2E4;&#xB978; &#xC694;&#xCCAD;&#xC740; &#xB300;&#xAE30;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC740; &#xAC04;&#xB2E8;&#xD558;&#xACE0; &#xC9C1;&#xAD00;&#xC801;&#xC774;&#xC9C0;&#xB9CC;, &#xC694;&#xCCAD;&#xC774; &#xB9CE;&#xC544;&#xC9C8; &#xACBD;&#xC6B0; &#xD6A8;&#xC728;&#xC131;&#xC774; &#xB5A8;&#xC5B4;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB798;&#xC11C; &#xC2E4;&#xC81C; &#xC6B4;&#xC601; &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xB294; &#xC5EC;&#xB7EC; &#xC694;&#xCCAD;&#xC744; &#xB3D9;&#xC2DC;&#xC5D0; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC6F9; &#xC11C;&#xBC84;&#xB97C; &#xC124;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, WSGI &#xC11C;&#xBC84;&#xC778; Gunicorn&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xACBD;&#xC6B0;, &#xC6CC;&#xCEE4;(worker)&#xB77C;&#xB294; &#xAC1C;&#xB150;&#xC744; &#xD1B5;&#xD574; &#xC694;&#xCCAD;&#xC744; &#xBCD1;&#xB82C;&#xB85C; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6CC;&#xCEE4;&#xB294; &#xBCC4;&#xB3C4;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB098; &#xC2A4;&#xB808;&#xB4DC;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xBA70;, &#xAC01; &#xC6CC;&#xCEE4;&#xB294; &#xB3C5;&#xB9BD;&#xC801;&#xC73C;&#xB85C; &#xC694;&#xCCAD;&#xC744; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xD568;&#xC73C;&#xB85C;&#xC368; Gunicorn&#xC740; &#xC5EC;&#xB7EC; &#xC694;&#xCCAD;&#xC744; &#xB3D9;&#xC2DC;&#xC5D0; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Django 3.1 &#xC774;&#xC0C1;&#xC5D0;&#xC11C;&#xB294; &#xBE44;&#xB3D9;&#xAE30; &#xAE30;&#xB2A5;&#xC774; &#xCD94;&#xAC00;&#xB418;&#xC5B4;, ASGI(Application Server Gateway Interface)&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xBE44;&#xB3D9;&#xAE30; &#xC694;&#xCCAD;&#xB3C4; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74;, Django&#xB294; &#xC6F9;&#xC18C;&#xCF13;&#xACFC; &#xAC19;&#xC740; &#xBE44;&#xB3D9;&#xAE30; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xBA70;, &#xBE44;&#xB3D9;&#xAE30; &#xBDF0;, &#xBBF8;&#xB4E4;&#xC6E8;&#xC5B4;, &#xD14C;&#xC2A4;&#xD2B8; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7EC;&#xB098; Python&#xC758; GIL &#xB54C;&#xBB38;&#xC5D0;, &#xC2F1;&#xAE00; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xB0B4;&#xC5D0;&#xC11C;&#xC758; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB529;&#xC740; &#xC5EC;&#xC804;&#xD788; CPU-bound &#xC791;&#xC5C5;&#xC5D0;&#xC11C;&#xB294; &#xBCD1;&#xB82C;&#xC131;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xBABB;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; CPU &#xC0AC;&#xC6A9;&#xC774; &#xB9CE;&#xC740; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; Django &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xACBD;&#xC6B0;, &#xC5EC;&#xB7EC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xB354; &#xD6A8;&#xC728;&#xC801;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="gunicorn%EC%97%90%EC%84%9C-%EB%A9%80%ED%8B%B0%ED%94%84%EB%A1%9C%EC%84%B8%EC%8A%A4%EA%B0%80-%EC%95%84%EB%8B%8C-%EB%A9%80%ED%8B%B0%EC%8A%A4%EB%A0%88%EB%93%9C-%EB%AA%A8%EB%93%9C%EB%A5%BC-%EC%82%AC%EC%9A%A9%ED%95%98%EB%8A%94-%EA%B2%83%EC%9D%B4-%EC%9D%B4%EC%A0%90">gunicorn&#xC5D0;&#xC11C; &#xBA40;&#xD2F0;&#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC544;&#xB2CC; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC774;&#xC810;</h2>
<p>Gunicorn&#xC5D0;&#xC11C; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC774;&#xC810;&#xC774; &#xB420; &#xC218; &#xC788;&#xB294; &#xC0C1;&#xD669;&#xB4E4;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC;&#xC640; &#xBA40;&#xD2F0;&#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xAC01;&#xAC01;&#xC758; &#xC7A5;&#xB2E8;&#xC810;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xACE0;, &#xADF8; &#xC120;&#xD0DD;&#xC740; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xD2B9;&#xC131;&#xACFC; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9D1;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xC758; &#xC8FC;&#xC694; &#xC774;&#xC810;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;:</p>
<ol>
<li>
<p><strong>&#xBA54;&#xBAA8;&#xB9AC; &#xD6A8;&#xC728;&#xC131;</strong>: &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C;&#xB294;, &#xBAA8;&#xB4E0; &#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xAC19;&#xC740; &#xBA54;&#xBAA8;&#xB9AC; &#xACF5;&#xAC04;&#xC744; &#xACF5;&#xC720;&#xD558;&#xBBC0;&#xB85C; &#xBA54;&#xBAA8;&#xB9AC; &#xC0AC;&#xC6A9;&#xB7C9;&#xC774; &#xC904;&#xC5B4;&#xB4ED;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74;&#xC5D0;, &#xBA40;&#xD2F0;&#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#xAC01; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xB3C5;&#xB9BD;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xACF5;&#xAC04;&#xC744; &#xAC00;&#xC9C0;&#xBBC0;&#xB85C;, &#xBE44;&#xC2B7;&#xD55C; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD558;&#xB354;&#xB77C;&#xB3C4; &#xBA54;&#xBAA8;&#xB9AC; &#xC0AC;&#xC6A9;&#xB7C9;&#xC774; &#xB298;&#xC5B4;&#xB0A9;&#xB2C8;&#xB2E4;.</p>
</li>
<li>
<p><strong>&#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC2A4;&#xC704;&#xCE6D;</strong>: &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; &#xC2A4;&#xB808;&#xB4DC; &#xAC04;&#xC758; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC2A4;&#xC704;&#xCE6D;&#xC740; &#xBA40;&#xD2F0;&#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC04;&#xC758; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC2A4;&#xC704;&#xCE6D;&#xBCF4;&#xB2E4; &#xC624;&#xBC84;&#xD5E4;&#xB4DC;&#xAC00; &#xC801;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xACF5;&#xC720;&#xD558;&#xBBC0;&#xB85C; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC815;&#xBCF4;&#xB97C; &#xAD50;&#xD658;&#xD558;&#xB294; &#xB370; &#xBE44;&#xC6A9;&#xC774; &#xB35C; &#xB4E4;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
<p>&#xADF8;&#xB7EC;&#xB098; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; Python&#xC758; GIL(Global Interpreter Lock)&#xC774; &#xBCD1;&#xBAA9;&#xC774; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, &#xD55C; &#xBC88;&#xC5D0; &#xD558;&#xB098;&#xC758; &#xC2A4;&#xB808;&#xB4DC;&#xB9CC;&#xC774; &#xC2E4;&#xD589;&#xB420; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; CPU-bound &#xC791;&#xC5C5;&#xC5D0;&#xC11C;&#xB294; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xBCD1;&#xB82C;&#xC131;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC9C0; &#xBABB;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; Gunicorn&#xC5D0;&#xC11C; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC774;&#xC810;&#xC774; &#xB418;&#xB294;&#xC9C0;&#xB294; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xD2B9;&#xC131;&#xACFC; &#xD658;&#xACBD;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;. I/O-bound &#xC791;&#xC5C5;&#xC774; &#xB9CE;&#xC740; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0;&#xC11C;&#xB294; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xD6A8;&#xACFC;&#xC801;&#xC77C; &#xC218; &#xC788;&#xC73C;&#xBA70;, &#xBC18;&#xB300;&#xB85C; CPU-bound &#xC791;&#xC5C5;&#xC774; &#xB9CE;&#xC740; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0;&#xC11C;&#xB294; &#xBA40;&#xD2F0;&#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xB354; &#xB098;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="db%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%A5%BC-%EC%8B%9C%EB%A6%AC%EC%96%BC%EB%9D%BC%EC%9D%B4%EC%A6%88-%ED%95%98%EB%8A%94-%EC%9D%BC%EC%9D%B4-%EB%8C%80%EB%B6%80%EB%B6%84%EC%9D%B4%EB%9D%BC%EB%A9%B4">DB&#xB370;&#xC774;&#xD130;&#xB97C; &#xC2DC;&#xB9AC;&#xC5BC;&#xB77C;&#xC774;&#xC988; &#xD558;&#xB294; &#xC77C;&#xC774; &#xB300;&#xBD80;&#xBD84;&#xC774;&#xB77C;&#xBA74;</h2>
<p>&#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0;&#xC11C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAC00;&#xC838;&#xC624;&#xB294; &#xC791;&#xC5C5;&#xC740; &#xB300;&#xBD80;&#xBD84; I/O-bound &#xC791;&#xC5C5;&#xC785;&#xB2C8;&#xB2E4;. &#xC989;, &#xC774;&#xB7EC;&#xD55C; &#xC791;&#xC5C5;&#xC740; CPU &#xC5F0;&#xC0B0;&#xBCF4;&#xB2E4;&#xB294; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB098; &#xB514;&#xC2A4;&#xD06C; I/O&#xC5D0; &#xC758;&#xD574; &#xC131;&#xB2A5;&#xC774; &#xACB0;&#xC815;&#xB429;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC774;&#xB7F0; &#xACBD;&#xC6B0;, &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xAC00; &#xB354; &#xC801;&#xD569;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#xC2A4;&#xB808;&#xB4DC;&#xB4E4;&#xC774; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xACF5;&#xC720;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xBA54;&#xBAA8;&#xB9AC; &#xC0AC;&#xC6A9;&#xB7C9;&#xC774; &#xB354; &#xC801;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC2A4;&#xB808;&#xB4DC; &#xAC04;&#xC758; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC2A4;&#xC704;&#xCE6D; &#xBE44;&#xC6A9;&#xC774; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC04;&#xC758; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xC2A4;&#xC704;&#xCE6D; &#xBE44;&#xC6A9;&#xBCF4;&#xB2E4; &#xC801;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, I/O-bound &#xC791;&#xC5C5;&#xC5D0;&#xC11C;&#xB294; &#xB354; &#xD6A8;&#xC728;&#xC801;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xD658;&#xACBD;&#xC5D0;&#xC11C;&#xB294; &#xB3D9;&#xC2DC;&#xC131; &#xC81C;&#xC5B4;&#xC5D0; &#xC8FC;&#xC758;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC218;&#xC758; &#xC2A4;&#xB808;&#xB4DC;&#xAC00; &#xB3D9;&#xC77C;&#xD55C; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xB3D9;&#xC2DC;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294; &#xACBD;&#xC6B0;, &#xB370;&#xC774;&#xD130;&#xC758; &#xC77C;&#xAD00;&#xC131;&#xC744; &#xC720;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xB3D9;&#xAE30;&#xD654;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xC99D;&#xAC00;&#xC2DC;&#xD0A4;&#xACE0;, &#xC798;&#xBABB; &#xAD00;&#xB9AC;&#xB418;&#xBA74; &#xBC84;&#xADF8;&#xB97C; &#xC720;&#xBC1C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xB530;&#xB77C;&#xC11C; &#xC774;&#xB7EC;&#xD55C; &#xC694;&#xC18C;&#xB4E4;&#xC744; &#xC885;&#xD569;&#xC801;&#xC73C;&#xB85C; &#xACE0;&#xB824;&#xD558;&#xC5EC;, &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xD2B9;&#xC131;, &#xD2B8;&#xB798;&#xD53D; &#xD328;&#xD134;, &#xC11C;&#xBC84;&#xC758; &#xC790;&#xC6D0; &#xB4F1;&#xC5D0; &#xB530;&#xB77C; &#xAC00;&#xC7A5; &#xC801;&#xD569;&#xD55C; &#xBAA8;&#xB4DC;&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h2 id="%EC%8A%A4%EB%A0%88%EB%93%9C%EB%A5%BC-%EC%82%AC%EC%9A%A9%ED%95%98%EC%A7%80-%EC%95%8A%EB%8A%94-%ED%8E%B8%EC%9D%B4-%EA%B0%9C%EB%B0%9C-%EB%82%9C%EC%9D%B4%EB%8F%84%EA%B0%80-%EB%82%AE%EB%8B%A4%EA%B3%A0-%ED%95%A0-%EC%88%98-%EC%9E%88%EC%9D%84%EA%B9%8C">&#xC2A4;&#xB808;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xD3B8;&#xC774; &#xAC1C;&#xBC1C; &#xB09C;&#xC774;&#xB3C4;&#xAC00; &#xB0AE;&#xB2E4;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;?</h2>
<p>&#xC608;, &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC2A4;&#xB808;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xB3D9;&#xAE30; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774; &#xBE44;&#xB3D9;&#xAE30;&#xB098; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xBE44;&#xD574; &#xAC1C;&#xBC1C; &#xB09C;&#xC774;&#xB3C4;&#xAC00; &#xB0AE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC774;&#xC720; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;:</p>
<ol>
<li>
<p><strong>&#xBCF5;&#xC7A1;&#xC131; &#xAC10;&#xC18C;</strong>: &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C;&#xB294; &#xC2A4;&#xB808;&#xB4DC;&#xAC04;&#xC758; &#xC0C1;&#xD638;&#xC791;&#xC6A9; &#xBC0F; &#xB3D9;&#xAE30;&#xD654; &#xBB38;&#xC81C;&#xB97C; &#xCC98;&#xB9AC;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xBB38;&#xC81C;&#xB294; &#xBCF5;&#xC7A1;&#xC131;&#xC744; &#xB192;&#xC774;&#xBA70;, &#xC885;&#xC885; &#xBC84;&#xADF8;&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xB294; &#xC6D0;&#xC778;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>
</li>
<li>
<p><strong>&#xB514;&#xBC84;&#xAE45; &#xC6A9;&#xC774;&#xC131;</strong>: &#xB3D9;&#xAE30; &#xCF54;&#xB4DC;&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xB514;&#xBC84;&#xAE45;&#xD558;&#xAE30; &#xC27D;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCF54;&#xB4DC;&#xC758; &#xD750;&#xB984;&#xC774; &#xBA85;&#xD655;&#xD558;&#xACE0; &#xC608;&#xCE21; &#xAC00;&#xB2A5;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBB38;&#xC81C;&#xB97C; &#xCC3E;&#xACE0; &#xD574;&#xACB0;&#xD558;&#xB294; &#xAC83;&#xC774; &#xB354; &#xAC04;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;. &#xBC18;&#xBA74;, &#xBE44;&#xB3D9;&#xAE30;&#xB098; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xCF54;&#xB4DC;&#xB294; &#xB3D9;&#xC2DC;&#xC131; &#xBB38;&#xC81C;&#xB85C; &#xC778;&#xD574; &#xB514;&#xBC84;&#xAE45;&#xC774; &#xB354; &#xC5B4;&#xB824;&#xC6B8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
<li>
<p><strong>&#xCF54;&#xB4DC; &#xAC00;&#xB3C5;&#xC131;</strong>: &#xB3D9;&#xAE30; &#xCF54;&#xB4DC;&#xB294; &#xC704;&#xC5D0;&#xC11C; &#xC544;&#xB798;&#xB85C; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xBBC0;&#xB85C;, &#xAC00;&#xB3C5;&#xC131;&#xC774; &#xB192;&#xACE0; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC27D;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBE44;&#xB3D9;&#xAE30;&#xB098; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xCF54;&#xB4DC;&#xB294; &#xC774;&#xBCA4;&#xD2B8; &#xB8E8;&#xD504;, &#xCF5C;&#xBC31;, &#xD504;&#xB85C;&#xBBF8;&#xC2A4; &#xB4F1;&#xC758; &#xAC1C;&#xB150;&#xC744; &#xC774;&#xD574;&#xD574;&#xC57C; &#xD558;&#xBA70;, &#xCF54;&#xB4DC; &#xD750;&#xB984;&#xC744; &#xCD94;&#xC801;&#xD558;&#xAE30; &#xC5B4;&#xB824;&#xC6B8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
</ol>
<p>&#xADF8;&#xB7EC;&#xB098; &#xC774;&#xB7EC;&#xD55C; &#xC774;&#xC810;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0;, &#xB300;&#xADDC;&#xBAA8; &#xC11C;&#xBE44;&#xC2A4;&#xB098; I/O &#xC791;&#xC5C5;&#xC774; &#xB9CE;&#xC740; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0;&#xC11C;&#xB294; &#xBE44;&#xB3D9;&#xAE30;&#xB098; &#xBA40;&#xD2F0;&#xC2A4;&#xB808;&#xB4DC; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xD6A8;&#xC728;&#xC801;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xC131;&#xB2A5;&#xC744; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0A4;&#xACE0;, &#xC11C;&#xBC84; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xB354; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xD65C;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xC694;&#xAD6C; &#xC0AC;&#xD56D;&#xC5D0; &#xB530;&#xB77C; &#xC801;&#xC808;&#xD55C; &#xC811;&#xADFC;&#xBC95;&#xC744; &#xC120;&#xD0DD;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
<!--kg-card-end: markdown--><p></p><p></p>]]></content:encoded></item></channel></rss>